[

  {
    "reviewer": "Carlos M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/891372896/",
    "review": "  This wonderful film begins as a simple drama that slowly introduces us to the characters and to the details of their vacation together until we are suddenly hit by a devastating tragedy that brings about the bitter consequences of many hidden truths and moral issues.",
    "rating": "40",
    "date": "May 27, 2010"
  },
  {
    "reviewer": "Aaron N",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/185584554/",
    "review": "  Sepideh: Now, what does he think about Elly?It is interesting to go back in time with a director I have only recently found myself so intrigued by in recent years. Academy Award winner Asghar Farhadi had made four other films prior to A Separation and The Past. About Elly is one that somehow got lost in the shuffle as far as getting an American release. Regardless, the film has now arrived and continues to shed light on what a talent Farhadi is in capturing human drama.The film is something of a mystery set among a group of old friends on a holiday retreat. With the return of a close friend, a group of former college pals decide to reunite for a weekend outing by the Caspian Sea. While things begin in good spirits, complete with an attempt to hook up two individuals, trivial lies start accumulating and things really escalate when a sudden disappearance occurs. This sets in motion a series of deceptions and revelations that threaten to shatter everything.As I mentioned, this film really continues to prove how adept Farhadi is at developing human drama. That it is not quite as good as A Separation or The Past only suggests that Farhadi has improved only time as a filmmaker, given how good About Elly still is. This is a film that is stripped down of nearly everything, aside from some narrative ambition when it comes to utilizing the location for high tension. What is left are a collection of characters and a screenplay that allows for very natural conversations, arguments, and other relatable interactions.",
    "rating": "40",
    "date": "June 19, 2015"
  },
  {
    "reviewer": "familiar s",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/846056139/",
    "review": "  More engaging than disappointing, About Elly has some outrageous performances, while none outstanding. Worth a shot, nonetheless.",
    "rating": "25",
    "date": "June 6, 2012"
  },
  {
    "reviewer": "El Z.",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/933113837/",
    "review": "  Yes, I liked it, and I want to support this filmmaker. I went to see it because of The Separation, because of how fantastic that film was. This one is not as good, but still interesting. Lots of dialogue to read. I did not feel the storyline was set up well... i felt confused at times, and this is unusual for me. I kept feeling like there was something I missed.All this said, it was interesting, and I recommend it.",
    "rating": "50",
    "date": "June 7, 2015"
  },
  {
    "reviewer": "Harlequin68",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/900682338/",
    "review": "  In \"About Elly,\" a group of friends travel to the seaside during a holiday weekend. They are all married couples and their children with the exceptions of Ahmad(Shahab Hosseini) who has just returned to Iran from Germany and a divorce and Elly(Taraneh Alidoosti) who is one of the children's teachers. So, there is hope that they will become better acquainted. But sadly there is no hope for them to stay at the house they had wanted to since it had been reserved by a wedding party, so they will have to rough it out in an unfurbished house closer to the sea.\"About Elly\" teases out a tantalizing mystery. But after that, director Asghar Farhadi does something rather interesting by almost tying the movie into a knot exploring a single procedural point. But considering he has shown a great deal of interest in the Iranian legal system in his other films, I think he is trying to make a point here however subtly through exaggeration about how such minutiae can weigh down everyday life in Iran.",
    "rating": "35",
    "date": "April 27, 2015"
  },
  {
    "reviewer": "Daniel P",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/364189142/",
    "review": "  \"A bitter ending is better than endless bitterness.\"A naturalistic, deeply gripping drama that in its second half practically plays as a thriller. In this modern Iranian film, a sudden shock shifts what we know about a character and further muddles the motivations of another. It deftly demonstrates what can result from small deceptions, lies and and half-truths without ever making judgements or offering easy answers. Above all the film is exceptionally well written and acted, and though it isn't as emotionally satisfying as the director's later masterpieces A Separation and The Past, it remains a cerebral and powerful film.",
    "rating": "40",
    "date": "March 4, 2013"
  },
  {
    "reviewer": "mvieaddict",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/830255989/",
    "review": "  I was always fascinated by Persian cinema. About Elly was my first movie of this Persian director Farhadi .The movie opened with a simple plot, and ends with much more simplicity.The cast was great, Farhadi did a great job in putting the viewer inside the locations to live with the story. A group of married couples, some with children, went to the North of Iran to have a 3 days vacation.The director showed here clearly the consequences of lies and deceptions. How lies even for inconvenience can lead to unexpected events. Farhadi got the best performances from his actors,specially Golshifteh Farahani who played the role of Sepideh so convincingly.",
    "rating": "40",
    "date": "July 5, 2009"
  },
  {
    "reviewer": "Matt H",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/897795408/",
    "review": "  A movie made 5 years ago or so that's only getting a NA release now, About Elly is an interesting addition to Farhadi's filmography that feels like a stepping stone to A Separation and The Past. While not as good as those two great movies, About Elly is still pretty good. It reminded me a little of Picnic at Hanging Rock, in terms of the feeling of mystery it exudes as well as also having a disappearance. Sepideh is a great and very interesting character, the actress really brings her to life.",
    "rating": "35",
    "date": "December 31, 2015"
  },
  {
    "reviewer": "Calvin C",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/782314003/",
    "review": "  I thought A SEPARATION was one of the best films of its given year. I understand ABOUT ELLY came before that film but just released this year and I can easily say this new film from Asghar Farhadi is one of the year's best. It starts off as a drama about a group of friends on vacation and ends up being a dark mystery where nothing is what it seems. All the characters are suspicious and you have no idea who to trust. Farhadi is great at developing his characters slowly in the beginning, setting everything up, so when the real plot kicks in, we too are able to judge them because we feel we have known them the same amount of time as those on screen. Grade: A",
    "rating": "45",
    "date": "October 6, 2015"
  },
  {
    "reviewer": "Steven L",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/783914004/",
    "review": "  Lies, lies and more lies keep the viewer guessing (and frustrated) as this mystery unfolds.Try to watch it with someone from Iran (or at least discuss it afterward with that person) to gain a fuller understanding of why certain things happen. Artfully created.",
    "rating": "40",
    "date": "January 23, 2016"
  },
  {
    "reviewer": "Ian C",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/906625707/",
    "review": "  this fucking guy lol",
    "rating": "40",
    "date": "January 21, 2016"
  },
  {
    "reviewer": "Beth D",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/972978016/",
    "review": "  This was without a doubt the WORST movie I have ever seen!! AGONIZING to watch and over acted.",
    "rating": "05",
    "date": "January 8, 2016"
  },
  {
    "reviewer": "Kevin M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/900314916/",
    "review": "  Great acting a bit a of mystery make this a film worth watching. Granting this movie an incredible 98% is a bit much for my taste though.",
    "rating": "35",
    "date": "October 22, 2015"
  },
  {
    "reviewer": "Moovie Gab",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/972223247/",
    "review": "  I can go and on about Iranian writer/director Asghar Farhadi, who received global recognition for his 2011 Oscar-winning A Separation. That film absolutely blew me away. Named one of the 100 Most Influential People in the world by Timemagazine in 2012, Farhadi is intricate in his weaving of society's interpersonal conflicts within a seemingly straight-forward story. Playing at Berlin and Tribeca film festivals in 2009, Farhadi's About Elly was lauded by film theorist and historian David Bordwell as \"a masterpiece.\"The film opens on a light note, with a group of old friends, made up of three couples and their children, traveling from Tehran to the Caspian Sea for a beach getaway. Joining them are Ahmad (Shahab Hosseini) and Elly (Taraneh Alidoosti). Ahmad, an affable Iranian who returns from Germany after a recent split with his wife, is open to the idea of being matchmade with Elly, an elusive but obliging kindergarten teacher of the daughter of Sepideh (Golshifteh Farahani), who organized the getaway. Sepideh's secret plan to introduce both of them is welcomed by the rest of the group, but we'll soon find out that it's the least of her string of little white lies which will play a part in the twist of events coming. As Elly fits into the group of friends since their university days, act 1 is a clever intention for us to observe and get to know more about each character as they joke, laugh, break bread and end the day with a game of charades.About Elly quickly ratchets up suspense in act 2 the next day, as the upbeat mood of their weekend takes a dark turn when Elly suddenly goes missing. Leaving the group helplessly clueless, has she drowned in the angry sea attempting to save a child, or has she abruptly left the place unannounced despite Sepideh's pestering to stay. What appears to be another kitchen sink drama suddenly erupts into panic mode, trampled by series of revelations that challenge the moral core of these characters. These developments ooze varying degrees of mistrust and hostility among the friends, whilst audience is kept anxious coupled with the soundtrack of endless crashing waves so cleverly added to further bring us into the scene.What's so brilliant about this film is the revelation that the actual whereabouts of the titular character no longer seems important at the end, as we witness how each small lie repeatedly breeds damaging consequences. Whilst a woman's disappearance is on the line, what eventually matters is how each of the character deals with the crisis, broods over each other's surfacing dishonesty and unconsciously depend on them to salvage their own dignity. Farhadi builds an elaborate psychodrama depicting how harmless intentions can culminate into most scourging and life-changing events. Using everyday lives and conversations, his film has an uncomfortable but important message to tell. And along with some of the other films which are in my top list, what I really love is how the film lets audience decipher the clues and make our own conclusions. All the characters' performances are on point, especially Golshifteh Farahani. Even the children are invested in the emotional roller-coaster, making this film another testament of Farhadi's excellent filmmaking.",
    "rating": "50",
    "date": "November 11, 2015"
  },
  {
    "reviewer": "Gina W",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/928436672/",
    "review": "  A group of Iranian friends vacationing at the Caspian Sea, there's a mystery. Elly has either drowned or left the villa. Based on a few simple lies, this leads up to tragedy between the friends.",
    "rating": "35",
    "date": "October 28, 2015"
  },
  {
    "reviewer": "Alex S",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/928639325/",
    "review": "  About Elly is an unbelievably human portrait that mixes convincing characters with realistic internal struggles to create an unforgettable psychological study that makes a profound statement on the nature of guilt on people's decisions.",
    "rating": "50",
    "date": "October 22, 2015"
  },
  {
    "reviewer": "Maksim",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/900983430/",
    "review": "  A brilliant and very powerful art-house drama and mystery, About Elly is a typical Asghar Farhadi movie. Restrained, but completely captivating, this new gem from the director of A Separation and The Past remains truth to the mesmerizing story-telling of its writer and director.Down-to-earth and depicting the normal life of Iranian people, this a drama and a mystery based on believes, traditions, social prejudices and human relationships. Even though it is not as captivating as A Separation, About Elly has a certain level of emotional load that differentiates from the previous Farhadi deliveries. Issues of gender politics and moral traditions mixed with attempts for post-modern thinking, sadness and realistic moments of shock which all combined in one story result in a stunningly realistic and touching movie. It is certainly not a movie to be enjoyed by mainstream audiences, but if you are looking for a quality examples of art-house classics. About Elly is a must see!",
    "rating": "45",
    "date": "March 30, 2015"
  },
  {
    "reviewer": "Joe M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/950128016/",
    "review": "  Wow!! Can't quite understand the hoopla about this film. From the beginning, just dialogue that goes no where, to the end, where it ends where we expected it to end all along. Imagine if you lost your keys, and every family member kept repeating, \"Where could your keys be? Are they in your pocket? Oh no, I thought I saw them in the basement!!!\" Then here comes the climax. You found your keys where you usually keep them!!! Boring dialogue, and the movie is completely filmed at this beach house, with the characters going in and out of the house jibber jabbering, and then onto the beach, and then back in the house, \"Oh, where is Elly!!\" Wow, come on. This movie sucked.",
    "rating": "20",
    "date": "October 12, 2015"
  },
  {
    "reviewer": "Buzz A",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/916455622/",
    "review": "  A good Iranian drama although the personalities seem to be somewhat interchangeable. The direction is rough in spots. Segues a bit confusing. All-in-all a good to watch flick that reveals much about the Iranian culture which is good compensation for any short-falling.",
    "rating": "35",
    "date": "September 21, 2015"
  }
,
  {
    "reviewer": "Steven L",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/783914004/",
    "review": "  Lies, lies and more lies keep the viewer guessing (and frustrated) as this mystery unfolds.Try to watch it with someone from Iran (or at least discuss it afterward with that person) to gain a fuller understanding of why certain things happen. Artfully created.",
    "rating": "40",
    "date": "January 23, 2016"
  },
  {
    "reviewer": "Ian C",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/906625707/",
    "review": "  this fucking guy lol",
    "rating": "40",
    "date": "January 21, 2016"
  },
  {
    "reviewer": "Beth D",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/972978016/",
    "review": "  This was without a doubt the WORST movie I have ever seen!! AGONIZING to watch and over acted.",
    "rating": "05",
    "date": "January 8, 2016"
  },
  {
    "reviewer": "Matt H",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/897795408/",
    "review": "  A movie made 5 years ago or so that's only getting a NA release now, About Elly is an interesting addition to Farhadi's filmography that feels like a stepping stone to A Separation and The Past. While not as good as those two great movies, About Elly is still pretty good. It reminded me a little of Picnic at Hanging Rock, in terms of the feeling of mystery it exudes as well as also having a disappearance. Sepideh is a great and very interesting character, the actress really brings her to life.",
    "rating": "35",
    "date": "December 31, 2015"
  },
  {
    "reviewer": "Kevin M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/900314916/",
    "review": "  Great acting a bit a of mystery make this a film worth watching. Granting this movie an incredible 98% is a bit much for my taste though.",
    "rating": "35",
    "date": "October 22, 2015"
  },
  {
    "reviewer": "Moovie Gab",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/972223247/",
    "review": "  I can go and on about Iranian writer/director Asghar Farhadi, who received global recognition for his 2011 Oscar-winning A Separation. That film absolutely blew me away. Named one of the 100 Most Influential People in the world by Timemagazine in 2012, Farhadi is intricate in his weaving of society's interpersonal conflicts within a seemingly straight-forward story. Playing at Berlin and Tribeca film festivals in 2009, Farhadi's About Elly was lauded by film theorist and historian David Bordwell as \"a masterpiece.\"The film opens on a light note, with a group of old friends, made up of three couples and their children, traveling from Tehran to the Caspian Sea for a beach getaway. Joining them are Ahmad (Shahab Hosseini) and Elly (Taraneh Alidoosti). Ahmad, an affable Iranian who returns from Germany after a recent split with his wife, is open to the idea of being matchmade with Elly, an elusive but obliging kindergarten teacher of the daughter of Sepideh (Golshifteh Farahani), who organized the getaway. Sepideh's secret plan to introduce both of them is welcomed by the rest of the group, but we'll soon find out that it's the least of her string of little white lies which will play a part in the twist of events coming. As Elly fits into the group of friends since their university days, act 1 is a clever intention for us to observe and get to know more about each character as they joke, laugh, break bread and end the day with a game of charades.About Elly quickly ratchets up suspense in act 2 the next day, as the upbeat mood of their weekend takes a dark turn when Elly suddenly goes missing. Leaving the group helplessly clueless, has she drowned in the angry sea attempting to save a child, or has she abruptly left the place unannounced despite Sepideh's pestering to stay. What appears to be another kitchen sink drama suddenly erupts into panic mode, trampled by series of revelations that challenge the moral core of these characters. These developments ooze varying degrees of mistrust and hostility among the friends, whilst audience is kept anxious coupled with the soundtrack of endless crashing waves so cleverly added to further bring us into the scene.What's so brilliant about this film is the revelation that the actual whereabouts of the titular character no longer seems important at the end, as we witness how each small lie repeatedly breeds damaging consequences. Whilst a woman's disappearance is on the line, what eventually matters is how each of the character deals with the crisis, broods over each other's surfacing dishonesty and unconsciously depend on them to salvage their own dignity. Farhadi builds an elaborate psychodrama depicting how harmless intentions can culminate into most scourging and life-changing events. Using everyday lives and conversations, his film has an uncomfortable but important message to tell. And along with some of the other films which are in my top list, what I really love is how the film lets audience decipher the clues and make our own conclusions. All the characters' performances are on point, especially Golshifteh Farahani. Even the children are invested in the emotional roller-coaster, making this film another testament of Farhadi's excellent filmmaking.",
    "rating": "50",
    "date": "November 11, 2015"
  },
  {
    "reviewer": "Carlos M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/891372896/",
    "review": "  This wonderful film begins as a simple drama that slowly introduces us to the characters and to the details of their vacation together until we are suddenly hit by a devastating tragedy that brings about the bitter consequences of many hidden truths and moral issues.",
    "rating": "40",
    "date": "May 27, 2010"
  },
  {
    "reviewer": "Gina W",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/928436672/",
    "review": "  A group of Iranian friends vacationing at the Caspian Sea, there's a mystery. Elly has either drowned or left the villa. Based on a few simple lies, this leads up to tragedy between the friends.",
    "rating": "35",
    "date": "October 28, 2015"
  },
  {
    "reviewer": "Alex S",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/928639325/",
    "review": "  About Elly is an unbelievably human portrait that mixes convincing characters with realistic internal struggles to create an unforgettable psychological study that makes a profound statement on the nature of guilt on people's decisions.",
    "rating": "50",
    "date": "October 22, 2015"
  },
  {
    "reviewer": "Maksim",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/900983430/",
    "review": "  A brilliant and very powerful art-house drama and mystery, About Elly is a typical Asghar Farhadi movie. Restrained, but completely captivating, this new gem from the director of A Separation and The Past remains truth to the mesmerizing story-telling of its writer and director.Down-to-earth and depicting the normal life of Iranian people, this a drama and a mystery based on believes, traditions, social prejudices and human relationships. Even though it is not as captivating as A Separation, About Elly has a certain level of emotional load that differentiates from the previous Farhadi deliveries. Issues of gender politics and moral traditions mixed with attempts for post-modern thinking, sadness and realistic moments of shock which all combined in one story result in a stunningly realistic and touching movie. It is certainly not a movie to be enjoyed by mainstream audiences, but if you are looking for a quality examples of art-house classics. About Elly is a must see!",
    "rating": "45",
    "date": "March 30, 2015"
  },
  {
    "reviewer": "Joe M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/950128016/",
    "review": "  Wow!! Can't quite understand the hoopla about this film. From the beginning, just dialogue that goes no where, to the end, where it ends where we expected it to end all along. Imagine if you lost your keys, and every family member kept repeating, \"Where could your keys be? Are they in your pocket? Oh no, I thought I saw them in the basement!!!\" Then here comes the climax. You found your keys where you usually keep them!!! Boring dialogue, and the movie is completely filmed at this beach house, with the characters going in and out of the house jibber jabbering, and then onto the beach, and then back in the house, \"Oh, where is Elly!!\" Wow, come on. This movie sucked.",
    "rating": "20",
    "date": "October 12, 2015"
  },
  {
    "reviewer": "Steve W",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/785245485/",
    "review": "  Retroactively released after the success of A Separation and The Past, About Elly is a simple drama that occurs over one weekend that spirals out of control. A school teacher named Elly is invited to a getaway near a beach, but things quickly escalate when she disappears. Then more secrets and lies get uncovered, and what follows is a tense drama with solid performances. It doesn't have the bite of Farhadi's later movies, but its still a decent watch for a minimalist drama with lots of insight into that culture.",
    "rating": "30",
    "date": "October 8, 2015"
  },
  {
    "reviewer": "Calvin C",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/782314003/",
    "review": "  I thought A SEPARATION was one of the best films of its given year. I understand ABOUT ELLY came before that film but just released this year and I can easily say this new film from Asghar Farhadi is one of the year's best. It starts off as a drama about a group of friends on vacation and ends up being a dark mystery where nothing is what it seems. All the characters are suspicious and you have no idea who to trust. Farhadi is great at developing his characters slowly in the beginning, setting everything up, so when the real plot kicks in, we too are able to judge them because we feel we have known them the same amount of time as those on screen. Grade: A",
    "rating": "45",
    "date": "October 6, 2015"
  },
  {
    "reviewer": "Buzz A",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/916455622/",
    "review": "  A good Iranian drama although the personalities seem to be somewhat interchangeable. The direction is rough in spots. Segues a bit confusing. All-in-all a good to watch flick that reveals much about the Iranian culture which is good compensation for any short-falling.",
    "rating": "35",
    "date": "September 21, 2015"
  },
  {
    "reviewer": "Deeyn M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/906880815/",
    "review": "  Watch only if your copy has good English translation. The takeaway is a glimpse of modern Iran: it's both conservative (the sacredness of marriage, unmarried couples don't go on trips together) and the dark side of it (domestic abuse). At the same time, the characters seemed normal, have access to cellphones, women drive cars and seem cheerful and content, at least in the First Act of the film. Unfortunately, we got a poorly translated copy in that one of the characters, visibly very upset, was offered a \"sedative\" in which the upset character said \"toilet\". At least, my Baes and I have a new inside joke. ??",
    "rating": "30",
    "date": "September 4, 2015"
  },
  {
    "reviewer": "Adrian S",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/792478225/",
    "review": "  For sheer cunning in scriptwriting, About Elly aces! As with the highly-lauded A Separation, Iranian maestro Asghar Farhadi is at the peak of his powers with this chilling twisty-turny thriller that examines (with scalpel-precision) the devastating consequences of lies. Though it starts off deceptively-perky (though peppered with nuanced foreshadowing), Elly starts plunging the viewer into psychological unease as lie after lie are laid bare after a near-tragedy. Sure to please fans of Hitchcock!",
    "rating": "45",
    "date": "September 19, 2015"
  },
  {
    "reviewer": "James O",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/908142912/",
    "review": "  A lady dies which is quite a big deal but the melodrama that follows is pretty ridiculous. I don't really understand the plot very well. You'd think that someone dying was bad but somehow we're led to believe a white lie is a bigger deal. I got bored and disinterested.",
    "rating": "20",
    "date": "September 13, 2015"
  },
  {
    "reviewer": "Joe C",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/787098666/",
    "review": "  WOW! If Iranian cinema has films like this to offer, I've really been missing out! A total modern-day homage to Michelangelo Antonioni!",
    "rating": "45",
    "date": "August 21, 2015"
  },
  {
    "reviewer": "Diganta B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/854557977/",
    "review": "  Magnificent script writing and acting.",
    "rating": "40",
    "date": "August 16, 2015"
  },
  {
    "reviewer": "Leena L",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/799297253/",
    "review": "  Best part of the film: the waves at the beach. Which in a way symbolize the entire story. What I did not like was the end, we never knew if it really was her at the morgue, or what was up with the boyfriend and many other things. Then again, maybe that was the beauty of the film, it kept you guessing and did not give you away its secrets, even in the end.",
    "rating": "30",
    "date": "August 9, 2015"
  }
,
  {
    "reviewer": "Paul A",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/957972740/",
    "review": "  Beautiful script fabulous theme and as usual another master piece",
    "rating": "50",
    "date": "August 2, 2015"
  },
  {
    "reviewer": "Elizabeth M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/874692669/",
    "review": "  Ahmad: A bitter ending is better than an endless bitterness.Asghar Farhadi es un director que toma premisas convencionales, y logra entregar relatos llenos de suspenso y decisiones dif�ciles. En About Elly, un grupo de amigos deciden alquilar una casa en la playa. Sepideh es la encargada del viaje, y decide invitar a Elly, la profesora de uno de sus hijos. Su intenci�n es emparejarla con Ahmad, uno de sus amigos quien se acaba de divorciar. La situaci�n es torna inc�moda ya que es evidente sus intenciones desde el principio. Elly es una mujer misteriosa, y no estamos claros de quien es, o que esconde. Durante el segundo d�a del viaje, Elly desaparece. Lo que sucede luego, afectar� no s�lo el viaje, sino la din�mica del grupo dr�sticamente.About Elly es una pel�cula que te mantiene al borde del asiento. Es inevitable ponerse en los zapatos de los personajes, ya que es f�cil sentirse identificados con ellos, y con las decisiones que toman. La trama no es para nada predecible, y constantemente nos sorprende con nuevos giros dentro de la historia. Asghar Farhadi tiene una facilidad incre�ble para lograr que el p�blico se sumerja en la historia. No es com�n ver personajes como este grupo de amigos en el cine. Normalmente j�venes musulmanes son vistos de manera negativa, y ac� son como personas normales y convencionales. Se divierten y se comportan como cualquiera. Siento que es importante presentar este tipo de personajes para dejar atr�s los estereotipos.Las actuaciones son incre�blemente realistas. Se siente como si fu�ramos testigos de las vidas de estas personajes y como si realmente existieran. Las actuaciones de todos son magistrales y aportan a el realismo de esta pel�cula. About Elly es una obra casi perfecta. El final no me dej� totalmente convencida, y la inclusi�n de su \"prometido\" fue un poco abrupto, pero tambi�n le a�ade esa cara de el machismo dentro de la sociedad musulmana.",
    "rating": "45",
    "date": "January 24, 2012"
  },
  {
    "reviewer": "Andrew O",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/909712698/",
    "review": "  Almost if not as compelling as his \"A Separation\", director Asghar Farhadi proves once again to be a maestro of drama both in direction and writing, and instill the idea that a world is always going on outside the frame of the camera.",
    "rating": "50",
    "date": "April 3, 2015"
  },
  {
    "reviewer": "David F",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/786661982/",
    "review": "  This movie really draws you in with a mystery then yields all kinds of social and psychological insights about honesty, humanity, group dynamics, trustworthiness, and integrity. It's a also a funny film with some allegorical overtones reminiscent of the films of Luis Bunuel.",
    "rating": "40",
    "date": "July 7, 2015"
  },
  {
    "reviewer": "Brad G",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/970330019/",
    "review": "  Visually and emotionally riveting.",
    "rating": "50",
    "date": "July 5, 2015"
  },
  {
    "reviewer": "Mark H",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/851835142/",
    "review": "  4 out of 5 stars. Excellent mystery by the writer/director of the Iranian masterpiece, \"A Separation.\" Several of the same actors are in this film & writer/director Asghar Farhadi is now a world class filmmaker in the French New Wave tradition of Chabrol, Rivette & Truffaut. His nuanced attention to human behavior builds into true works of art which surprise you because the layers of everyday action and routine become very important later in the dramatic structure. His films almost feel like documentaries at first because there is no driving plot, just observation of groups of upper middle class intellectual Iranian people, going about their lives. That in itself is interesting compared with all the anti-Iran propaganda here because he shows how universally relatable his characters are to all humans striving for better lives, education for their children and care for their families.But you have to pay attention because the smallest details in the beginning become crucial to characters' outcomes later. A small conversation or a glance between two people seems insignificant at first and then suddenly becomes very important in the final resolution. Always well acted with specifically composed shots, his work is all about careful writing, directing & performance. His craftsmanship is first rate and all the details are important. There are no wasted moments in his films, which are never high budget. Farhadi already has dozens of international awards, an Oscar and Cannes recognition, so he is well established after only 6 feature films. Definitely worth seeking out his films because they stay with you for years. That unique window into Iranian life is a valuable artistic perspective and his ensemble of actors do such a great job on screen for him. You will replay moments in your head the way Bergman films never leave you once experienced. A filmmaker of the highest order, the cinema world eagerly awaits more great films to come from him and his team.",
    "rating": "40",
    "date": "July 4, 2015"
  },
  {
    "reviewer": "Aaron N",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/185584554/",
    "review": "  Sepideh: Now, what does he think about Elly?It is interesting to go back in time with a director I have only recently found myself so intrigued by in recent years. Academy Award winner Asghar Farhadi had made four other films prior to A Separation and The Past. About Elly is one that somehow got lost in the shuffle as far as getting an American release. Regardless, the film has now arrived and continues to shed light on what a talent Farhadi is in capturing human drama.The film is something of a mystery set among a group of old friends on a holiday retreat. With the return of a close friend, a group of former college pals decide to reunite for a weekend outing by the Caspian Sea. While things begin in good spirits, complete with an attempt to hook up two individuals, trivial lies start accumulating and things really escalate when a sudden disappearance occurs. This sets in motion a series of deceptions and revelations that threaten to shatter everything.As I mentioned, this film really continues to prove how adept Farhadi is at developing human drama. That it is not quite as good as A Separation or The Past only suggests that Farhadi has improved only time as a filmmaker, given how good About Elly still is. This is a film that is stripped down of nearly everything, aside from some narrative ambition when it comes to utilizing the location for high tension. What is left are a collection of characters and a screenplay that allows for very natural conversations, arguments, and other relatable interactions.",
    "rating": "40",
    "date": "June 19, 2015"
  },
  {
    "reviewer": "Michael L.",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/938845779/",
    "review": "  This dreary, tedious collection of cinematic clich�s veers from farce to hysteria without for a second ringing true. Edward Albee and Ingmar Bergman did an infinitely better job of progressively revealing the flaws in the character of their protagonists and their marriages. Jerky hand-held photography scarcely merits the acclaim it has received. The open-ended denouement is another tired cinematic device used to better effect in dozens of films. To be sure a fil-maker working against the odds under a harsh political regime deserves top marks for courage but he deserves better than the complete abandonement of critical scrutiny by admiring reviewers.",
    "rating": "10",
    "date": "June 8, 2015"
  },
  {
    "reviewer": "El Z.",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/933113837/",
    "review": "  Yes, I liked it, and I want to support this filmmaker. I went to see it because of The Separation, because of how fantastic that film was. This one is not as good, but still interesting. Lots of dialogue to read. I did not feel the storyline was set up well... i felt confused at times, and this is unusual for me. I kept feeling like there was something I missed.All this said, it was interesting, and I recommend it.",
    "rating": "50",
    "date": "June 7, 2015"
  },
  {
    "reviewer": "Tanuki",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/970352005/",
    "review": "  A gripping, culturally allegorical story told with compelling performances and some of the darkest humor on film.",
    "rating": "40",
    "date": "June 1, 2015"
  },
  {
    "reviewer": "Mihir M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/882382696/",
    "review": "  \"a bitter end is much better than a bitterness without ending\"",
    "rating": "30",
    "date": "May 22, 2015"
  },
  {
    "reviewer": "Nirosh J",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/914744989/",
    "review": "  A gripping story which leaves you with full of emotion. Asghar Farhadi's unique way of filmmaking and vivid acting from the casts left me speechless again. A must watch masterpiece.",
    "rating": "45",
    "date": "May 8, 2015"
  },
  {
    "reviewer": "Lindsay M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/911321294/",
    "review": "  He\"s brilliant. Loved every film and can't wait for more.",
    "rating": "45",
    "date": "May 16, 2015"
  },
  {
    "reviewer": "Ryan B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/889395996/",
    "review": "  Farhadi is a genuine cinematic genius and this is his third film is a row that could arguably be defined a masterpiece. Not since A Separation has a film left me so anxious and emotionally strung out. This is by far the best film I've seen this year.",
    "rating": "50",
    "date": "May 15, 2015"
  },
  {
    "reviewer": "Harlequin68",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/900682338/",
    "review": "  In \"About Elly,\" a group of friends travel to the seaside during a holiday weekend. They are all married couples and their children with the exceptions of Ahmad(Shahab Hosseini) who has just returned to Iran from Germany and a divorce and Elly(Taraneh Alidoosti) who is one of the children's teachers. So, there is hope that they will become better acquainted. But sadly there is no hope for them to stay at the house they had wanted to since it had been reserved by a wedding party, so they will have to rough it out in an unfurbished house closer to the sea.\"About Elly\" teases out a tantalizing mystery. But after that, director Asghar Farhadi does something rather interesting by almost tying the movie into a knot exploring a single procedural point. But considering he has shown a great deal of interest in the Iranian legal system in his other films, I think he is trying to make a point here however subtly through exaggeration about how such minutiae can weigh down everyday life in Iran.",
    "rating": "35",
    "date": "April 27, 2015"
  },
  {
    "reviewer": "Peter F",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/782851126/",
    "review": "  As provocative and intense as we've come to expect from Asghar Farhadi, even if it's less polished around the edges.",
    "rating": "40",
    "date": "April 9, 2015"
  },
  {
    "reviewer": "Rene N",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/907521228/",
    "review": "  I can't wait to see this. A Separation is one of my favourite films of all time!",
    "rating": "wts",
    "date": "April 4, 2015"
  },
  {
    "reviewer": "A Lover of Good Films",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/968497042/",
    "review": "  An incredibly well-acted, very gripping, powerful and tragic drama.",
    "rating": "50",
    "date": "March 7, 2015"
  },
  {
    "reviewer": "Ezzeddine J",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/789019545/",
    "review": "  A bitter ending is better than an endless bitterness",
    "rating": "35",
    "date": "August 27, 2014"
  }
,
  {
    "reviewer": "Andres G",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/906312635/",
    "review": "  Great drama in which a ball of lies hit back to the main characters once and again.The suspense is greatly kept while we attend to the limitations and roles imposed by culture and social conventions. In several ways, a movie setting the path for the next one: \"A Separation\".",
    "rating": "45",
    "date": "October 15, 2014"
  },
  {
    "reviewer": "Art S",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/792064900/",
    "review": "  The Iranian cinema (that we get to see in the West) has been so astonishing for so long that it feels incredible to find a new Master in Asghar Farhadi (Oscar winner for A Separation). Kiarostami, Makhmalbaf, and Panahi (among others) have managed to incorporate another level to many of their films that asks the viewer to question what she or he is seeing (reality or artifice? truth or fiction?) and that same vein is mined to great effect in About Elly. Farhadi shows us a group of married friends (with children) from Tehran who decide to visit the Caspian seaside for the weekend. One of them, Sepideh (played warmly by Golshifteh Farahani), surprises them by bringing along her daughter's single teacher, Elly, to meet their recently divorced friend Ahmad visiting from Germany. The lies begin when the holiday villa they were supposed to have booked turns out to be unavailable - and they continue as members of the group routinely keep things from each other (a natural state of affairs) or join in the charade. A \"L'Avventura\" styled plot twist opens up even more questions and mysteries descend on the group. Farhadi does an excellent job of maintaining a high level of tension (almost too high!) and orchestrating a large number of actors, all in the dark, as the film tilts this way and that in search of a resolution.",
    "rating": "45",
    "date": "August 9, 2014"
  },
  {
    "reviewer": "Hamza B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/908194843/",
    "review": "  Michael Bay should see this..",
    "rating": "40",
    "date": "August 5, 2014"
  },
  {
    "reviewer": "Sandeep B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/850479912/",
    "review": "  simple yet wonderfully woven storytelling.Makes the audience participate in filling the gaps at the level of decision making. Worth a watch.",
    "rating": "35",
    "date": "July 18, 2014"
  },
  {
    "reviewer": "ElCochran90",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/535433355/",
    "review": "  Wow. This is a great film.Farhadi kept evolving with every new film he made. He still uses a divorce in the film, but that divorce is transformed into a subtext this time in order to apply his own Antonioni-esque plot in a very similar physical setting: the sea, which vastness hides a bloodcurling amount of incomprehensible secrets.And then again, if we compare both films, we'll realize we are with entirely different universes, and perhaps aren't comparable at all. Truth to be told however, Antonioni's film was a character study of alienation, the disappearance of the character creates a new unspoken attraction between two new leads and becomes a metaphor of the disappearance of the life priorities of oneself's existence, and the affair happens after the disappearance.About Elly is both thematically and psychologically backwards. That is, the \"love\" affair was planned to happen before the disappearance, and was orchestrated by a group of friends, mainly by a female third party. Moreover, the disappearance turns the lives of everybody upside down, and this psychological analysis fleshes out the characters. Finally, the intention is not to alienate, but to make the tension as realistic as possible.\"Tension\" is a word I use a lot while writing about Farhadi, because the art of his moviemaking consists exactly in the slow escalation of tension. Whereas he will do this two years later in a way few times attempted before by any moviemaker in A Separation with one of the best opening sequences of the decade, here he achieves this by introducing the whole cast in such a natural way that you feel as a part of the group. You literally play, joke, drink and chat with them. Enough time is spent to set a mood and then drastically change it in the second act.What is very interesting about this mood evolvement is that the plot description already sells the main event: Elly will evaporate from the earth's surface. So the more you get along with the characters' anecdotes, the scarier the idea of somebody disappearing or having an accident becomes. This is proved by the first incident portrayed in the film, which just happens to be unrelated with Elly, but with Arash. The whole situation is so tense, that you start to wonder whether if you'll be able to handle, yes, the tension of the next incident.Farhadi's most important thematic trademarks are present here as well: the power of a lie or lack of communication can bring destruction to everybody involved, little children have to cope with adult problems that they do not understand (suffering in the process), and one single event, suspicion or differing perspectives towards a single problem are the elements used to create verbal, physical and emotional confrontations between the characters that peel their intentions, personalities, fears and impulses as easily as you peel an onion.Bravo to that.84/100",
    "rating": "40",
    "date": "June 26, 2014"
  },
  {
    "reviewer": "Rendy S",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/861812257/",
    "review": "  Iranian cinema always fascinates me, generally story-oriented, psychologically heavy, full of deep meaning if you want to dig deeper and could be considered parable. About Elly is no different, the act is superb, the spike of energy during the main plot, moral debates; this movie reminds me of 'The Separation' which is as psychologically exhausting as this.",
    "rating": "40",
    "date": "May 24, 2014"
  },
  {
    "reviewer": "Nazzmatazz P",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/741853737/",
    "review": "  Engaging and thought-provoking",
    "rating": "40",
    "date": "September 2, 2009"
  },
  {
    "reviewer": "Samir S",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/839889626/",
    "review": "  About Elly follows a group of friends to a idyllic weekend getaway and the events that unfold thereafter. Beneath the entire dilemma about Elly's honour, her fianc�'s rage and heartbreak, the group's sense of morality lies the unasked question that involves Elly's individuality which she will never be able to ask, \"What does Elly want for herself?\" About Elly is a thorough observation of human behaviour in times of personal crisis.",
    "rating": "45",
    "date": "April 24, 2014"
  },
  {
    "reviewer": "Tanvir M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/916820917/",
    "review": "  My first foray into Farhadi territory, and I am mightily impressed by this masterful examination of group dynamics under pressure and the moral debates and spiraling deceptions springing from it. Film making of highest order.",
    "rating": "40",
    "date": "April 11, 2014"
  },
  {
    "reviewer": "Ana B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/859040565/",
    "review": "  A group of friends go to spend a few days in the seaside and they take along Elly, the teacher of one of their children. Things ran smoothly until Elly expresses her wish to leave, Sepideh, the woman that invited her firmly opposes, shortly afterwards one of the children is found floating almost dead in the sea and Elly is missing. Uncertain of what has happened to her- drawn trying to save the child or walked to the bus stop- the group debates what they should do next. Their fears and their little secrets come out and fuels confrontation and meanness amongst them.Half way between a crime movie and a drama this Iranian production is a sharp portrayal of characters forced to face a possible tragedy and finding very difficult to take the steps in the right direction, rather than working as a team they accuse each other of bringing Elly along first and then losing track of her. Torn by guilt the group has no choice but to contact the young woman's relatives.The movie is very good at displaying a dramatic event in a very believable light. The characters are real and likely, the situations and reactions are not forced and it just shows us how close we all can be to such traumatic circumstances. The script and direction are very neat and the actors are so natural that you might forget that you are actually watching a movie. Instead it feels like you just walked inside the neighbour's house and you are witnessing this drama unfold. A remarkable piece of Iranian cinema, it won several accolades including the Silver Bear in the Berlin Film Festival of 2009.",
    "rating": "40",
    "date": "March 4, 2014"
  },
  {
    "reviewer": "Jyoti Prakash M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/923179908/",
    "review": "  Relationships forged with so much care,come undone in the face of uncertainty and peril.",
    "rating": "30",
    "date": "December 15, 2013"
  },
  {
    "reviewer": "Ali B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/858353479/",
    "review": "  Masterpiece, wonderful screenplay, great acting and a masterful director , Farhadi is everything ?????",
    "rating": "50",
    "date": "November 16, 2013"
  },
  {
    "reviewer": "Paul D",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/788393724/",
    "review": "  This is a story manufactured out of very little but nevertheless it is a fraught situation and almost as fraught a watch. The collection of holidaying characters are just about interesting enough.",
    "rating": "30",
    "date": "November 13, 2013"
  },
  {
    "reviewer": "Sandeep N",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/813572273/",
    "review": "  Masterpiece! Asghar Farhadi can tell ordinary stories in extraordinary ways! This is film making of a higher order. Period",
    "rating": "45",
    "date": "November 5, 2013"
  },
  {
    "reviewer": "phil b.",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/901389734/",
    "review": "  Where is the 'Write a Review' button? I cannot post any reviews without it. Phil.",
    "rating": "35",
    "date": "March 10, 2013"
  },
  {
    "reviewer": "Kimberly C",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/917404424/",
    "review": "  Farhadi plays a lot with that who said what, luxury only a director as fine as him can afford to. He is a top class director and this is a top class movie.",
    "rating": "50",
    "date": "August 11, 2013"
  },
  {
    "reviewer": "Lilian W",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/788339761/",
    "review": "  It's not the cinematography, it's not the performances, it's how Assghar Farhadi made me feel for every single one of them, even Ali Asghar.",
    "rating": "45",
    "date": "June 23, 2013"
  },
  {
    "reviewer": "Mohamed G",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/877538387/",
    "review": "  miserable dramatic story !",
    "rating": "45",
    "date": "May 29, 2013"
  },
  {
    "reviewer": "Ro D",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/795467013/",
    "review": "  Really mr Farhadi can't be more great, i bow to him",
    "rating": "50",
    "date": "May 26, 2013"
  },
  {
    "reviewer": "cajtgreen",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/951217503/",
    "review": "  An extraordinary treat, a must see!",
    "rating": "50",
    "date": "May 16, 2013"
  }
,
  {
    "reviewer": "Ingela A",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/824016737/",
    "review": "  A film made by Farhadi who was awarded an Oscar for best foreign film \"A Separation\" 2011.  Farhadi proves adept at controlling the tone of his film. By slowly setting up the situation and the complex nexus of relationships between the characters, he lulls the audience into thinking the film will continue in a comic mode until Elly's disappearance. From then on, the film takes a serious tone. Lies come back to haunt the characters, and the consequences of these are unforgiving. Some of these lies were told due to particular proprieties necessary within Iranian society. The brilliance of Farhadi's script and direction becomes most apparent in the latter stages of the film. As one secret after another is revealed, Farhadi deftly maps out the shifts in the perceptions and behaviour of the characters toward each other as well as the viewer's perception of the characters. Farhadi's cast is uniformly excellent, especially Farahani, who compellingly registers Sepideh's shock at how her seemingly innocent matchmaking has taken such a tragic turn, as well as the way her character, like others in the film, is revealed to not be what it initially appears.",
    "rating": "40",
    "date": "May 10, 2013"
  },
  {
    "reviewer": "David M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/798925545/",
    "review": "  WOW just wow. An Iranian \"L'Avventura\". Sepideh: Magnificent! Farhadi is quickly establishing himself as one of my favourite directors.",
    "rating": "45",
    "date": "April 15, 2013"
  },
  {
    "reviewer": "Aephraim S",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/801224735/",
    "review": "  Not as good as \"A Separation,\" but a well-made and thought-provoking enough film. Maybe even better than I think, but hard to tell, because to the best of our ability to deduce, the subtitles we got were arrived at by taking a version previously subtitled in French, and (mis-)typing the French into google translate. So we're really not at all sure what we missed. And we liked it anyway...",
    "rating": "35",
    "date": "April 8, 2013"
  },
  {
    "reviewer": "Tom D",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/800544587/",
    "review": "  The story of a closeknit group of friends (+ Elly) on a weekend getaway is riveting, with a brilliant ensemble cast, let down only because the script could have been a little tighter.",
    "rating": "35",
    "date": "April 7, 2013"
  },
  {
    "reviewer": "GrahamKenyon2",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/934420669/",
    "review": "  Absolutely wonderful. Modern Iranians in a spiralling series of events that keep you spellbound. The acting is so good, you feel as if you're intruding. Highly recommended.",
    "rating": "45",
    "date": "September 23, 2012"
  },
  {
    "reviewer": "Tom S",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/783364467/",
    "review": "  The first twenty minutes or so could be pared down, but after that central event, the intensity never withers.",
    "rating": "45",
    "date": "March 5, 2013"
  },
  {
    "reviewer": "Martin B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/913937420/",
    "review": "  Different, a very 'busy' film...",
    "rating": "30",
    "date": "January 2, 2013"
  },
  {
    "reviewer": "Sumit S",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/902210506/",
    "review": "  Extremely gripping, morally challenging, simplest approach & with its sensational script, Asghar Farhadi has crafted yet another masterpiece of a cinema that is a classic piece of suspense, drama, mystery, & realism. Crafted with great control, performed with superb naturalness, & exploring the manipulative nature of humans, About Elly succeeds not only as a brilliant work of filmmaking but also as an honest portrayal of tragic events that can happen to anyone in real life. The first 45 minutes are relatively slow but after that, the movie runs at a frenetic pace, confusing & challenging the morals of its characters as well as viewers throughout its runtime. An ordinary story told in an extraordinary manner, About Elly is nothing less than a masterpiece. One of world cinema's finest films.",
    "rating": "50",
    "date": "December 16, 2012"
  },
  {
    "reviewer": "Ahmed F",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/820438511/",
    "review": "  ? ? ? ? ? Ravishing :)",
    "rating": "50",
    "date": "December 14, 2012"
  },
  {
    "reviewer": "Kasia K",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/796454846/",
    "review": "  wow, didn't expect it to match the quality of separation, but it definitely does. i will be looking forward to seeing more from farhadi.",
    "rating": "45",
    "date": "September 12, 2012"
  },
  {
    "reviewer": "Mohamed F",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/790812548/",
    "review": "  Some stories are just too simple and pointless to be made into a feature film, and it appears that all of Farhadi's movies follow the same uber realistic trend of mundane stories that try way to hard to be pretentious.He excels at telling what should not be told, and just throwing a whole bunch of little events that establish a lot on their own, but are just utterly boring and pointless when used as part of a bigger picture, so you're bombarded with lots of \"reality\" scenes about moments that you tend to skip when they take place in your own life, let alone watch in a movie, all building up to a story that you wouldn't remember the second day if it was told to you by a friend.",
    "rating": "30",
    "date": "October 20, 2012"
  },
  {
    "reviewer": "Paolo R",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/800753124/",
    "review": "  Comedy drama of middle-class mores... but the Iranian setting and societal differences adds enough tension and distance for it to feel fresh to this viewer.",
    "rating": "35",
    "date": "October 8, 2012"
  },
  {
    "reviewer": "Eric G",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/793402867/",
    "review": "  From director Asghar Farhadi, winner of an Oscar this year, 'About Elly' is his previous film and is NOT TO BE MISSED. It's a gripping psychological drama that looks at contemporary Iranian society and at human behaviour with great perceptiveness. It show that it doesn't take an overblown budget to tell a great story. Extremely well written, it made me feel like an intricate part of the group of friends spending a week-end near the Caspian sea, and almost a participant of the unfolding story. Farhadi is a master at engaging the audience at a deep emotional level. I was impressed with his ability to show how the small actions or words we routinely say can have crucial implications and impact the people around us. The acting is superb all around, with a special mention to the beautiful Golshifteh Farahani playing Sepideh as the main character. Photography is beautiful, almost shot in documentary style. Note: don't read the story before watching it.",
    "rating": "45",
    "date": "October 4, 2012"
  },
  {
    "reviewer": "Dave C",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/799313248/",
    "review": "  great acting. brutaly bad film. I never cared about Elly. So i never cared about the high pitched screams and arguments that ensued afterwards. The constant sound of the sea in every scene also wore me down. Terrible movie.",
    "rating": "15",
    "date": "September 24, 2012"
  },
  {
    "reviewer": "Leonardo C",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/785988737/",
    "review": "  Asghar Farhadi tem um incr�vel dom�nio da linguagem cinematogr�fica. Trabalha solidamente com um vasto elenco, gera drama, antecipa tens�o soberbamente. Nem precisaria do leve spoiler do t�tulo em portugu�s para prevermos que algo de errado aconteceria.",
    "rating": "45",
    "date": "September 17, 2012"
  },
  {
    "reviewer": "Dimitris K",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/905920366/",
    "review": "  From the director of 'A Separation'.",
    "rating": "40",
    "date": "September 15, 2012"
  },
  {
    "reviewer": "Jacky L",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/790647867/",
    "review": "  the film started off as an 'upper'; the group's holiday mood was so infectious, you'd wish you were there with them. then it started moving into more sombre territory, causing one to wonder 'so, did elly?' only realized this was an earlier work by A Separation's director after the credits rolled. mr Asghar Farhadi, you've got a fan, please keep 'em coming.",
    "rating": "35",
    "date": "August 26, 2012"
  },
  {
    "reviewer": "Dipesh T",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/918845865/",
    "review": "  A very good film by Asghar Farhadi. It's one of the most captivating film I have seen in recent days. It arises many questions about human relations and Iran's society, their culture and stuff.",
    "rating": "40",
    "date": "August 12, 2012"
  },
  {
    "reviewer": "S S",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/784163664/",
    "review": "  enjoyable even if it's a bit over hyped",
    "rating": "35",
    "date": "August 9, 2012"
  },
  {
    "reviewer": "Dinesh S",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/907106480/",
    "review": "  another masterpiece from Farhadi who has quickly become one of my favorite story tellers. Such a pity that this movie finds no reviewers. If you love engaging dramas with a closer to reality theme, please start watching Farhadi's movies. About Elly kept me engaged from the start and I didnt move till the soul stirring music stopped with the credits",
    "rating": "50",
    "date": "July 20, 2012"
  }
,
  {
    "reviewer": "Ahmed R",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/794389179/",
    "review": "  A bitter ending is better than an endless bitterness.",
    "rating": "40",
    "date": "July 20, 2012"
  },
  {
    "reviewer": "kombat",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/920922946/",
    "review": "  Amazing drama which mainly focuses on a death of a girl and the people who could or should be responsible for it .",
    "rating": "40",
    "date": "July 17, 2012"
  },
  {
    "reviewer": "Niloo R",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/916682226/",
    "review": "  asghar farhadi is quickly becoming my favourite persian director - not only does he capture iranian life and people perfectly, but he tells universal human stories that surpass boundaries set by set by cultural differences and political strife. his characters in this film are multi-faceted and real, and he skillfully nuances the plot to keep the audience guessing until the very last second. absolutely superb!",
    "rating": "50",
    "date": "June 1, 2012"
  },
  {
    "reviewer": "familiar s",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/846056139/",
    "review": "  More engaging than disappointing, About Elly has some outrageous performances, while none outstanding. Worth a shot, nonetheless.",
    "rating": "25",
    "date": "June 6, 2012"
  },
  {
    "reviewer": "Alberto M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/850450168/",
    "review": "  This guy is a master filming people and relationships and he always plays cleverly with the plot.",
    "rating": "40",
    "date": "April 10, 2012"
  },
  {
    "reviewer": "Melissa L",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/815187872/",
    "review": "  N�o sei se foram os atores giros e espetaculares ou a realiza��o. O filme prende do come�o ao fim, um thriller do canequinho.",
    "rating": "45",
    "date": "January 27, 2012"
  },
  {
    "reviewer": "Masoud T",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/785822506/",
    "review": "  Incredible film. Asghar Farhadi has put out great films back-to-back over the past few years, and this proceeder to the Academy Award nominated A SEPARATION, proves he is nowhere near done putting out quality films in Iranian cinema.",
    "rating": "50",
    "date": "January 17, 2012"
  },
  {
    "reviewer": "Aysun B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/854761841/",
    "review": "  It was a dram actually has also characteristics of a thriller movie, Sepideh was the most impressive character I think.",
    "rating": "40",
    "date": "December 15, 2011"
  },
  {
    "reviewer": "Sanjid P",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/913560278/",
    "review": "  This is a very nicely crafted suspense-drama from Iran that interestingly play with its characters, somewhat in a 12 ANGRY MEN fashion where lies, suspicion & speculation slowly starts to digs off some dark moral issues of each others very human nature.",
    "rating": "35",
    "date": "November 8, 2011"
  },
  {
    "reviewer": "Dennis P",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/905917241/",
    "review": "  This is 1of my top 10 movies..it's very hard 2 believe these rotten \"rotten tomato\" guys didn't review it yet",
    "rating": "50",
    "date": "September 4, 2011"
  },
  {
    "reviewer": "Rakesh K",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/879486738/",
    "review": "  A brilliant portrayal of true human nature.",
    "rating": "45",
    "date": "March 6, 2011"
  },
  {
    "reviewer": "a m",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/898711418/",
    "review": "  I can watch it again and again:)",
    "rating": "50",
    "date": "March 4, 2011"
  },
  {
    "reviewer": "Bahman K",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/906554111/",
    "review": "  ???? ??????? ??????? ???? ?? ??????",
    "date": "January 21, 2011"
  },
  {
    "reviewer": "Melvin R",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/906182350/",
    "review": "  Comienza como un drama sutil y se transforma en una monstruosa historia de suspenso que te sacude de principio a fin. La direcci�n de Asghard Farhadi es efectiva, usando im�genes sencillas, sobrias y de pocos recursos para lograr lo que muchos thrillers millonarios no pueden. El peso descansa en los personajes, todos muy buen actuados y escritos, especialmente el de \"Sepideh\". Las clases sociales y el papel de la mujer nos muestran este retrato del Ir�n contempor�neo.",
    "rating": "35",
    "date": "January 21, 2011"
  },
  {
    "reviewer": "omidjafari",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/906276233/",
    "review": "  vaghean fogh olade ast in film be hame tousie mikonam bebininesh",
    "date": "December 24, 2010"
  },
  {
    "reviewer": "kyo 9",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/824317781/",
    "review": "  Another masterpiece from Iran..The performance from every body to make this film so beautifully expressed was utterly amazing and stunning.. The flow of the story on how a woman attracted to another man but the man did not know that she was engaged before to another guy was a surprised thrill!! The ending scene was very realistic!",
    "rating": "45",
    "date": "October 23, 2010"
  },
  {
    "reviewer": "AmirrezaTajvidi",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/905026484/",
    "review": "  most good manufacturing iranian movie in this decade...everything in this movie in international scale is perfect",
    "rating": "45",
    "date": "September 5, 2010"
  },
  {
    "reviewer": "Alessandro L",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/820085383/",
    "review": "  Boring like hell, although most of the actors are relatively honest.",
    "rating": "25",
    "date": "August 27, 2010"
  },
  {
    "reviewer": "baradore",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/820663486/",
    "review": "  if you want something simple and different which includes high tension without using any action scenes or stupid camera moves here is what you got and if you don`t use it, you are gonna regret... BIG TIME!it`s an iranian movie about lie and its consequences. but before that it is about people judging each other. in iranian culture it has another thing to present too. the drowning. it is something common in the location the movie has been made. it is in northern region of iran and they always hear stories of people losing their lives in the sea.anyway...... this is a cool movie recommended by me and i`m sure you`re gonna like it. it has a perfect bunch of actors/actresses and a cool director who`s being adored by lots of his kind. don`t miss this movie.",
    "rating": "50",
    "date": "August 19, 2010"
  }
,
  {
    "reviewer": "mvieaddict",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/830255989/",
    "review": "  I was always fascinated by Persian cinema. About Elly was my first movie of this Persian director Farhadi .The movie opened with a simple plot, and ends with much more simplicity.The cast was great, Farhadi did a great job in putting the viewer inside the locations to live with the story. A group of married couples, some with children, went to the North of Iran to have a 3 days vacation.The director showed here clearly the consequences of lies and deceptions. How lies even for inconvenience can lead to unexpected events. Farhadi got the best performances from his actors,specially Golshifteh Farahani who played the role of Sepideh so convincingly.",
    "rating": "40",
    "date": "July 5, 2009"
  },
  {
    "reviewer": "Pasha A",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/817815978/",
    "review": "  :I How Can a director remake a life as a film? How much he should be smart to put this huge amount of details in his film? This is one of those limited films which could change me! I love \"About Elli\" as much as \"Shab e Yalda\".",
    "rating": "40",
    "date": "July 5, 2009"
  },
  {
    "reviewer": "Ghazal S",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/799260505/",
    "review": "  I've watched About Elly three times already and still I cannot get it out my head! Definitely one of the best movies I have watched this year.",
    "rating": "50",
    "date": "October 9, 2009"
  },
  {
    "reviewer": "Minna S",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/421348868/",
    "review": "  It's always such fun to watch people become hysterical. This one was more interesting as a representation of certain culture than as a storyline. And the ending does not mean anything anymore.",
    "rating": "25",
    "date": "September 21, 2009"
  },
  {
    "reviewer": "Ferreddo",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/782047879/",
    "review": "  really great movie 3.5 bec forsometechnical",
    "rating": "40",
    "date": "August 10, 2009"
  }
,]