[

  {
    "reviewer": "Harlequin68",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/900682338/",
    "review": "  Kumiko(Rinko Kikuchi) works in an office in Tokyo where she avoids her fatuous colleagues. Her patronizing boss(Nobuyuki Katsube) has her take care of his dry cleaning and other demeaning tasks. In response, she spits in his coffee. In her spare time, she takes care of her pet rabbit and defends herself by phone to her interfering mother. That leaves plenty of time to watch the movie 'Fargo' over and over. Not for any aesthetic reason mind you but to look for clues for buried treasure.\"Kumiko, The Treasure Hunter\" is an offbeat and engaging character study, about somebody who is not so much searching for something but running away from multiple somethings. And can you really blame her? While Kumiko's actions might be hard to sympathize with at times, remember how malleable reality can be at others, especially with this movie being inspired by a true story. 'Fargo' itself is a complete fiction that claims to be a true story before it starts. And 'Shogun' which is also referenced is historical fiction.",
    "rating": "35",
    "date": "April 20, 2015"
  },
  {
    "reviewer": "John B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/782114803/",
    "review": "  A disturbing look at a disturbed woman tries to find the treasure featured in the film Fargo. While there are interesting elements, the tidy ending is a jarring departure from the rest of the film.",
    "rating": "30",
    "date": "April 2, 2015"
  },
  {
    "reviewer": "Jack G",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/784576437/",
    "review": "  It would be one thing if the filmmakers, David Zellner (director) and brother/co-writer Nathan Zellner, were coming up with the idea for Kumiko, the Treasure Hunter out of whole cloth. It's certainly one of the best 'hooks' (or as the industry calls then 'loglines') in many years: a young woman from Tokyo is obsessed with the scene from Fargo where Steve Buscemi hides the suitcase full of money by the fence, buried in the snow, and never comes back for it. Naturally, as she assumes from the opening title card telling the audience 'This is Based on a True Story' that the suitcase is still there, and goes to Fargo to find it. The thing that makes things even wilder to find out (though this is after the film ends) that while the Coen brothers' Fargo is not based on a true case (it was their sort of satire of movies that do the 'true story' for artistic license), Kumiko, strangely enough, is.According to IMDb, a woman naked Takako Konishi actually watched the movie Fargo and went out to try and find it. At least, that's the extent to which the movie and real life connect. Perhaps the Zellners took license from there; certainly it would seem to make sense, but they take this true event (from a not-true event from the film) and use it as a way of jumping off into a character study of this rather lonely woman. Or, one should say, she's perhaps alone but not exactly lonely - except for one aspect involving her rabbit, which should be addressed - as she has this movie to give her hope outside of her dreary job and inquisitive mother.She is not interested in meeting a man or getting married or having kids. In the one of the few moments we get some character development, we see that she considers herself a \"Spanish Conquistador\" going to \"The New World\" (this actually pops up as the title card when she arrives in Minnesota). So she makes a decision one day, not exactly on a whim but after what seems to be much thought (and going through the possible tragedy of a torn VHS tape - how she finds the tape is never explained, same with the ending, but more on that in a moment), and leaves her rabbit on a subway car. This last part - the bunny is Bunzo, can't forget that - seems oddly sad, just by nature of this character having a pet its cared for and now the pet's no longer there. Plus, it's a cute bunny after all.There's a bit of culture clash - apparently there's no one who's Japanese up in Minnesota/North Dakota, Kumiko knows very little English, and the one helpful Deputy in town (played by director Zellner) thinks a worker at a Chinese restaurant can help translate. There's a few moments of sort of awkward comedy here, which if I had to be honest were the parts that worked for me the least. Maybe this is where the Alexander Payne connection comes in (he's executive producer here), and there's one character in particular that seems air-lifted out of a Payne film into Kumiko's journey. But it's ultimately about what Kumiko is going and how she is going to get there. It's predictable stuff to see these sort of folks in this environment, even as it is refreshing to see a police officer depicted as just a straight-shooting, caring person like the Deputy here.This concept could have been delivered in a few ways. This could have gone even more into meta terrain based on the 'real' 'fake' real' 'fake' sort of play at work, or even been more exuberant or crazy; certainly, when one hears about this idea for a story, it has to come down to execution. I think those who hear about it like that may be thrown off or even disappointed by what Kumiko the Treasure Hunter is. It's much more of a film about its own sense of magic realism, that this indicator of treasure is discovered one day in a cave off of a beach (why is she there, what for, who knows it's there), and then when the ending comes, which, spoiler, she DOES find the suitcase in the snow (with Bunzo present), it feels like it's gone off from reality.Is this in her head? I think its ambiguity is not unearned but part of a kind of dreamy logic that is really all about a dreamer. It's most telling that Werner Herzog has a glowing recommendation on the front of the blu-ray; many of his films deal with people trying to find something great that is beyond them, yet the vehicle of cinematic expression itself makes things more realer than reality, that it carries on an extra dimension for an audience member (i.e. Aguirre as an actual Conquistador, or Fitzcarraldo with the ship, or Stroszek, also set in the North Mid-West, which I thought of a few times). It's a downright Herzogian trip, and the lead Rikku Kiuchi (you may recall from Babel and Pacific Rim) is outstanding in scenes where she has to also play it (and even wear that red hood, a fairy tale character with a blanket-shield) as ambiguously as the writers have it: is she crazy? Is she a little 'off'? Who's to say?I don't think the filmmakers ever judge her for a moment, and that's why this story works - on the contrary, if anything she is practically lifted to mythic status, and it will deliver different things depending on the audience watching. Do you want a sad ending or happy ending? Should a dreamer like Kumiko get what she's after? Like the film that Kumiko is obsessing over, it's never quite so clear.",
    "rating": "40",
    "date": "December 8, 2015"
  },
  {
    "reviewer": "kenscheck",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/890863156/",
    "review": "  Interesting and weird, this film is based on the Urban Legend that a young Japanese girl went to the Midwest of America and died searching for the money Buscemi buried at the end of the Coen Bros. film \"Fargo.\" Of course, the reality is that the real girl's death had nothing to do with the movie, she actually had committed suicide. But much like the movie that served as inspiration for our main charactr and obviously to the filmmakers...the idea of the \"True Story\" is not as essential as the quality of a unique story they wished to tell. Now, this isn't \"Fargo,\" but it is a pretty cool unique film that doesn't look or feel like most films I've seen out lately. Even if it isn't the best film at least it has that going for it.",
    "rating": "35",
    "date": "November 20, 2015"
  },
  {
    "reviewer": "Anatoly S",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/784238567/",
    "review": "  While it wasn't bad, it wasn't particularly interesting either. I don't think I can recommend this one.",
    "rating": "30",
    "date": "July 25, 2015"
  },
  {
    "reviewer": "Chuah A",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/786393514/",
    "review": "  A tale of urban social disconnect and the difficulties of nonconformism coupled with dreams of something far more valuable than just being. Kumiko reminds viewers of those who live differently and yearn for a buried treasure in a faraway land. The bunny and calls to mom are emotionally poignant, and it was heartwarming to watch the kindness of strangers in an otherwise cold bleak landscape.",
    "rating": "30",
    "date": "May 13, 2015"
  },
  {
    "reviewer": "Nick D",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/845689761/",
    "review": "  Quirky and weird, this movie tells the tale of Kumiko, a depressed office clerk with an obsession to find the fortune hidden in the snows of North Dakota, which she believes because of a pivotal scene in the movie \"Fargo.\" Yes, she steals a credit card and flies to Minneapolis on this pointless quest, of which she is rigidly convinced, much to chagrin of a parade of mildly amusing local types who manage to make Fargo's original goofballs even more benign. It's a cute trope, but I lost interest after too long watching this waif shuffle in a blanket through the snows of the frigid north. Her mental illness was beginning to rub the magic right out of the thing.",
    "rating": "25",
    "date": "February 6, 2015"
  },
  {
    "reviewer": "Art S",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/792064900/",
    "review": "  Apparently based on a true story (although one would be hard-pressed to believe that anyone could be so stupid unless a serious break with reality is involved), this film follows Kumiko who believes that she can find the money that Steve Buscemi hides in the snow in the movie Fargo. Thus, she travels to Minnesota from Tokyo (after stealing her boss's company credit card) and wanders from Minneapolis up into the snowy hinterland. Rinko Kikuchi's performance is damn near somnambulant, presumably on purpose, for the movie eventually takes on the tone of a dream. Indeed, the soundtrack becomes increasingly mystical and Kumiko seems almost shamanistic as she drags a dirty hotel blanket around the highways and byways of rural MN. The film itself occasionally feels like Fargo, revealing those from the upper Midwest to be denizens of their own planet, even as Japan is treated rather normally; no doubt we are taking Kumiko's point of view - this is her dream after all. Yet, as enticing as this all sounds (and who wouldn't go for that absurd Fargo plot device?), the film itself is somewhat too slow, even though it remains safely unpretentious. Still, if you are in the mood to let this wash over you, it has its pleasures.",
    "rating": "30",
    "date": "January 25, 2016"
  },
  {
    "reviewer": "Logan D. M.",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/970115043/",
    "review": "  Not to sound insensitive, but deliberately leaving your pet rabbit on a train and stealing the company credit card to look for a briefcase from the 1996 fictional work \"Fargo\" is not the behavior of an underdog character movie audiences sympathize for. They are the actions of the mental unstable, which is the reason \"Kumiko, the Treasure Hunter\" left me with such mixed feelings.",
    "rating": "30",
    "date": "January 8, 2016"
  },
  {
    "reviewer": "Scott W",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/841539183/",
    "review": "  Twists the facts way too much to create an interesting story for a movie. This is a slow and frustrating watch with an ending that is way too neat. The movie does tackle some interesting themes and that's what gets it two stars.",
    "rating": "20",
    "date": "January 4, 2016"
  },
  {
    "reviewer": "Lazhward K.",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/972335359/",
    "review": "  An intriguing story of a woman's escape from everything with everyone against her. Perhaps relatively light-hearted on the surface but ultimately rather grim down below. Beautifully shot, but ultimately repetitive story-wise, which unfortunately makes it just fall short of amazing.",
    "rating": "40",
    "date": "December 1, 2015"
  },
  {
    "reviewer": "David H",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/972443020/",
    "review": "  Easily the most abysmal film I have seen in my 64 years. Totally fanciful and full of emptiness, no direction at to least a plot, the film rambles on to a naive and predictable ending. The film really is the pits of all pits.",
    "rating": "ni",
    "date": "December 1, 2015"
  },
  {
    "reviewer": "Jason B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/971301465/",
    "review": "  When I looked at the final score for Kumiko I was a little shocked. I typically punch in the numbers as soon as possible after watching the film but when I look back I cannot question my attributions. Kumiko is an interesting film about a woman who clearly has some sense of mental illness, probably depression, and becomes entranced with the idea of seeking out and finding the buried treasure from the Coen Bros. film Fargo.The lowest scoring attribute, in my opinion, is the editing. There are times that the film lags on and I feel it could be re-organized to work a little better. It is a good movie, and I expect to watch it again down the line, but I don't really think it is for everyone.",
    "rating": "30",
    "date": "November 16, 2015"
  },
  {
    "reviewer": "Justin E",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/918676106/",
    "review": "  A dark film that is often difficult to watch. ...I don't like the feeling it leaves me with",
    "rating": "50",
    "date": "November 14, 2015"
  },
  {
    "reviewer": "Greg N",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/907111989/",
    "review": "  The strange parallels and references to Fargo's story made this interesting, but didn't really make it a good movie.",
    "rating": "30",
    "date": "November 9, 2015"
  },
  {
    "reviewer": "Tor M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/782432537/",
    "review": "  A Japanese lady - she looks 16 but she's really in her late 20's, got a solid plan. She is going to find the treasure that the \"Fargo\"-character that Steve Buscemi played buried in snow in the mentioned film. She hates her job and her family, she has no friends. She cares for a little rabbit, but that's about it. She seem like a lonely girl that struggles with her mental state among other things. Her plan is the only thing that matters.This is a great plot. Original and very refreshing! It's based on true events too, that's pretty interesting, even if there never was a treasure hunt going on in the real life story. It looks nice and it got some superb moments. It forces me to hang on to it as we are in for a ride. \"The Octopus Project\" lifts the film with their nice, experimental instrumentals that are layed over the shots.Entertaining film, driven by the very interesting lead. Great acted, lovely shot - spiced with humour and weirdness. It's close to be totally solid and superb, but the true emotions stays out and I feel left out from some mysteries that I really want to know more about.8 out of 10 \"95\" pages.",
    "rating": "40",
    "date": "October 30, 2015"
  },
  {
    "reviewer": "Jason K",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/785171104/",
    "review": "  Beautiful cinematography and prob one of the most original films i've seen in abit, and this certain premise- maybe never.",
    "rating": "40",
    "date": "December 27, 2014"
  }
,
  {
    "reviewer": "Art S",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/792064900/",
    "review": "  Apparently based on a true story (although one would be hard-pressed to believe that anyone could be so stupid unless a serious break with reality is involved), this film follows Kumiko who believes that she can find the money that Steve Buscemi hides in the snow in the movie Fargo. Thus, she travels to Minnesota from Tokyo (after stealing her boss's company credit card) and wanders from Minneapolis up into the snowy hinterland. Rinko Kikuchi's performance is damn near somnambulant, presumably on purpose, for the movie eventually takes on the tone of a dream. Indeed, the soundtrack becomes increasingly mystical and Kumiko seems almost shamanistic as she drags a dirty hotel blanket around the highways and byways of rural MN. The film itself occasionally feels like Fargo, revealing those from the upper Midwest to be denizens of their own planet, even as Japan is treated rather normally; no doubt we are taking Kumiko's point of view - this is her dream after all. Yet, as enticing as this all sounds (and who wouldn't go for that absurd Fargo plot device?), the film itself is somewhat too slow, even though it remains safely unpretentious. Still, if you are in the mood to let this wash over you, it has its pleasures.",
    "rating": "30",
    "date": "January 25, 2016"
  },
  {
    "reviewer": "Richie A",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/883308607/",
    "review": "  Fargo melds with Japan . . . most awesome",
    "rating": "40",
    "date": "January 11, 2016"
  },
  {
    "reviewer": "Logan D. M.",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/970115043/",
    "review": "  Not to sound insensitive, but deliberately leaving your pet rabbit on a train and stealing the company credit card to look for a briefcase from the 1996 fictional work \"Fargo\" is not the behavior of an underdog character movie audiences sympathize for. They are the actions of the mental unstable, which is the reason \"Kumiko, the Treasure Hunter\" left me with such mixed feelings.",
    "rating": "30",
    "date": "January 8, 2016"
  },
  {
    "reviewer": "Scott W",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/841539183/",
    "review": "  Twists the facts way too much to create an interesting story for a movie. This is a slow and frustrating watch with an ending that is way too neat. The movie does tackle some interesting themes and that's what gets it two stars.",
    "rating": "20",
    "date": "January 4, 2016"
  },
  {
    "reviewer": "Laura M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/802063002/",
    "review": "  An interesting movie that moved a little slower than it could have. I liked it. Kikuchi is such a great actress.",
    "rating": "30",
    "date": "December 21, 2015"
  },
  {
    "reviewer": "Jack G",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/784576437/",
    "review": "  It would be one thing if the filmmakers, David Zellner (director) and brother/co-writer Nathan Zellner, were coming up with the idea for Kumiko, the Treasure Hunter out of whole cloth. It's certainly one of the best 'hooks' (or as the industry calls then 'loglines') in many years: a young woman from Tokyo is obsessed with the scene from Fargo where Steve Buscemi hides the suitcase full of money by the fence, buried in the snow, and never comes back for it. Naturally, as she assumes from the opening title card telling the audience 'This is Based on a True Story' that the suitcase is still there, and goes to Fargo to find it. The thing that makes things even wilder to find out (though this is after the film ends) that while the Coen brothers' Fargo is not based on a true case (it was their sort of satire of movies that do the 'true story' for artistic license), Kumiko, strangely enough, is.According to IMDb, a woman naked Takako Konishi actually watched the movie Fargo and went out to try and find it. At least, that's the extent to which the movie and real life connect. Perhaps the Zellners took license from there; certainly it would seem to make sense, but they take this true event (from a not-true event from the film) and use it as a way of jumping off into a character study of this rather lonely woman. Or, one should say, she's perhaps alone but not exactly lonely - except for one aspect involving her rabbit, which should be addressed - as she has this movie to give her hope outside of her dreary job and inquisitive mother.She is not interested in meeting a man or getting married or having kids. In the one of the few moments we get some character development, we see that she considers herself a \"Spanish Conquistador\" going to \"The New World\" (this actually pops up as the title card when she arrives in Minnesota). So she makes a decision one day, not exactly on a whim but after what seems to be much thought (and going through the possible tragedy of a torn VHS tape - how she finds the tape is never explained, same with the ending, but more on that in a moment), and leaves her rabbit on a subway car. This last part - the bunny is Bunzo, can't forget that - seems oddly sad, just by nature of this character having a pet its cared for and now the pet's no longer there. Plus, it's a cute bunny after all.There's a bit of culture clash - apparently there's no one who's Japanese up in Minnesota/North Dakota, Kumiko knows very little English, and the one helpful Deputy in town (played by director Zellner) thinks a worker at a Chinese restaurant can help translate. There's a few moments of sort of awkward comedy here, which if I had to be honest were the parts that worked for me the least. Maybe this is where the Alexander Payne connection comes in (he's executive producer here), and there's one character in particular that seems air-lifted out of a Payne film into Kumiko's journey. But it's ultimately about what Kumiko is going and how she is going to get there. It's predictable stuff to see these sort of folks in this environment, even as it is refreshing to see a police officer depicted as just a straight-shooting, caring person like the Deputy here.This concept could have been delivered in a few ways. This could have gone even more into meta terrain based on the 'real' 'fake' real' 'fake' sort of play at work, or even been more exuberant or crazy; certainly, when one hears about this idea for a story, it has to come down to execution. I think those who hear about it like that may be thrown off or even disappointed by what Kumiko the Treasure Hunter is. It's much more of a film about its own sense of magic realism, that this indicator of treasure is discovered one day in a cave off of a beach (why is she there, what for, who knows it's there), and then when the ending comes, which, spoiler, she DOES find the suitcase in the snow (with Bunzo present), it feels like it's gone off from reality.Is this in her head? I think its ambiguity is not unearned but part of a kind of dreamy logic that is really all about a dreamer. It's most telling that Werner Herzog has a glowing recommendation on the front of the blu-ray; many of his films deal with people trying to find something great that is beyond them, yet the vehicle of cinematic expression itself makes things more realer than reality, that it carries on an extra dimension for an audience member (i.e. Aguirre as an actual Conquistador, or Fitzcarraldo with the ship, or Stroszek, also set in the North Mid-West, which I thought of a few times). It's a downright Herzogian trip, and the lead Rikku Kiuchi (you may recall from Babel and Pacific Rim) is outstanding in scenes where she has to also play it (and even wear that red hood, a fairy tale character with a blanket-shield) as ambiguously as the writers have it: is she crazy? Is she a little 'off'? Who's to say?I don't think the filmmakers ever judge her for a moment, and that's why this story works - on the contrary, if anything she is practically lifted to mythic status, and it will deliver different things depending on the audience watching. Do you want a sad ending or happy ending? Should a dreamer like Kumiko get what she's after? Like the film that Kumiko is obsessing over, it's never quite so clear.",
    "rating": "40",
    "date": "December 8, 2015"
  },
  {
    "reviewer": "Lazhward K.",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/972335359/",
    "review": "  An intriguing story of a woman's escape from everything with everyone against her. Perhaps relatively light-hearted on the surface but ultimately rather grim down below. Beautifully shot, but ultimately repetitive story-wise, which unfortunately makes it just fall short of amazing.",
    "rating": "40",
    "date": "December 1, 2015"
  },
  {
    "reviewer": "David H",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/972443020/",
    "review": "  Easily the most abysmal film I have seen in my 64 years. Totally fanciful and full of emptiness, no direction at to least a plot, the film rambles on to a naive and predictable ending. The film really is the pits of all pits.",
    "rating": "ni",
    "date": "December 1, 2015"
  },
  {
    "reviewer": "kenscheck",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/890863156/",
    "review": "  Interesting and weird, this film is based on the Urban Legend that a young Japanese girl went to the Midwest of America and died searching for the money Buscemi buried at the end of the Coen Bros. film \"Fargo.\" Of course, the reality is that the real girl's death had nothing to do with the movie, she actually had committed suicide. But much like the movie that served as inspiration for our main charactr and obviously to the filmmakers...the idea of the \"True Story\" is not as essential as the quality of a unique story they wished to tell. Now, this isn't \"Fargo,\" but it is a pretty cool unique film that doesn't look or feel like most films I've seen out lately. Even if it isn't the best film at least it has that going for it.",
    "rating": "35",
    "date": "November 20, 2015"
  },
  {
    "reviewer": "Elizabeth M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/874692669/",
    "review": "  Older Woman: Solitude? It's just fancy loneliness.",
    "rating": "40",
    "date": "January 25, 2014"
  },
  {
    "reviewer": "Jason B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/971301465/",
    "review": "  When I looked at the final score for Kumiko I was a little shocked. I typically punch in the numbers as soon as possible after watching the film but when I look back I cannot question my attributions. Kumiko is an interesting film about a woman who clearly has some sense of mental illness, probably depression, and becomes entranced with the idea of seeking out and finding the buried treasure from the Coen Bros. film Fargo.The lowest scoring attribute, in my opinion, is the editing. There are times that the film lags on and I feel it could be re-organized to work a little better. It is a good movie, and I expect to watch it again down the line, but I don't really think it is for everyone.",
    "rating": "30",
    "date": "November 16, 2015"
  },
  {
    "reviewer": "Justin E",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/918676106/",
    "review": "  A dark film that is often difficult to watch. ...I don't like the feeling it leaves me with",
    "rating": "50",
    "date": "November 14, 2015"
  },
  {
    "reviewer": "Greg N",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/907111989/",
    "review": "  The strange parallels and references to Fargo's story made this interesting, but didn't really make it a good movie.",
    "rating": "30",
    "date": "November 9, 2015"
  },
  {
    "reviewer": "Tor M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/782432537/",
    "review": "  A Japanese lady - she looks 16 but she's really in her late 20's, got a solid plan. She is going to find the treasure that the \"Fargo\"-character that Steve Buscemi played buried in snow in the mentioned film. She hates her job and her family, she has no friends. She cares for a little rabbit, but that's about it. She seem like a lonely girl that struggles with her mental state among other things. Her plan is the only thing that matters.This is a great plot. Original and very refreshing! It's based on true events too, that's pretty interesting, even if there never was a treasure hunt going on in the real life story. It looks nice and it got some superb moments. It forces me to hang on to it as we are in for a ride. \"The Octopus Project\" lifts the film with their nice, experimental instrumentals that are layed over the shots.Entertaining film, driven by the very interesting lead. Great acted, lovely shot - spiced with humour and weirdness. It's close to be totally solid and superb, but the true emotions stays out and I feel left out from some mysteries that I really want to know more about.8 out of 10 \"95\" pages.",
    "rating": "40",
    "date": "October 30, 2015"
  },
  {
    "reviewer": "Justin G",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/721239839/",
    "review": "  #1 countdown to 2000 ratings",
    "rating": "35",
    "date": "July 4, 2015"
  },
  {
    "reviewer": "Jason K",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/785171104/",
    "review": "  Beautiful cinematography and prob one of the most original films i've seen in abit, and this certain premise- maybe never.",
    "rating": "40",
    "date": "December 27, 2014"
  },
  {
    "reviewer": "Bob B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/961204384/",
    "review": "  This movie exists in two parts I think the second part is a little longer than the first but they are roughly equal. The first part is in Japan and it was in Japanese with English subtitles. I don't like reading subtitles but there wasn't much dialog so it wasn't so bad. The second part is in America (Minnesota, North Dakota) and is in English, this was much nicer for me :) To begin with I liked the look of this film. I thought it was very beautiful almost every scene I found attractive and engaging I wanted to travel to these spots and see them for myself.I haven't ever really fit in anywhere. I don't really understand people and they don't understand me. I have spent most of my life alone and afraid trying to find that one magic bullet that will make everything alright. Sometimes I think that it is all just a nightmare and I will wake up to my big house and my loving family. But there isn't any magic bullet and when I wake there isn't any reprieve.I loved Kumiko (the character). On the outside I thought that she was as lovely as the movie itself. On the inside I could very easily identify with her struggles. Things were going wrong for her and she didn't know how to fix them. She was hurting people and she didn't want to.... and she couldn't stop. But then she heard of a silver bullet that could make all the pain go away. She went on an incredible trek in an effort to set everything right. I'm not going to tell you if it worked or not.... I will tell you that if you are open to this type of experience then this particular movie will melt your heart.",
    "rating": "50",
    "date": "October 18, 2015"
  },
  {
    "reviewer": "Dinesh P",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/854088309/",
    "review": "  Maybe adapted from a true story but the basic premise that a girl looking out for the treasure buried in the film Fargo is too outstretched neither do the incidents through the film lighten up the act.",
    "rating": "10",
    "date": "October 5, 2015"
  },
  {
    "reviewer": "Robert H",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/837155450/",
    "review": "  A little light on plot and dialogue, and perhaps thus more suited to patient viewers, KUMIKO THE TREASURE HUNTER is still a well-acted, quirky character piece with hauntingly beautiful imagery that also explores interesting themes.",
    "rating": "35",
    "date": "May 19, 2015"
  }
,
  {
    "reviewer": "Peter G",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/876283028/",
    "review": "  This is a true story. Well, maybe not. But it is certainly inspired by a real life person. Her name was Takako Konishi, an office worker from Tokyo. You probably should rewatch FARGO before seeing this. Downbeat but recommended for its visual uniqueness and bizarre score from The Octopus Project. Filmed in Minnesota.",
    "rating": "35",
    "date": "September 25, 2015"
  },
  {
    "reviewer": "Lee M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/791471625/",
    "review": "  Kumiko, the Treasure Hunter may prove to be too quirky and peculiar for average mainstream audiences. To be sure, this film is plenty bizarre, but it's equally engaging by way of its beautiful cinematography and powerfully touching performance from Rinko Kikuchi who anchors this haunting, fable-like story of both tragedy and hope effortlessly, balancing the sadness and absurdity.",
    "rating": "35",
    "date": "February 16, 2014"
  },
  {
    "reviewer": "Brad S",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/783623907/",
    "review": "  This is definitely a unique and interesting film. Apparently based on a true story of a woman from Tokyo who went to Fargo in search of the buried money from the film \"Fargo\" thinking it's real. Oscar nominee Rinko is great, and it features gorgeous cinematography. It is slow in patches but is worth watching. Recommended!",
    "rating": "35",
    "date": "September 19, 2015"
  },
  {
    "reviewer": "Kong L",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/907149831/",
    "review": "  BEAUTIFUL | FRUSTRATING | UNSETTLING (73-out-of-100)",
    "rating": "30",
    "date": "September 10, 2015"
  },
  {
    "reviewer": "Anurag S",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/906594122/",
    "review": "  Kumiko's story is something. Few dare to break out of their boring lives and head out in search of their treasure. It's heart breaking when she calls herself a 'Spanish Conquistador' and let's go her bunny Bonzo. The ending was unpredictable.",
    "rating": "40",
    "date": "September 2, 2015"
  },
  {
    "reviewer": "Blair F",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/906874353/",
    "review": "  Something is dreadfully wrong here. I am utterly amazed that some people rated this so highly. I say this is one of the worst movies of all time. Why? The character is completely unlikable and the plot goes no where. I kept waiting for something to happen but it just droned on and on. Do yourself a favor and forget this one, unless you just want to waste two hours of your time.",
    "rating": "05",
    "date": "August 28, 2015"
  },
  {
    "reviewer": "Tatsuhito K",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/906702164/",
    "review": "  An extremely bizarre yet oddly engaging and darkly comedic drama. In terms of narrative, I feel like a lot of the things in the film would not make any sense (Fargo is a movie, not a true story). But the cinematography is stunning, and Rinko Kikuchi does a solid job as a Japanese woman who embarks on a journey of treasure hunt. Kumiko, the Treasure Hunter is what you call an intriguing film, and if you can accept its strange premise, you will find some enjoyment in this film.",
    "rating": "40",
    "date": "August 17, 2015"
  },
  {
    "reviewer": "Bart C",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/907529234/",
    "review": "  bummer without a purpose.",
    "rating": "15",
    "date": "August 11, 2015"
  },
  {
    "reviewer": "John K",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/905617862/",
    "review": "  A darkly comedic and odd masterpiece. It takes a while for the story to take off and the sound design is consistently poor, but the film is worth it, serving as a fascinating character study about a woman who refuses to conform to the submissive stereotypes in her native Japan and, instead, chooses to have her own form of a terrifying adventure. Rinko Kikuchi gives a borderline Oscar-level performance in a film that is strange, wonderful, and follows the simple formula by allowing us to enjoy watching someone bumble and stumble towards their goal with a singular, unrelenting focus.",
    "rating": "35",
    "date": "August 7, 2015"
  },
  {
    "reviewer": "Kelly K",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/819178013/",
    "review": "  This was delightful - kinda sad, too. I loved how sweet people were to her and tried to help her.",
    "rating": "35",
    "date": "August 7, 2015"
  },
  {
    "reviewer": "Arlene S",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/847963049/",
    "review": "  VERY disappointed in this.",
    "rating": "15",
    "date": "August 2, 2015"
  },
  {
    "reviewer": "Kace C",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/820543051/",
    "review": "  Kumiko, the Treasure Hunter [US, 2015] Shares the same visual pleasure Fargo offers. Quite an odd & artistic mimicry of mental illness. 8/10",
    "rating": "40",
    "date": "August 1, 2015"
  },
  {
    "reviewer": "Craig F",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/907233324/",
    "review": "  The lines between desperation, stupidity, and adventurousness are muddled as the film drags on due to Kumiko's apparent autism and determination.",
    "rating": "20",
    "date": "June 14, 2015"
  },
  {
    "reviewer": "Patrick S",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/911546344/",
    "review": "  From a Minnesotan's point of view, the film becomes personal in some ways. It perceives the ice-cold wasteland as the \"New World\", one that's not far off from Tolkien's Middle Earth.",
    "rating": "50",
    "date": "July 26, 2015"
  },
  {
    "reviewer": "Josh W",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/838059403/",
    "review": "  It's certainly not what I expected, and that, in every way, is a good thing.",
    "rating": "50",
    "date": "July 26, 2015"
  },
  {
    "reviewer": "Anatoly S",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/784238567/",
    "review": "  While it wasn't bad, it wasn't particularly interesting either. I don't think I can recommend this one.",
    "rating": "30",
    "date": "July 25, 2015"
  },
  {
    "reviewer": "Adrian S",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/792478225/",
    "review": "  An outstanding and compellingly-offbeat feature that charts the strange journey of an obsessive Japanese woman in pursuit of a suitcase full of cash. The kooky nature of the protagonist and its nihilistic depiction of a chauvinistic Japanese society might prove too hard to swallow for some, but if you look beyond, you'll find snatches of dark humour. Part of the charm of Kumiko is how seriously it treats its protagonist's (absurd) obsession and what could have been a lame movie turns out to be worth the time because Kumiko's utter conviction and courage makes us root for her.",
    "rating": "40",
    "date": "March 9, 2015"
  },
  {
    "reviewer": "Mike K",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/906246117/",
    "review": "  Japanese loner looking for cash buried in the snow from the film Fargo. I loved it.",
    "rating": "40",
    "date": "July 19, 2015"
  },
  {
    "reviewer": "emulator29 .",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/968965851/",
    "review": "  ad least ..different !",
    "rating": "35",
    "date": "July 19, 2015"
  }
,
  {
    "reviewer": "Magnus S",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/885747644/",
    "review": "  Original and surreal. Slow-paced and emotional concept that unfortunately sounds better on paper. Still worth a watch.",
    "rating": "30",
    "date": "July 18, 2015"
  },
  {
    "reviewer": "Remy D",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/914359505/",
    "review": "  Pleasant to both look at and moving in a strange and unique way. One of the more interesting and unusual films I've seen, but one I very much enjoyed. Despite what seemed inevitable, I couldn't help but hope for the best!",
    "rating": "40",
    "date": "March 18, 2015"
  },
  {
    "reviewer": "Berni E",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/807112302/",
    "review": "  Very strange and very slow American/Japanese subtitled movie but it won me over with the lead actor, the photography and the score - and the story is based on an urban legend.",
    "rating": "35",
    "date": "July 13, 2015"
  },
  {
    "reviewer": "Wayne K",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/970610344/",
    "review": "  Being a fan of movies that defy convention and create their own unique world in which to entertain us, I had heard a lot of good things about this movie and was eager to see it. Seeing the names Alexander Payne and Jim Taylor in the opening credits certainly heightened my optimism. But by the time it ground to a halt an hour and 40 minutes later, I exhaled in a manner that said 'Well, I kinda wish I hadn't bothered now.' There were aspects of the film I thought were interesting, such as its clever use of imagery to reinforce its themes, primarily confinement and monotony. It also photographs the snow-torn regions of North America in such a way that they come across not as beautiful and tranquil, but as hostile and lifeless. For me, the main issues with the film were its pacing and its protagonist. The story takes an inordinate amount of time to start really playing out, and rather than feeling like a voyage of fulfilment and self-discovery, it's structured more like a brooding think piece, but with nothing deep or meaningful to contemplate it just comes across as hollow and ponderous. Kumiko, out intrepid hero, is among the dullest leads in any motion picture I've ever seen. She is every 'Shy girl breaking out of a sheltered, uneventful life' that you've ever seen onscreen, and as the film progresses she gets no more interesting. At one point she's picked up by a kindly old lady who, despite having less than 10 minutes of screen, gets more characters development than Kumiko gets in an entire 95. I don't want to bash Rinko Kikuchi, who does have some tender moments, but she's given little to do here other than look bored. Who knows, maybe at some point in her life she was also witness to an admittedly promising premise which rapidly descended into mind-numbing tedium.",
    "rating": "20",
    "date": "July 13, 2015"
  },
  {
    "reviewer": "Anson P",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/967115456/",
    "review": "  A horrible boring movie starring a sad mentally ill character, on a delusional journey to find a briefcase of money to make her life happy. The photography is brilliant though.",
    "rating": "05",
    "date": "July 12, 2015"
  },
  {
    "reviewer": "Luis V.",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/967211111/",
    "review": "  �Como definir esta pel�cula? Rta. Una persona a la deriva en alta mar en busca de una isla llena de hamburguesas :) �la encontrara?",
    "rating": "40",
    "date": "July 11, 2015"
  },
  {
    "reviewer": "Abdulmalik A",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/906510306/",
    "review": "  A good -- but not entirely likable -- film that might have been great but isn't quite",
    "rating": "30",
    "date": "July 10, 2015"
  },
  {
    "reviewer": "Chris B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/942997821/",
    "review": "  Wow, this movie like totally sucked the weenie. What a waste of my time. If you watch it you will be so upset with yourself you might want to commit suicide wanting to get back that hour and a half (actually a bit more) back.",
    "rating": "ni",
    "date": "July 8, 2015"
  },
  {
    "reviewer": "Tommy G.",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/970750141/",
    "review": "  This one is brilliant all around. What a concept and pulled off brilliantly. The Zellner's at the top of their game.",
    "date": "July 5, 2015"
  },
  {
    "reviewer": "Matthew S",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/906665945/",
    "review": "  It is not always a negative when film causes discomfort or leaves the viewer troubled after seeing it. The challenge for me is that I needed a bit of distance and then a \"revisit\" to this movie to articulate my opinion. The Zellner Brothers have created a film that is a bit closer to \"truth\" than The Coen Brothers' \"Fargo\" back in 1996. The Coen Bros' cleverly elevated the cultural satire of \"Fargo\" to lead us to believe it had all been based on fact. There was no real Internet for us to access to determine if there was any \"reality\" in the story of \"Fargo\" at that time. We now know that there was actually nothing \"true\" about \"Fargo\" except the disquieting \"truth\" that it most certainly could have happened. David and Nathan Zellner's film is an abstractly loose variation on an actual incident involving a Japanese woman who died in the unforgiving climate of Fargo's winter. The real \"truth\" was she was there to revisit memories of a past love. But due to misunderstanding her English prior to her death, a false rumor began to form into a \"truth\" that she had traveled to Fargo to find what she \"believed\" to be the stolen money buried in The Coen Brothers' 1996 film. \"Kumiko Treasure Hunter\" plays with the the idea that has remained firmly grounded in the realms of urban myths generated by \"Fargo\" the movie. Rinko Kikuchi gives a painfully realistic performance of a woman so depressed and detached from her own world in Tokyo -- her only \"friend\" is her pet rabbit, she is seems unable or unwilling to \"connect\" within anyone other than her pet. Wisely, it is never explained why or how Kumiko manages to \"unearth\" a battered VHS tape of \"Fargo\" But it is clear she mistakes that iconic film's opening statement, \"This is a true story\" for \"fact\" and assumes she is seeing some sort of documentary. Her inability to apply logic to her situation and desires leads her to abandon everything, including her beloved pet rabbit, to find her way to Minnesota in pursuit of what she now perceives to be her life's mission. She is hellbent on finding that case of money she saw Steve Buscemi buries in the snow. David Zellner's film is even more quirky than Coen's \"Fargo.\" But this quirkiness is established in the ways we see a clearly unstable woman interacting with her Japanese peers, boss, family and the local Americans as she refuses to relent in her pursuit. It is a fascinating journey to follow. Mixing realistically comic encounters with the increasing uneasy tone is achieved by a balance of acting fused with effective musical score / camera work. The movie is constantly challenging the viewer to know if it is \"ok\" to chuckle/laugh or if this reaction is inappropriate. Rinko Kikuchi never drifts away from what is clearly a tragically lost character in dire need of help. This entire cinematic experience is both fascinating and devastating in equal measures. Kumiko The Treasure Hunter is one for whom we cheer. And she is also a tragic parable of humanity pursuing dreams that are impossible to achieve. This masterful film weaves its way into our minds and hearts. One should not miss the opportunity to see this movie. It carries a disarming level of power.",
    "rating": "50",
    "date": "June 30, 2015"
  },
  {
    "reviewer": "ManIsh A",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/903591870/",
    "review": "  This is Rinko Kikuchi's show. She's fantastic.",
    "rating": "30",
    "date": "June 29, 2015"
  },
  {
    "reviewer": "Mark C",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/832800147/",
    "review": "  Imagine if Jim Jarmusch directed an extremely dark, live action, Japanese episode of \"Daria\".",
    "rating": "35",
    "date": "June 29, 2015"
  },
  {
    "reviewer": "Reece L",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/888687546/",
    "review": "  Partly a bizarre, fictionalized biographical drama, partly a love letter to cinema, and partly a quiet musing on depression and the dangers of unpoliced escapism, \"Kumiko, the Treasure Hunter\" is a stylishly shot, smartly directed, and elegantly paced film for those who love the medium with off-beat humor and a subtly stellar performance from Rinko Kikuchi.",
    "rating": "40",
    "date": "March 9, 2015"
  },
  {
    "reviewer": "David L",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/901488735/",
    "review": "  Kumiko, the Treasure Hunter is beautifully filmed with terrific cinematography and gorgeous scenery and it is fairly well directed, but the script is weak never making use of its interesting premise and the protagonist is awfully flat, unlikable and just plain boring. It could have been a great film had it been as amazing as its ending, but it unfortunately isn't and it's just passable because it is so lifeless, tedious, extremely slow and uninspired. It is such a shame because it had a lot of untapped potential.",
    "rating": "30",
    "date": "June 26, 2015"
  },
  {
    "reviewer": "David K",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/900451477/",
    "review": "  A dark and charming tale of the imagination. Mostly for movie buffs or fans of Fargo and art-house.",
    "rating": "30",
    "date": "March 19, 2015"
  },
  {
    "reviewer": "Mark M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/963822019/",
    "review": "  Based on an urban legend which originated from a true story, Kumiko, the Treasure Hunter is many things; Rinko Kikuchi's best dramatic vehicle yet; the calling card of David Zellner (and his brother, Nathan); an intricate study of loneliness, depression, and social stigma, along with cultural and linguistic barriers. Everything Kumiko strives to be - intentionally or otherwise -, it achieves twofold.A master stroke in direction, writing and acting, Kumiko places the titular character in a position that has her being swallowed alive by depression and loneliness in the buzzing capital of Japan, with her only companion that brings more than a sentence trailing out of her mouth being a pet rabbit and show stealer named Bunzo. Accosted by her employer for her senseless career direction and her own mother for not having a lover, the socially inept Kumiko clashes head on with the prevalent norms for women in Asia, and not much changes when she arrives in America, as the two are exchanged for other kinds of barriers that she fumbles to climb up in her fervent mission through the tundra of North Dakota to discover a treasure that doesn't exist to everyone else but her.Put through the emotional meat grinder, every frown, grimace and bewildered expression is accompanied by a mortally petrified, socially awkward voice that Academy Award nominee Rinko Kikuchi manages to squeeze out of the grey, chapped lips of Kumiko, as the actress' evocative, physical acting tells the heart-wrenching story of a woman who would rather find solace in lonely nights of exhausting the lifespan of her Fargo VHS tape and feeding ramen to a bunny rabbit. A bunny rabbit that - under Zellner's direction and Kikuchi's performance - has possibly one of the most moving scenes for an animal in film, beside the likes of Samantha in I Am Legend (2007), Marley in Marley & Me (2008), and Hachi in Hachi: A Dog's Tale (2009).Kumiko doesn't boast inventive cinematography, but what it lacks in creativity, it makes up with aesthetics; the film is nothing short of beautiful, with each shot coming off as naturally picturesque. Easy on the eyes, utilizing wide shots with a warm color palette in portions set in Japan and a colder palette for portions set in the ice-crusted locales of America, the character Kumiko's treads the entirety of the film and its contrasting settings almost entirely in a red hoodie, setting the fairy tale tone the Zellner brothers had intended to achieve.The film, as brilliant as it is, falls short of being considered a masterpiece by this reviewer and certainly makes docking points for its third act a painful decision to make (three days of contemplating) due to the impact of Kumiko, the Treasure Hunter's ending being softened and, ultimately, lost due to how the Zellner brothers forgo the ambiguity and mysticism that the climax had steadily built up to, instead resorting to a giddy, unsubtle, hammer-on-the-head ending. It makes one wish the film would've taken the route of The Sopranos and abruptly cut to black when the rare smile cracks across Kumiko's lips.",
    "rating": "45",
    "date": "June 22, 2015"
  },
  {
    "reviewer": "Ron G",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/818166703/",
    "review": "  A simple version of A Beautiful Mind... It drew me in and got me believing it could be real. Seemed real.",
    "rating": "50",
    "date": "June 22, 2015"
  },
  {
    "reviewer": "?? ?",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/962416715/",
    "review": "  It is a short story about an emotionally unstable Japanese OL who ran away from everyone (work, friend and her mother) for her fantasy in Fargo. It is artsy and some decent acting. However, I have no idea what this movie is trying to achieve.",
    "rating": "25",
    "date": "June 22, 2015"
  },
  {
    "reviewer": "Joe B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/834548343/",
    "review": "  A wonderfully strange and painfully sad (though, with some comedic elements) film loosely based on an actual event. Rinko Kikuchi gives an excellent performance performance, really inhabiting a delusional, depressed life and capturing the human experience of loneliness all too well. It's a deliberately paced film but it's never boring.",
    "rating": "35",
    "date": "June 20, 2015"
  }
,
  {
    "reviewer": "finlaybuchanan",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/908240562/",
    "review": "  Dreadful, slow, boring.",
    "rating": "05",
    "date": "June 19, 2015"
  },
  {
    "reviewer": "Bubba M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/909953302/",
    "review": "  Nothing of interest happens in this movie and it takes forever to get there. No likable characters, no payoff - Don't waste your time on this one.",
    "rating": "05",
    "date": "June 16, 2015"
  },
  {
    "reviewer": "Nick K",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/785047641/",
    "review": "  Japanese cinema never runs out of bizarre story lines that go above and beyond. Having said that, I was surprised to find out that this is actually based on a real story",
    "rating": "40",
    "date": "June 16, 2015"
  },
  {
    "reviewer": "Sam P",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/920113850/",
    "review": "  Rinko Kikuchi's performance is great for this mysterious unusual character who's on the way to Fargo to find the money that was buried in Fargo film. It has a very strange story and plot. The cinematography on the other hand is great, beautiful compositions and enjoyable colors.",
    "rating": "35",
    "date": "June 15, 2015"
  },
  {
    "reviewer": "Robert B.",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/965766352/",
    "review": "  Nice drama / fable (and based on a real story turned on a urban legend - serach for Takako Konishi and you will find) about a lonely japanese woman that delusionaly search for a treasure of the Fargo movie, going from Tokyo to Minesotta. Nice actings (loved the rabbit!), unsettling ending, but a nice fable after all - or a story about mental illness if you like. As a movie 7 / 10 - as a way to sell a sad story in a fantasy setting a zero for the lack of humanity.",
    "rating": "30",
    "date": "June 14, 2015"
  },
  {
    "reviewer": "Ian W",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/894821791/",
    "review": "  A somewhat bizarre black comedy about a Japanese woman looking for lost treasure she sees from the movie Fargo. Visually stunning at times with a great soundtrack. If you enjoyed films like Fargo then you'll love this.",
    "rating": "40",
    "date": "June 14, 2015"
  },
  {
    "reviewer": "Tiago C",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/939408327/",
    "review": "  Homenagem ao filme Fargo. Japonesa depressiva encontra uma fita do filme Fargo e decide ir at� os Estados Unidos para encontrar a mala cheia de dinheiro que o personagem enterrou em um lugar cheio de neve na cidade.",
    "rating": "30",
    "date": "June 13, 2015"
  },
  {
    "reviewer": "Ky K.",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/904749596/",
    "review": "  Kumiko is striking and devastating at once, a quixotic drama with a tone of tragedy.",
    "rating": "35",
    "date": "June 12, 2015"
  },
  {
    "reviewer": "Eric H",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/906385384/",
    "review": "  This is a great little artsy picture that will sail right over a lot of heads. If you'd like something a little different with a tightly constructed plot that only appears to veer into madness, this one will fill the bill. It's slow and easy to follow if you pay attention. Don't look for alternate endings, because the one they gave it is perfect.",
    "rating": "40",
    "date": "November 26, 2014"
  },
  {
    "reviewer": "Erik H",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/786783439/",
    "review": "  quirky and fun and dark and weird and great.",
    "rating": "45",
    "date": "June 10, 2015"
  },
  {
    "reviewer": "Ken C",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/878504299/",
    "review": "  Beautifully shot about an urban legend surrounding the death of Takako Konishi as she had died trying to find the treasure depicted in the 1996 film Fargo. Kumiko, the Treasure Hunter wraps the main characters with eeriness and some darkly comic moments, but overall this film delivers a weak and bleak story, feel unmotivated.",
    "rating": "30",
    "date": "June 10, 2015"
  },
  {
    "reviewer": "Alfin N",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/881538577/",
    "review": "  Kumiko, want to find something and doesn't want to be found.",
    "rating": "40",
    "date": "June 9, 2015"
  },
  {
    "reviewer": "Jordan D",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/805465998/",
    "review": "  Delightfully nihilistic!",
    "rating": "40",
    "date": "May 24, 2015"
  },
  {
    "reviewer": "Chuah A",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/786393514/",
    "review": "  A tale of urban social disconnect and the difficulties of nonconformism coupled with dreams of something far more valuable than just being. Kumiko reminds viewers of those who live differently and yearn for a buried treasure in a faraway land. The bunny and calls to mom are emotionally poignant, and it was heartwarming to watch the kindness of strangers in an otherwise cold bleak landscape.",
    "rating": "30",
    "date": "May 13, 2015"
  },
  {
    "reviewer": "Robby C",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/885486877/",
    "review": "  Funny and depressing. Loosely based on a true story of a mentally ill woman from Japan trying to find the buried money she saw in the movie Fargo.",
    "rating": "40",
    "date": "May 10, 2015"
  },
  {
    "reviewer": "Cameron P",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/960323064/",
    "review": "  Typical British movie. Terrible special effects, overdone tropes, too many messages; save the world, Americans are dumb. Doesn't work as a nod to old spy movies, doesn't work as satire. Not even the gore sells it.",
    "rating": "05",
    "date": "May 9, 2015"
  },
  {
    "reviewer": "Flippant P",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/970038224/",
    "review": "  I loved this film. It was an absolute pleasure from beginning to end. It is written and directed by brothers Nathan and David Zellner; siblings who work collaboratively, somewhat like the Coen brothers. Now here's a tip: If possible look again at the great Coen Brothers 1996 Film Fargo before viewing this. Kumiko has seen Fargo many times. Many, many, many times. She has a VHS copy of it; how she obtained it, is in itself, a beguiling beginning to this whole saga. Kumiko is quite convinced by the message at the start of Fargo announcing \"This is a true story\". So to Kumiko the thousands of dollars buried by the side of the road by one of the gangsters in Fargo must also be true. The first part of the film is set in Tokyo and it is virtually like watching a Japanese movie with subtitles. Kumiko is a lonely office girl, but she prefers her loneliness, shunning the advance of old friends and trying to discourage the constant nagging phone calls from her mother. She hates her job and her boss and goes home each night to a small unit where she keeps a pet rabbit and watches Fargo over and over again. Studying it to determine exactly where, on the side of the road did Carl Showalter bury that money. She puts a \"plan\" in place to go to America and claim the riches she knows are there. \"Like a conquistador\" she explains to a bemused library security officer.The second part of the film titled \"New World\" is all spoken in English. It commences with Kumiko landing at Minneapolis airport and the road trip begins. It is beautiful and crazy - a bit like her. Her only money is a stolen credit card, she knows no one, speaks very little English, and commences to make her way to Fargo, and the treasure, in weather similar to that which was in the film Fargo - minus 10c with snow blizzards. The people she meets along the way are kind to her but their generosity and hospitality mean nothing: she is focused on her objective and nothing else. David Zellner plays the gentle local cop and his genuine concern for her makes no difference. Toward the end we see her progressing wearing a bed quilt stolen from a cheap motel it's multiple colours brilliant against the stark white snowscape (her conquistador armour?) There are some truly stunning images in this film.The last thing I would tell you is whether she reaches her impossible objective but it's the journey that counts and what a magnificent journey Kumiko, the Treasure Hunter is. To take a lead from a film as perfect as Fargo is a bold move, but with Kumiko, the Treasure Hunter Nathan and David Zellner pay worthy homage to the Coens and have created a superb film in their own right.",
    "rating": "45",
    "date": "May 7, 2015"
  },
  {
    "reviewer": "Jaret M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/288886718/",
    "review": "  A tonal hybrid between anime pacing and Coen Brother's dark humor, KUMIKO: THE TREASURE HUNTER is as a unique a film as I've seen in recent years while still feeling familiar and approachable. The brilliant Rinko Kikuchi creates such a quiet and nuanced performance that she is simultaneously sympathetic and wholly unlikable. The films biggest hurdle is one that the Zellner's don't entirely clear, with an ending that feels inevitable and not nearly as ambiguous as they seem to think. Regardless, they may have tripped over the hurdle, but they landed with grace; balanced by beautiful cinematography, a winning script, and believable performances across the board.",
    "rating": "40",
    "date": "May 6, 2015"
  }
,
  {
    "reviewer": "Steve P",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/794046475/",
    "review": "  I didn't really like this one. It's beautiful to look at, but the main character is almost completely silent through the movie, the musical score crescendos at times giving the expectation of something exciting about to happen - then it doesn't. It's one long boring story that all seems a bit pointless. There is supposed to be some cross-cultural humour but wasn't funny to me. It's tedious and unrewarding.",
    "rating": "25",
    "date": "May 6, 2015"
  },
  {
    "reviewer": "Lisa G",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/958475852/",
    "review": "  If the movie had been free to watch, it would have been kind of worth it. But it was $12. And was the most depressing movie I've ever seen about mental illness and what happens (and it's not great) when a person falls through the cracks. There's not much funny about it, and the same behavior by the main character gets increasingly troubling as the movie goes on. This should be a PSA for the National Alliance for Mental Illness on getting mental health treatment.",
    "rating": "10",
    "date": "May 5, 2015"
  },
  {
    "reviewer": "Alex S",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/928639325/",
    "review": "  Kumiko, the Treasure Hunter is a beautifully shot comedy that draws laughs in much the same way as the source it's centered around. With an ambiguous ending that opens various interpretations, this movie is a very enjoyable moviegoing experience.",
    "rating": "40",
    "date": "May 1, 2015"
  },
  {
    "reviewer": "Oscar R. Gorriz",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/969924108/",
    "review": "  Based on the urban legend of a Woman that after watching the movie \"Fargo, embarks on a hunt to find the money that one of the characters hid in Coen brothers' film. \"Kumiko, the Treasure Hunter\"is an amazing visual journey; full of powerful and emotional images. The Oscar nominated Rinko Kikuchi gives a terrific performance - with very few dialogue. Its always fun to catch some of references to the Coen brothers' films - like the rabbit that looks too much like the cat of \"Inside Llewyn Davis\". At the very end, the film loses its pace; the story drags a bit and one of the key plot point of the closure feels weak and ambiguous - it could have been emotionally stronger and more cinematic; the built up was great, but not the payoff. A very entertaining ride and a visual delight.",
    "rating": "40",
    "date": "April 26, 2015"
  },
  {
    "reviewer": "Eric B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/782112202/",
    "review": "  Though very strange, it's well shot, well acted and engaging.",
    "rating": "40",
    "date": "April 26, 2015"
  },
  {
    "reviewer": "Kurtiss K",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/906498583/",
    "review": "  Endearing and off-beat, Kumiko is a bittersweet tale of human endurance featuring a strong performance by Rinko Kikuchi.",
    "rating": "40",
    "date": "February 18, 2015"
  },
  {
    "reviewer": "Walter P.",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/969862734/",
    "review": "  At the beginning I was both uncomfortable and curious as I watched Kumiko, a withdrawn, uncommunicative, socially inept and single Japanese office worker, drive her life from zero to 60 on an ill-advised treasure hunting quest to Minnesota in THE WINTER. Scene after scene she would get in difficulty, accept help from those who were genuinely concerned for her, and then quickly and ungratefully reject further help in what developed as her signature passive-aggressive manner: she quietly ran away. At first her single minded persistence of her quest was admirable, if not endearing, for someone so completely out of her element and who seem to offer so little to the world. As the later scenes unfolded I could sense her adventure was running to a sad logical conclusion. Kumiko left me pondering what can happen when self-deception, a tactic that we occasionally use as a coping mechanism, runs unchecked. Poor Kumiko.",
    "rating": "45",
    "date": "April 21, 2015"
  },
  {
    "reviewer": "TeamCanada",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/900685565/",
    "review": "  + I both laughed & cried with his amazing film; outstanding performances, audio & visual tour de force.- While I loved its heavy undercurrents, it was challenging at times deciding how to react.",
    "rating": "45",
    "date": "April 20, 2015"
  },
  {
    "reviewer": "Harlequin68",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/900682338/",
    "review": "  Kumiko(Rinko Kikuchi) works in an office in Tokyo where she avoids her fatuous colleagues. Her patronizing boss(Nobuyuki Katsube) has her take care of his dry cleaning and other demeaning tasks. In response, she spits in his coffee. In her spare time, she takes care of her pet rabbit and defends herself by phone to her interfering mother. That leaves plenty of time to watch the movie 'Fargo' over and over. Not for any aesthetic reason mind you but to look for clues for buried treasure.\"Kumiko, The Treasure Hunter\" is an offbeat and engaging character study, about somebody who is not so much searching for something but running away from multiple somethings. And can you really blame her? While Kumiko's actions might be hard to sympathize with at times, remember how malleable reality can be at others, especially with this movie being inspired by a true story. 'Fargo' itself is a complete fiction that claims to be a true story before it starts. And 'Shogun' which is also referenced is historical fiction.",
    "rating": "35",
    "date": "April 20, 2015"
  },
  {
    "reviewer": "Kyle B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/891925965/",
    "review": "  A very unique film with great comedic moments and a lot of great Fargo callbacks. This movie was produced by Alexander Payne and it has that feeling of Nebraska where you have a lead character that is on a journey for an ill fated reward that the audience knows is not there. Rink Kikuchi did a good job as did some of the supporting actors like Shirley Venard. Great cinematography and costumes and well directed.",
    "rating": "40",
    "date": "March 2, 2015"
  },
  {
    "reviewer": "Scot C",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/915324793/",
    "review": "  One of the WORST movies I've ever seen!",
    "rating": "05",
    "date": "April 18, 2015"
  },
  {
    "reviewer": "Steven E.",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/929536273/",
    "review": "  I kept wanting (and expecting) this odd little fairy tale to satisfy me like Hanna or Run Lola Run, but it never did. It just depressed me, and made me wonder \"why is this woman allowed to live on her own\" and \"who gave her the first treasure map that started all of this nonsense\"?",
    "rating": "20",
    "date": "March 27, 2015"
  },
  {
    "reviewer": "Greg H",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/907553264/",
    "review": "  Kumiko has a hard life. A little misinterpretation and adventure begins.Cohen brothers would smile.",
    "rating": "35",
    "date": "April 14, 2015"
  },
  {
    "reviewer": "Hardy C",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/909002966/",
    "review": "  This is an odd bird, filmed partly in Japanese and English. The \"heroine\" is clearly mentally ill, which makes us sympathize with her obsession with the movie \"Fargo,\" which she doesn't think is fictional. It's the fish-out-of-water (though fish-frozen-in-ice may be more apropos) story with a certain poignancy that made me feel uneasy; why doesn't someone get this girl clinical help? I do applaud the ambiguous interpret-as-you-will ending though. Why leave the theater sad when you can leave it perplexed?",
    "rating": "35",
    "date": "April 12, 2015"
  },
  {
    "reviewer": "Jaime Lannister",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/910760535/",
    "review": "  Unfortunately there isn't any payoff at the end to justify the journey, a pity.",
    "rating": "30",
    "date": "April 11, 2015"
  },
  {
    "reviewer": "Ian G",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/771273532/",
    "review": "  Add this one under odd with an interesting concept, focusing on Kumiko, played by Rinko the star of Babel and Pacific Rim, as she is starting to fall deeper into a self made delusion after stumbling on an old VHS tape of Fargo that the treasure that Steve Bucemi buried in the snow is actually real, and she goes on a mission to find it thinking that it is a great way to discover some meaning in her life. The performance is very solid by Rinko, along with some decent cinematography and great inspiration which apparently is based on a real life story, but the Zellner's seem to be having a little trouble finding a consistent tone between somber Asian film and recapturing the quirky tone of the Coens, plus the ending of the film is pretty much open for some debate as well which begs the question for the audience why Kumikos state of mind isnt broken down more in the proceedings. Intriguing and a coffee conversation piece.",
    "rating": "30",
    "date": "February 25, 2015"
  },
  {
    "reviewer": "Patrick R",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/913716181/",
    "review": "  I loved everything after the 1:45 minute mark!",
    "rating": "10",
    "date": "April 5, 2015"
  }
,
  {
    "reviewer": "Sean R.",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/969662715/",
    "review": "  Funny and beautiful. See it on a big screen.",
    "rating": "50",
    "date": "April 4, 2015"
  },
  {
    "reviewer": "Steve P",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/939258448/",
    "review": "  Okay to sit thru once...but not worth it??",
    "rating": "25",
    "date": "April 4, 2015"
  },
  {
    "reviewer": "Mark H",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/851835142/",
    "review": "  4 out of 5 stars. The 2nd Japanese-American cross cultural film, with \"The Man From Reno,\" I've seen in 2 weeks and again a terrific, haunting, unique film experience. A lonely Tokyo \"office lady,\" washed up at 29 years old, finds a VHS tape of \"Fargo\" by the Coen Bros and becomes obsessed with finding the treasure buried in the snow by Steve Buscemi's character. She leaves her sad, dead end Tokyo existence and ventures to mid-winter Minnesota in search of the mythic money. It's a funny, sad and penetrating film that makes you question your own dreams, reality and sanity, yet never gets depressing due to the empathetic lead performance by the talented Rinko Kikuchi. She gives many shades to the character's quixotic journey, tilting insanely towards her quest through depression, zeal, panic and euphoria. The Zellner Brothers honor the frozen look and locations of \"Fargo,\" but create a spellbinding journey of their own. Part \"Into The Wild,\" part \"Grizzly Man,\" and part \"Fisher King,\" it is a beautifully picaresque tale with all the quirky characters she encounters along her destined path. Takes its time, but if you enjoy indie films that create a distinct mood and tone, this one is worth watching.",
    "rating": "40",
    "date": "April 4, 2015"
  },
  {
    "reviewer": "Ric B.",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/969646471/",
    "review": "  Well, \"darkly comedic odyssey\" is two-thirds right -- just take out the \"comedic.\"",
    "rating": "20",
    "date": "April 3, 2015"
  },
  {
    "reviewer": "Jennifer L",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/833424388/",
    "review": "  Beautiful and bare. I wasn't familiar with the Zellner brothers, but any film purporting to use the \"Fargo\" briefcase mythos as a call to pilgrimage kind of grabs my eye as well as $6 out of my pocket for a Good Friday matinee at the lovely Logan Theatre. I've (gone out of my way to) see a lot of intentionally strange movies in my day, but this one hits the tastebuds a bit differently. For one thing: the pacing seems off, but that's only because it's a realistic timeline. Adventure kind of happens hastily, and when it's dramatic, it comes to a pretty quick ending. Also factor in the main character's major depression. I kept checking my watch, not because I was bored, but because I wondered how the hell this would culminate in the allotted 15..10...5 minutes. I need not remark concretely on the plot, because everything you really need to know, you'll see in the trailer. Magical realism done right, that's my slogan. I'll watch out for the Zellner Bros.",
    "rating": "wts",
    "date": "April 3, 2015"
  },
  {
    "reviewer": "Christopher Llewellyn R",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/791473372/",
    "review": "  For those of you who are fans of Fargo, or of the FX series inspired by it - or both - Kumiko offers an interesting riff on the original story. Based on an urban legend that arose after a Japanese woman was found dead in a frozen field in Minnesota in 2001, the movie tells the tale of young Kumiko, living in Tokyo with her pet rabbit, who becomes convinced that the buried treasure featured in the Coen Brothers' film actually exists. So she abandons everything and heads to Minnesota in search of that thing dreams are made of, that may only be the stuff of dreams. The movie is rich in atmosphere and features a wonderfully off-beat performance from Rinko Kikuchi (Babel, Pacific Rim) as Kumiko.Unfortunately, the film also features a severely depressed central character, and watching her spiral downwards eventually becomes a chore. I loved the initial set-up of her dead-end existence at home. We get just enough sense of former promise - a happy childhood friend she meets, hints of former loves, references to a soured attitude - to make Kumiko's present existential despair especially poignant. As Kumiko gives into madness and travels to America to track down the fictional treasure, the movie struggles with tone. Is it funny? Is it sad? Is it horrible? The answer is a combination of all three, and while there is nothing wrong with juggling cinematic texture like this, when the ultimate outcome is as melancholy and lonely (loas it is here, then the laughs, at the end, feel hollow.Still, there is much to admire in the effort, and I found this film a major step up in production value and performance from the previous film I had seen from the Zellners, Goliath (which also deals with loneliness and despair). One sequence, in particular, still haunts me, and that is when Kumiko - about to depart on her quixotic quest - tries to set her beloved bunny, Bunzo, free. It's too bad that her relationship with Bunzo is the most meaningful one in the movie, however. Once he's out of the picture, a little part of me was, too.",
    "rating": "30",
    "date": "April 3, 2015"
  },
  {
    "reviewer": "Chris S",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/908796291/",
    "review": "  Glad I saw it, but not quite what I expected. Has some very slow moments. Made the world afterward seem quite unreal.",
    "rating": "35",
    "date": "March 30, 2015"
  },
  {
    "reviewer": "Facebook U",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/935590807/",
    "review": "  A delightfully whimsical comedy-drama about having faith in one's dreams, no matter how off the map they might be. Exquisitely dry humor and Rinko Kikuchi's charming, deadpan, oddball performance make for one of the more esoterically funny films to have been released in quite some time. This one won't appeal to everyone, but those with an off-the-wall sense of humor will surely appreciate this one.",
    "rating": "40",
    "date": "March 30, 2015"
  },
  {
    "reviewer": "Suzanne Dow",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/969574735/",
    "review": "  Just saw this yesterday. Wonderfully methodic, funny in ways that catch you off guard, sad and moving in ways that catch you off guard. Really stays with you after you leave the theatre. Fantastic meditative soundtrack, mesmerizing performance by Rinko Kikuchi. Have enjoyed other Zellner films, especially \"Kid Thing\" and \"Goliath\". Very glad to see them continuing so consistently and maintaining their very unique ability to be both absurd and poignant at the same time.",
    "rating": "50",
    "date": "March 29, 2015"
  },
  {
    "reviewer": "Stephen A",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/929416477/",
    "review": "  Looks very interesting.",
    "rating": "wts",
    "date": "March 25, 2015"
  },
  {
    "reviewer": "Peter F",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/782851126/",
    "review": "  The Zellner Brothers film is a mysterious and endearing film that's one of the most original \"adventure\" films to come down the pipe in some time. Based off of the fictionalized \"true\" story of Takako Konishi, the film actually is most socially potent in the first half which primarily looks at the stress and ennui that come from contemporary Japanese office life. This section is blackly humorous in the most relatable sense, and we fully understand the character's desire to find a new destiny for herself. Entering the American half, Kumiko becomes more exciting and unpredictable, culminating in an ending that's tragic, uplifting, and necessary all at once. Kumiko, the Treasure Hunter is certain to have you leaving the theater feeling a wide-range of emotions.",
    "rating": "40",
    "date": "March 21, 2015"
  },
  {
    "reviewer": "Taylor N",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/907013055/",
    "review": "  Humorous and curious. A lot of nice footage, and I wasn't bored. Worth seeing, but maybe not in theater.",
    "rating": "40",
    "date": "March 23, 2015"
  },
  {
    "reviewer": "Carol P",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/844027681/",
    "review": "  Had the opportunity to see this film at Sidewalk Film Fest last August. It made me impatient, depressed, and frustrated. As a huge fan of the movie FARGO, i was excited to see it, and horribly let down. I realize that i am in the minority on this, and although i will give points for originality, i would rather go to the dentist than sit through this film a second time",
    "rating": "20",
    "date": "March 21, 2015"
  },
  {
    "reviewer": "Adrian P.",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/960907126/",
    "review": "  I will never understand how every asian schreech-movie always gets a fresh score here. This is crap. Pure and simple. If this had been made by an American studio, it wouldn't even have gotten a mention.",
    "date": "March 13, 2015"
  },
  {
    "reviewer": "Rex A",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/915428341/",
    "review": "  Sounds pretentious, but in a pleasant sort of way.",
    "rating": "wts",
    "date": "March 11, 2015"
  },
  {
    "reviewer": "Sean W",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/862548688/",
    "review": "  Kumiko requires a lot of post-film reflection, as one tries to figure out what the point of it all really was. On the whole, it seems to be a story about a confused, naive and depressed young woman on the search for a better life, or at least something different.The slow opening of the film set in Tokyo does run on a little long, but once Kumiko arrives in America, we're treated to a lovely host of well-rounded characters that our titular character meets along her harsh journey through the freezing roads of Minnesota, beautiful imagery and an alluring performance from Kikuchi, not to mention the film's spot-on, deadpan comic timing.",
    "rating": "35",
    "date": "March 5, 2015"
  },
  {
    "reviewer": "Nick D",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/845689761/",
    "review": "  Quirky and weird, this movie tells the tale of Kumiko, a depressed office clerk with an obsession to find the fortune hidden in the snows of North Dakota, which she believes because of a pivotal scene in the movie \"Fargo.\" Yes, she steals a credit card and flies to Minneapolis on this pointless quest, of which she is rigidly convinced, much to chagrin of a parade of mildly amusing local types who manage to make Fargo's original goofballs even more benign. It's a cute trope, but I lost interest after too long watching this waif shuffle in a blanket through the snows of the frigid north. Her mental illness was beginning to rub the magic right out of the thing.",
    "rating": "25",
    "date": "February 6, 2015"
  },
  {
    "reviewer": "Homero C",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/841805884/",
    "review": "  I need to watch this movie RIGHT NOW!!!!!",
    "rating": "wts",
    "date": "January 30, 2015"
  }
,
  {
    "reviewer": "rottengia",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/901028287/",
    "review": "  Wow. The amazing reviews, awards and the great premise got me really excited to see this film. I love films that are dark, comedic, fantasy and offbeat. I was so disappointed that this didn't hit the mark by far. SO far! The story itself came off as a view of a woman w/severe mental illness, spirally downward and no one around her really sees that or cares. She's not just quirky and mistaken, she's certifiably delusional. And the audience doesn't really care - we don't start off caring for the character. We see her as just sour and grumpy and weird. THEN she goes to America and is met with the stalest, trite, cliche dialogue I've seen in a long, long time. But maybe the production itself...NO!! There are extreme music swells leading to nowhere - people around me were looking at each other, like, \"What was that all about?!\" The camera held on shots way too long and self consciously, like, \"Isn't this a cool shot? See? Isn't it?!\" It was a really interesting concept, but came off as an epic fail.",
    "rating": "05",
    "date": "January 25, 2015"
  },
  {
    "reviewer": "Nick P",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/782971099/",
    "review": "  FANTASTIC! Rinko Kikuchi is awesome. The vision is unique and the film seems like an even bigger treasure than the one it's about. It's a dream-like film worth having.",
    "rating": "40",
    "date": "October 21, 2014"
  },
  {
    "reviewer": "scottfrench2",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/896254245/",
    "review": "  Wonderful, in every way. Must-see, apparently will get a U.S. release in early 2015.",
    "rating": "50",
    "date": "August 9, 2014"
  },
  {
    "reviewer": "Maxime L",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/885034115/",
    "review": "  Dans Kumiko the treasure hunter on suit une h�ro�ne en pleine crise existentielle qui laisse tout tomb� pour suivre ses convictions les plus profondes. Son tr�sor plut�t absurde semble servir d'excuse � la fuite d'un monde qui n'est pas le sien. Aussi, il faut mentionner la sensibilit� poignante du jeu de Rinko Kikuchi qui donne vie � ce personnage touchant et complexe. Malgr� son caract�re dramatique, le film est parsem� d'un humour charmant qui all�ge l'atmosph�re. En somme, Kumiko the treasure hunter plaira � ceux qui sauront faire preuve d'un l�ch�-prise n�cessaire � l'immersion de ce voyage hors du commun.",
    "rating": "40",
    "date": "July 12, 2014"
  },
  {
    "reviewer": "Derek O",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/785999988/",
    "review": "  Works on so many levels, not just as a dramatic portrait of an alienated girl, but also as a meta-portrait of film. It's a fictionalized true story about a fictionalized true story. Light-hearted in a devastating way.",
    "rating": "45",
    "date": "February 12, 2014"
  }
,]