[

  {
    "reviewer": "Carlos M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/891372896/",
    "review": "  A comprehensive documentary that combines a great amount of video and audio footage with gorgeous animation and interviews to create a profoundly revealing character study, even if the final result feels a bit too long and some things are left hanging - like, where is Dave Grohl?",
    "rating": "40",
    "date": "June 1, 2015"
  },
  {
    "reviewer": "John B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/782114803/",
    "review": "  I often treat it as a moment of embarrassment that Kurt Cobain remains such a symbol of my Generation. A brilliant musician and a terribly strange messed up human being. Despite its subject, the documentary is one of most well crafted that I have seen in ages.",
    "rating": "40",
    "date": "April 24, 2015"
  },
  {
    "reviewer": "toejambaseball24",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/782541711/",
    "review": "  A fascinating chronicle of a troubled music icon.",
    "rating": "35",
    "date": "September 10, 2015"
  },
  {
    "reviewer": "Jason R",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/784110364/",
    "review": "  Brett Morgen (The Kid Stays In The Picture) uses archival footage, notes, drawings, and unseen home videos to bring to light the life and times of Kurt Cobain, the legendary singer/guitarist for the band Nirvana. We get a very intimate glimpse of the beloved musician from his early years all the way up to 1994, when he tragically took his own life at the age of 27. Having seen other documentaries produced on Nirvana and Cobain, I couldn't help feel that they were more idol-worship and spent less time focusing on the troubled life this man had. So, I was surprised and in some cases shocked with how much of his past they discussed. The use of home video footage to show how drug addiction drastically changed his mental and physical state, it was extremely upsetting to see. I grew up listening to these guys! Kurt was a gifted songwriter and musician. So, to get this level of intimacy and detail about his life. To see the events that made him the way he was. It was impressive that someone was able to put a documentary together that felt less like a love letter and more of a character study. I think it is the only real way you can effectively tell this story and they did it very well. On top of all this! Morgen utilized the incredible animation skills of Stefan Nadelman and Hisko Hulsing, to bring to life drawings done by Kurt. As well as, brilliantly bringing to life major events in the young Cobain's life. Which included his family troubles and his musical beginnings. The only issue I really had with the film was the exclusion of Dave Grohl, whose omission was a choice the director made. I felt it would have given the film a little more. But, ultimately I had no major issues with this documentary. It is very well done! The animated sequences alone make this worth your time. Even if you don't like Kurt Cobain! This is a great character study that doesn't pull any punches as it focuses on the events that both made and ultimately destroyed an extremely talented musician.",
    "rating": "45",
    "date": "May 9, 2015"
  },
  {
    "reviewer": "joe i",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/277300094/",
    "review": "  In a strange twisted vision to tell the story most music fans know, I think Cobain if still around would approve of the technique used by this film to tell his story.",
    "rating": "40",
    "date": "April 19, 2015"
  },
  {
    "reviewer": "Nick D",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/845689761/",
    "review": "  Morgan builds his story from home movies, artwork, artifacts of all sorts culled from the vaults and the personal collections of family members, including long-lost audiotapes, which are illustrated with dreamlike animations. It's a heckuva way to tell the story.",
    "rating": "35",
    "date": "December 29, 2015"
  },
  {
    "reviewer": "Rick C",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/935154143/",
    "review": "  Truly a sad look at an icon. You can't come away from watching it without thinking what a messed up, confused man, but above all think about what could have been.",
    "rating": "35",
    "date": "December 27, 2015"
  },
  {
    "reviewer": "Wesley H",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/968293545/",
    "review": "  Don't take the title lightly. Out of the many flavors of Cobain docs, this is the most pivotal as it explores the dark worlds of depression, addiction, anxiety, and fame. Morgen's melding of Cobain's journals and art traps us in the mind of a generation's savior - a savior that that generation never understood.",
    "rating": "45",
    "date": "December 15, 2015"
  },
  {
    "reviewer": "Andrew B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/972353228/",
    "review": "  I will start off by saying, you don't have to be a huge Nirvana fan to appreciate this documentary. I for one am a fan of NIrvana and Kurt Cobain, not a fanatic like some people who grew up in the 90s, but I did enjoy their music. Personally I am more of a metal fan loving bands like Pantera, Kreator, and Slayer. I always respected Nirvana, because even though their music was pretty simple and most of the songs just use the same chords and a lot of distortion, they helped rid the universe of moronic \"hair metal\" and \"glam metal\" bands. Bands like Poison and Warrant with their cheesy rock ballads in the 80s were so ready to be gone, they just needed a little push, and Nirvana gave them that push. And behind Nirvana came good bands like Pearl Jam, Smashing Pumpkins, Stone Temple Pilots etc... It was kind of an explosion of everything anti-hair metal. No longer was it clubs on the sunset strip with bands dressing up like women and fans of those bands also dressing up like women, wearing lipstick and putting a lot of hairspray in their hair, honestly it was disgraceful and one of the worst trends that music ever went through in my opinion. So to see it be destroyed by Nirvana and Kurt Cobain was a beautiful thing to me. It was now dress however you want, and let out all the aggression you have inside your body. But on to the documentary. Music documentaries are really hit or miss, it is rare that you are going to see a music documentary that you will enjoy if you are not a fan of the subject the movie is about. VH1's Behind The Music series was pretty good for a little bit when it first started out, doing short mini documentaries on musicians, but even now they are horrible. I saw a Behind the Music on the likes of 50 Cent, Pink and Neyo. Music acts that haven't really even been out that long at all, surely not long enough to warrant a Behind The Music. Just seems rather stupid to me. But Montage of Heck you can enjoy without being a fan of Kurt Cobain. This isn't only a film about the man in Nirvana, but also a pretty strong showing of what drugs will do to you. It does not matter how rich or famous you are, if you are a drug addict, you are equal to everyone else that is a drug addict as well. Being someone who has struggled with addiction in the past, I felt really connected with Kurt Cobain in this documentary. I know some people will say it was almost a little too much to watch him just crumble in front of your eyes as the movie progresses, but guess what, people need to see stuff like this. For too long has the world kind of hid their eyes from drug addiction. Just thinking it is a bunch of losers and down and out junkies who do nothing for society. When in reality, people of all races, sex, class, religion, rich, poor etc are affected by this. This is a great documentary that really takes you truly behind the scenes at one of the more mysterious figures in music. Yes, he is beloved to this day after committing suicide. But its amazing to watch a guy who pretty much had everything he could ever ask for. A family, money, fame, anything he could ever imagine, and he was just flat out miserable regardless of all of it, mostly do to his long time heroin addiction. I don't think Cobain is a musical genius by any means, but he's a polarizing personality and an innovative musician nonetheless. I just wish he would have truly committed to getting the help he needed because its clear as day that he was crying for help.",
    "rating": "50",
    "date": "December 3, 2015"
  },
  {
    "reviewer": "Adam R",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/898375055/",
    "review": "  A unique music documentary that even casual Nirvana fans should enjoy. The animated sequences were pretty cool. And the music was spot-on for once, as these kind of movies often don't end up using applicable songs. I am mostly out of the grunge phase in my life and would have enjoyed this more in my teen years, but it was nice to revisit an old interest. (First and only viewing - 5/16/2015)",
    "rating": "35",
    "date": "May 9, 2015"
  },
  {
    "reviewer": "John T",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/785233910/",
    "review": "  Really good documentary. This showed his whole life along with audio tapes of him and video footage and diary entries. You start to understand a little more about why he was the way he was.",
    "rating": "35",
    "date": "June 20, 2015"
  },
  {
    "reviewer": "Calvin C",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/782314003/",
    "review": "  Whether you like his music or not, this documentary is a fascinating look into a man who, for the most part, was a troubled genius. The super 8 films and home videos of Kurt and Courtney are what make the film standout. I thought the interviews were insightful, but didn't need the dramatic lighting and camera angles. It is less about his music than it is trying to figure out what was going through his mind and made him what he was.Grade: B+",
    "rating": "35",
    "date": "May 23, 2015"
  },
  {
    "reviewer": "Nathan M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/802043196/",
    "review": "  Absolutely brilliant and moving, #kurtcobain:montageofheck is a uniquely artistic and fitting documentary of one of the most iconic artists of a generation.",
    "rating": "45",
    "date": "May 18, 2015"
  },
  {
    "reviewer": "Casey B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/784518975/",
    "review": "  Sure it doesn't delve into the music side of things as much as it arguably should. But both as a glimpse into the headspace of a tortured artist and as an avant garde narrative, it is a stunningly effective journey.",
    "rating": "45",
    "date": "May 12, 2015"
  },
  {
    "reviewer": "Raji K",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/783249204/",
    "review": "  Brett Morgen writes and directs Kurt Cobain: Montage of Heck. The film focuses on the life of Kurt Cobain, and does not venture much into the aspects of Nirvana. The film starts off with footage of his childhood as well as interviews from his family. Its clear that his troubled teen years led to much of the angst present in his music. The film somewhat loses the documentary sense and becomes more of a myriad of imagery, and splicing together montages to construct what may have been going though his life. Footage of his wife Love also ensues, and the focus of the film really shifts to that relationship. Those looking for more a music based documentary will be disappointed as this film really only mentions the albums being made in passing. The film does not attempt at all to look at the impact or legacy of his life past his death. Overall Montage of Heck is worth watching for any Kurt Cobain or Nirvana fan, but I felt the film had a bit more fluff with the imagery and montage aspects as an artistic film rather than a documentary.",
    "rating": "30",
    "date": "May 8, 2015"
  },
  {
    "reviewer": "Harrison W",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/787346698/",
    "review": "  Incredibly self-indulgent, but I guess it has to be, right? Seemed a bit long to me. Very fair portrayal, though probably too heavy-handed at some points. Could have used more Dave Grohl. I heard that the director didn't have time-MAKE TIME, dude. He's the most famous/successful out of all of the people who knew Kurt.",
    "rating": "40",
    "date": "May 1, 2015"
  },
  {
    "reviewer": "James B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/921455210/",
    "review": "  I listen to nirvana nearly everyday and if your to watch any doc. about kurt and nirvana it should be this one, drunk then sober.",
    "rating": "50",
    "date": "June 16, 2015"
  },
  {
    "reviewer": "Romeo H.",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/904380699/",
    "review": "  A compelling and refreshing take into the life of one of the biggest stars of the 90's, Montage of Heck is a mesmerizing, stylish and intimate portrait of the beloved rock star.",
    "rating": "45",
    "date": "December 31, 2015"
  },
  {
    "reviewer": "Yenyen D",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/859108331/",
    "review": "  you gotta live long enough to learn how to live.",
    "rating": "35",
    "date": "November 20, 2015"
  },
  {
    "reviewer": "Andrew B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/910183655/",
    "review": "  I will start off by saying, you don't have to be a huge Nirvana fan to appreciate this documentary. I for one am a fan of NIrvana and Kurt Cobain, not a fanatic like some people who grew up in the 90s, but I did enjoy their music. Personally I am more of a metal fan loving bands like Pantera, Kreator, and Slayer. I always respected Nirvana, because even though their music was pretty simple and most of the songs just use the same chords and a lot of distortion, they helped rid the universe of moronic \"hair metal\" and \"glam metal\" bands. Bands like Poison and Warrant with their cheesy rock ballads in the 80s were so ready to be gone, they just needed a little push, and Nirvana gave them that push. And behind Nirvana came good bands like Pearl Jam, Smashing Pumpkins, Stone Temple Pilots etc... It was kind of an explosion of everything anti-hair metal. No longer was it clubs on the sunset strip with bands dressing up like women and fans of those bands also dressing up like women, wearing lipstick and putting a lot of hairspray in their hair, honestly it was disgraceful and one of the worst trends that music ever went through in my opinion. So to see it be destroyed by Nirvana and Kurt Cobain was a beautiful thing to me. It was now dress however you want, and let out all the aggression you have inside your body. But on to the documentary. Music documentaries are really hit or miss, it is rare that you are going to see a music documentary that you will enjoy if you are not a fan of the subject the movie is about. VH1's Behind The Music series was pretty good for a little bit when it first started out, doing short mini documentaries on musicians, but even now they are horrible. I saw a Behind the Music on the likes of 50 Cent, Pink and Neyo. Music acts that haven't really even been out that long at all, surely not long enough to warrant a Behind The Music. Just seems rather stupid to me. But Montage of Heck you can enjoy without being a fan of Kurt Cobain. This isn't only a film about the man in Nirvana, but also a pretty strong showing of what drugs will do to you. It does not matter how rich or famous you are, if you are a drug addict, you are equal to everyone else that is a drug addict as well. Being someone who has struggled with addiction in the past, I felt really connected with Kurt Cobain in this documentary. I know some people will say it was almost a little too much to watch him just crumble in front of your eyes as the movie progresses, but guess what, people need to see stuff like this. For too long has the world kind of hid their eyes from drug addiction. Just thinking it is a bunch of losers and down and out junkies who do nothing for society. When in reality, people of all races, sex, class, religion, rich, poor etc are affected by this. This is a great documentary that really takes you truly behind the scenes at one of the more mysterious figures in music. Yes, he is beloved to this day after committing suicide. But its amazing to watch a guy who pretty much had everything he could ever ask for. A family, money, fame, anything he could ever imagine, and he was just flat out miserable regardless of all of it, mostly do to his long time heroin addiction. I don't think Cobain is a musical genius by any means, but he's a polarizing personality and an innovative musician nonetheless. I just wish he would have truly committed to getting the help he needed because its clear as day that he was crying for help.",
    "rating": "40",
    "date": "December 1, 2015"
  }
,
  {
    "reviewer": "joe i",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/277300094/",
    "review": "  In a strange twisted vision to tell the story most music fans know, I think Cobain if still around would approve of the technique used by this film to tell his story.",
    "rating": "40",
    "date": "April 19, 2015"
  },
  {
    "reviewer": "Dustin G",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/785471593/",
    "review": "  My first memory of Nirvana was in early April, 1994. I was ten years old. I was at school and we had 'library time' with the kids in my class and class above ours. I came in and saw a group of kids sitting around one of those big, grey, rectangular tape decks with a pair of coil corded, oversized black headphones attached. They were all squeezed together listening to a tape one of them brought in. I came over and asked what was up. One of the older kids handed me the headphones and said 'this guy just blew his head off' (kids are great at exaggerating to induce shock effect). I put the headphones on and 'Smells Like Teen Spirit' was blaring out of them. I had never heard of Nirvana before, never heard the song before, but two seconds in I was hooked. As I grew older and became more educated on the whole Cobain legend, my fascination with this band, and this person in particular, was one of both awe, that someone could be so talented and write songs that were so good, and dark fascination at this person's train wreck of a life. And I wasn't alone. During his life, Cobain was a fascinating figure, for all the right and wrong reasons, and in his death, his legend firmly embedded in the annuls of rock and roll history, his dichotomy laden and troubled personality is part of one of the most interesting stories in popular music. Although there have been a number of doc's on Cobain and Nirvana and their music, Montage of Heck is the first 'authorized' examination of Cobain's life on film. This means his family has allowed maverick documentarian Brett Morgan total access to the Cobain archives, so to speak. And this film is chock full of audio clips, musical sound bites, televised interviews and home videos which attempt to bare all of Cobain in an attempt to better understand him. And it works, for the most part. His mother had the great foresight to compile hours upon hours of home videos of him from birth to stardom. His wife took over where his mother left off, compiling hours upon hours of home videos of him in the thick of his stardom. These are the most disturbing aspect of the film. More so than the twisted drawings and manic depressive ramblings in his notebooks, the wall of horror movie sound collages he compiled on tape recorders and the smear campaign of media reports that attempted to show the world he and his wife were little more than self destructive junkies, it's the home videos that create the biggest impact. Such as an impossibly skinny Kurt doting on his daughter, playing with her and making her laugh and lavishing love on her. And in another scene a few minutes later nodding out in a heroin daze with her on his lap while Courtney Love attempts to give her her first haircut, while admonishing him for being high in front of his daughter. You see, in these sad clips and the interviews he was doing and the skyrocketing success of the band and the exaggerated reports in the media, a man deteriorating in front of your eyes. It's difficult to watch. As we're led through Cobain's short life, a small group of people connected to him throughout give interviews. This includes his mother, his wife, his sister, an old girlfriend (the one he famously wrote 'About A Girl' for), his semi-estranged father and Krist Novaselic. There is no Dave Grohl. Some people have wondered about this and assumed, as the doc was done with the complete support and cooperation of Courtney Love, that Grohl didn't participate due to his (to say the least) difficult relationship with her over the years. In actuality, the reasoning is much less high school drama than that. This is a documentary about Cobain, not Nirvana, and Morgan wanted it to be a personal one with a small group of participants. And Novaselic was there with him from the beginning. So only one former Nirvana member was needed. Also, Grohl was apparently in the middle of a new Foo Fighters album and his own subsequent HBO doc so didn't initially have the time. That's about it. He did eventually give an interview which will probably end up as a bonus feature on the DVD/Blu-Ray release. Because there's a lot of audio and music clips in the film, Morgan had a talented team of animators come in to supplement it with a series of animations. They're well done and interesting, but also a little cheesy. What works much better is Morgan taking Kurt's doodles and comic strips and lyrics and journal entries and animating them to supplement the music and dialogue. It looks very cool and is very effective. I don't know that I would call Montage of Heck, as some people have, the best or most intimate rock bio ever. There are better ones. I would say though that it offers the most complete picture of who this complicated person was, warts and all. It doesn't give him a God complex or idolize him or present him as an avenging hero. If anything it's a good deterrent for people to stay the fuck away from heroin (as if they needed another) and to pity the people he left behind. It also makes you wonder why those around him didn't do more when he was so obviously self destructing before their eyes. As Novaselic says early in the film, with 20/20 hindsight, the warnings were all there for anyone to see. In his journals, in his drawings, in his demeanour, and most certainly in his songs. But too late is too late. A modern rock greek tragedy if there ever was one.",
    "rating": "45",
    "date": "December 20, 2015"
  },
  {
    "reviewer": "Tasha D",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/787112355/",
    "review": "  legende ne treba komentarisati!",
    "rating": "40",
    "date": "December 10, 2015"
  },
  {
    "reviewer": "Dillinger P",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/935411971/",
    "review": "  Hailed as the documentary that would give you the full story of Cobain's life, it's no surprise Montage of Heck not only cant quite deliver, it appears to be missing some essential moments and points of view, I wonder who's fault that could be... For those of you, and I cant believe I'm typing this, who arent aware of Kurt Cobain and his troubled past, his legacy and indeed the impact he had on a generation, Cobain managed to give the youth of the 90's a voice, his monolithic band Nirvana, broke boundries and walls to allow a sense of purpose and importance to a younger generation, who up until that point struggled with growing up, being socially accepted and having a voice. All this came at a price however, when the confines of his dark mind forced him to turn to heroin abuse, which resulted in the man taking his live. Oh and then there is all that Courtney Love conspiracy... Montage of Heck does manage to get some critical moments right, it characterizes Cobain perfectly through video, audio recordings, diary scribbles, art work and indeed a cartoonish style immalgimation of all of the above. It gives a heart gushingly real insight into Cobain, the man behind the ice cool exterior and it just about manages to make his legacy all the more appealing to a new generation. Where it drops the ball however, is not having quite enough contributors, most likely due to the tired nature of exposing Cobain's problems and having a second act that is clearly tampered with , steering the focus away from Cobain and more onto his equally troubled wife, Courtney Love. It's been reported that Love forced film makers to remove footage, how much of that was detrimental or indeed incriminating to whoever, we will never know, but the film clearly loses focus and trajectory the moment she steps into the frame, killing off any form of acceptable resolution. What ever you view points may be on the woman, she is every bit as important to Cobain's story as Nirvana, so her inclusion is needed, but documentaries need to sit on the fence, not be threatened by outside sources. There is a wonderful film in here somewhere, but it struggles with some basic premises that most other documentaries thrive upon. Watchable.",
    "rating": "35",
    "date": "January 11, 2016"
  },
  {
    "reviewer": "James B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/921455210/",
    "review": "  I listen to nirvana nearly everyday and if your to watch any doc. about kurt and nirvana it should be this one, drunk then sober.",
    "rating": "50",
    "date": "June 16, 2015"
  },
  {
    "reviewer": "Romeo H.",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/904380699/",
    "review": "  A compelling and refreshing take into the life of one of the biggest stars of the 90's, Montage of Heck is a mesmerizing, stylish and intimate portrait of the beloved rock star.",
    "rating": "45",
    "date": "December 31, 2015"
  },
  {
    "reviewer": "Nick D",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/845689761/",
    "review": "  Morgan builds his story from home movies, artwork, artifacts of all sorts culled from the vaults and the personal collections of family members, including long-lost audiotapes, which are illustrated with dreamlike animations. It's a heckuva way to tell the story.",
    "rating": "35",
    "date": "December 29, 2015"
  },
  {
    "reviewer": "Rick C",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/935154143/",
    "review": "  Truly a sad look at an icon. You can't come away from watching it without thinking what a messed up, confused man, but above all think about what could have been.",
    "rating": "35",
    "date": "December 27, 2015"
  },
  {
    "reviewer": "Wesley H",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/968293545/",
    "review": "  Don't take the title lightly. Out of the many flavors of Cobain docs, this is the most pivotal as it explores the dark worlds of depression, addiction, anxiety, and fame. Morgen's melding of Cobain's journals and art traps us in the mind of a generation's savior - a savior that that generation never understood.",
    "rating": "45",
    "date": "December 15, 2015"
  },
  {
    "reviewer": "Yenyen D",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/859108331/",
    "review": "  you gotta live long enough to learn how to live.",
    "rating": "35",
    "date": "November 20, 2015"
  },
  {
    "reviewer": "Andrew B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/972353228/",
    "review": "  I will start off by saying, you don't have to be a huge Nirvana fan to appreciate this documentary. I for one am a fan of NIrvana and Kurt Cobain, not a fanatic like some people who grew up in the 90s, but I did enjoy their music. Personally I am more of a metal fan loving bands like Pantera, Kreator, and Slayer. I always respected Nirvana, because even though their music was pretty simple and most of the songs just use the same chords and a lot of distortion, they helped rid the universe of moronic \"hair metal\" and \"glam metal\" bands. Bands like Poison and Warrant with their cheesy rock ballads in the 80s were so ready to be gone, they just needed a little push, and Nirvana gave them that push. And behind Nirvana came good bands like Pearl Jam, Smashing Pumpkins, Stone Temple Pilots etc... It was kind of an explosion of everything anti-hair metal. No longer was it clubs on the sunset strip with bands dressing up like women and fans of those bands also dressing up like women, wearing lipstick and putting a lot of hairspray in their hair, honestly it was disgraceful and one of the worst trends that music ever went through in my opinion. So to see it be destroyed by Nirvana and Kurt Cobain was a beautiful thing to me. It was now dress however you want, and let out all the aggression you have inside your body. But on to the documentary. Music documentaries are really hit or miss, it is rare that you are going to see a music documentary that you will enjoy if you are not a fan of the subject the movie is about. VH1's Behind The Music series was pretty good for a little bit when it first started out, doing short mini documentaries on musicians, but even now they are horrible. I saw a Behind the Music on the likes of 50 Cent, Pink and Neyo. Music acts that haven't really even been out that long at all, surely not long enough to warrant a Behind The Music. Just seems rather stupid to me. But Montage of Heck you can enjoy without being a fan of Kurt Cobain. This isn't only a film about the man in Nirvana, but also a pretty strong showing of what drugs will do to you. It does not matter how rich or famous you are, if you are a drug addict, you are equal to everyone else that is a drug addict as well. Being someone who has struggled with addiction in the past, I felt really connected with Kurt Cobain in this documentary. I know some people will say it was almost a little too much to watch him just crumble in front of your eyes as the movie progresses, but guess what, people need to see stuff like this. For too long has the world kind of hid their eyes from drug addiction. Just thinking it is a bunch of losers and down and out junkies who do nothing for society. When in reality, people of all races, sex, class, religion, rich, poor etc are affected by this. This is a great documentary that really takes you truly behind the scenes at one of the more mysterious figures in music. Yes, he is beloved to this day after committing suicide. But its amazing to watch a guy who pretty much had everything he could ever ask for. A family, money, fame, anything he could ever imagine, and he was just flat out miserable regardless of all of it, mostly do to his long time heroin addiction. I don't think Cobain is a musical genius by any means, but he's a polarizing personality and an innovative musician nonetheless. I just wish he would have truly committed to getting the help he needed because its clear as day that he was crying for help.",
    "rating": "50",
    "date": "December 3, 2015"
  },
  {
    "reviewer": "Andrew B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/910183655/",
    "review": "  I will start off by saying, you don't have to be a huge Nirvana fan to appreciate this documentary. I for one am a fan of NIrvana and Kurt Cobain, not a fanatic like some people who grew up in the 90s, but I did enjoy their music. Personally I am more of a metal fan loving bands like Pantera, Kreator, and Slayer. I always respected Nirvana, because even though their music was pretty simple and most of the songs just use the same chords and a lot of distortion, they helped rid the universe of moronic \"hair metal\" and \"glam metal\" bands. Bands like Poison and Warrant with their cheesy rock ballads in the 80s were so ready to be gone, they just needed a little push, and Nirvana gave them that push. And behind Nirvana came good bands like Pearl Jam, Smashing Pumpkins, Stone Temple Pilots etc... It was kind of an explosion of everything anti-hair metal. No longer was it clubs on the sunset strip with bands dressing up like women and fans of those bands also dressing up like women, wearing lipstick and putting a lot of hairspray in their hair, honestly it was disgraceful and one of the worst trends that music ever went through in my opinion. So to see it be destroyed by Nirvana and Kurt Cobain was a beautiful thing to me. It was now dress however you want, and let out all the aggression you have inside your body. But on to the documentary. Music documentaries are really hit or miss, it is rare that you are going to see a music documentary that you will enjoy if you are not a fan of the subject the movie is about. VH1's Behind The Music series was pretty good for a little bit when it first started out, doing short mini documentaries on musicians, but even now they are horrible. I saw a Behind the Music on the likes of 50 Cent, Pink and Neyo. Music acts that haven't really even been out that long at all, surely not long enough to warrant a Behind The Music. Just seems rather stupid to me. But Montage of Heck you can enjoy without being a fan of Kurt Cobain. This isn't only a film about the man in Nirvana, but also a pretty strong showing of what drugs will do to you. It does not matter how rich or famous you are, if you are a drug addict, you are equal to everyone else that is a drug addict as well. Being someone who has struggled with addiction in the past, I felt really connected with Kurt Cobain in this documentary. I know some people will say it was almost a little too much to watch him just crumble in front of your eyes as the movie progresses, but guess what, people need to see stuff like this. For too long has the world kind of hid their eyes from drug addiction. Just thinking it is a bunch of losers and down and out junkies who do nothing for society. When in reality, people of all races, sex, class, religion, rich, poor etc are affected by this. This is a great documentary that really takes you truly behind the scenes at one of the more mysterious figures in music. Yes, he is beloved to this day after committing suicide. But its amazing to watch a guy who pretty much had everything he could ever ask for. A family, money, fame, anything he could ever imagine, and he was just flat out miserable regardless of all of it, mostly do to his long time heroin addiction. I don't think Cobain is a musical genius by any means, but he's a polarizing personality and an innovative musician nonetheless. I just wish he would have truly committed to getting the help he needed because its clear as day that he was crying for help.",
    "rating": "40",
    "date": "December 1, 2015"
  },
  {
    "reviewer": "Dan M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/953045622/",
    "review": "  Really entertaining doc on one of my early childhood heroes. There are some nice audio clips and well done art direction to make this enjoyable for veteran fans of Nirvana as well as curious viewers. It doesn't close any cases as far as his untimely death goes but it sheds some light on his life from the faces of many of the people who were closest to him.",
    "rating": "50",
    "date": "November 29, 2015"
  },
  {
    "reviewer": "Brent S",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/783938016/",
    "review": "  Other than the unnecessary Courtney Love nudity this was very entertaining and well done.",
    "rating": "40",
    "date": "November 28, 2015"
  },
  {
    "reviewer": "Michal Z",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/970014708/",
    "review": "  Stunning animations and editing tricks weave together a story of a disturbed beautiful mind. It's a bag of emotions, intimate life moments captured on VHS and riveting performances with little narration.",
    "rating": "35",
    "date": "May 5, 2015"
  },
  {
    "reviewer": "Andriy M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/906527365/",
    "review": "  Very interesting. But it revived suicidal thoughts in me...",
    "rating": "45",
    "date": "November 26, 2015"
  },
  {
    "reviewer": "Biljana M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/802535532/",
    "review": "  I'm truly surprised with these 97%. It's highly produced set of family movies... and like all family movies, they are boring. And for periods that they didn't have a family movie it looks like they made stuff up. I can't call this a documentary. It resonates like a student movie. This one star is for the music, because Nirvana was awesome.",
    "rating": "10",
    "date": "November 24, 2015"
  },
  {
    "reviewer": "Andrew D",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/972186180/",
    "review": "  Demasiado bueno este documentar de Kurt Cobain. Lastima que Dave Ghrol no haya querido participar. Es lo unico que le falta...",
    "rating": "45",
    "date": "November 22, 2015"
  },
  {
    "reviewer": "Blake P",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/909783806/",
    "review": "  After viewing \"Kurt Cobain: Montage of Heck,\" you may find yourself hesitant to refer to its titular rock icon as the Godfather of Grunge, the Voice of the '90s, or any other title that might further his status as a figure of generational idolization. Unflinching and uncompromising in its unyielding determination to unveil the hidden psychology of Kurt Cobain, gone is the tepid characteristic of most rockumentaries that continue worship and ignore humanity. I suspect that it might come as an overwhelming shock to Cobain's biggest admirers; you won't be much hearing about MTV success, critical acclaim, the untouchable gauze of his influence. You will, instead, live through the interludes of his emotionally tumultuous childhood, his drug-addicted, oft miserable journey into fame, and his clamorous marriage to the self-obsessed Courtney Love. Directed by Brett Morgen with unorthodox enterprise, \"Montage of Heck\" utilizes the documentary staple that is the one-on-one interview (featuring appearances from Krist Novoselic, Love, his parents, his stepmother, and his pre-fame girlfriend), but is much more reliant on found-footage, rare pre-recorded monologues by Cobain himself, and heterodox animation that both illustrates situations not caught on camera and brings the latter's drawings and writings to life. You really feel as though you standing next to the man himself, consuming his neuroses, understanding of but never able to help heal his most personal demons.  Such idealization has swept the sidelines of Cobain's persona that it makes me like \"Montage of Heck\" all the more. I've always been a fan of the era defining music of Nirvana, but there hasn't been a second of my enjoyment during which I haven't been wary of his still infatuated circle of fans, who irritatingly romanticize every single detail of his life, who hate Courtney more than they hate Yoko, who act like he was a saint when he was, in fact, a damaged human who needed to be viewed as one but never necessarily was. Because \"Montage of Heck\" is so disinterested in broadening the girth of \"Rolling Stone\" level materialism, the effect is remarkable - we thought we had him mostly figured out. Not so. Anyone with an eye for pop culture knows of his lengthy heroin use and his longtime battles with depression, but the film gives us an inside look into these facts with haunting truth. Home videos depict Kurt and Courtney's frightening marriage, characterized within a crumbling apartment, with antics thoroughly drug-fueled; Morgen's spotlight on Cobain's private journals portray him as a man in touch with himself but also as a man ultra-sensitive to criticism, to success, to his emotions. \"Montage of Heck\" sheds more light onto what destroyed Cobain, not what audiences perceive his psyche as, and it's tenacious. You won't find a better documentary this year, perhaps only rivaled by \"Amy,\" who similarly took an immensely talented musician's tragedy and made it into an unromanticized vision. Cobain's biggest fans will be left broken, his sporadic ones, such as me, shaken. \"Montage of Heck\" is extraordinary.",
    "rating": "40",
    "date": "November 20, 2015"
  },
  {
    "reviewer": "Maarten R",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/933533359/",
    "review": "  The story you already knew, but now with animated album covers.",
    "rating": "30",
    "date": "November 20, 2015"
  }
,
  {
    "reviewer": "Lucie K",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/800093182/",
    "review": "  Love Kurt and this shows a different never seen before side of him.",
    "rating": "50",
    "date": "November 13, 2015"
  },
  {
    "reviewer": "John B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/782114803/",
    "review": "  I often treat it as a moment of embarrassment that Kurt Cobain remains such a symbol of my Generation. A brilliant musician and a terribly strange messed up human being. Despite its subject, the documentary is one of most well crafted that I have seen in ages.",
    "rating": "40",
    "date": "April 24, 2015"
  },
  {
    "reviewer": "Edmund P",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/788502108/",
    "review": "  Documentary of the year for me, and currently in my top two for 2015 (sorry Mad Max but this film, BY GOD THIS FILM)",
    "rating": "50",
    "date": "November 12, 2015"
  },
  {
    "reviewer": "Mike P",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/618089820/",
    "review": "  Having a difficult time watching this documentary all the way through. It's someone's shoes that I would hate to be in. It's quite sad. Clearly he was never ready for this (as his mother pointed out).",
    "rating": "25",
    "date": "November 12, 2015"
  },
  {
    "reviewer": "Curt G",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/933576599/",
    "review": "  Another dead druggie, another good day. Horrible film.",
    "rating": "05",
    "date": "November 10, 2015"
  },
  {
    "reviewer": "Private U",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/782775535/",
    "review": "  Brett Morgen succeeds at taking away the pedestal while not taking away focus from the brilliance of a talented, loved but still human Cobain.",
    "rating": "50",
    "date": "November 1, 2015"
  },
  {
    "reviewer": "MF J",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/798574442/",
    "review": "  Brett Morgan has crafted a beautiful and very artistic documentary far from the previously seen material that tended to always indulge into the mystic drama and tabloid headlines of sex, drug and rock' N' Roll. Here we discover a more human side to the man, his wife and his accomplices in the band. We realize that he was only a kid who came from nowhere, got propelled to the highest summits and got crashed and burned by fame without truly understanding what was happening. Weather you like the music or not, the documentary gives a new interpretation of a popular phenomenon that shook the 90's. Immensely researched and superbly edited, the film is a lesson on documentary film making. Fresh, modern, thoughtful and respectful, it finally humanize a myth and brings it back to a more human scale.... Maybe that's all it needed after all, simplicity, respect and love.",
    "rating": "35",
    "date": "April 18, 2015"
  },
  {
    "reviewer": "Rob G",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/967476166/",
    "review": "  I was highly skeptical that this wasn't just going to be more of the same, praising Kurt or feeling sorry for Kurt or whatever the status quo seems to be these days. It was more so an awesome look at footage most have never seen with a real artistic flare of the FUCKAF why am i trying to sound smart?? it was GOOD",
    "rating": "50",
    "date": "October 19, 2015"
  },
  {
    "reviewer": "Brad S",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/783623907/",
    "review": "  A pretty interesting documentary on Cobain which has lots of family footage and his journals, and family interviews which helps to paint a more full portrait of him. Worthwhile for fans of his music.",
    "rating": "35",
    "date": "October 18, 2015"
  },
  {
    "reviewer": "Tiago C",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/939408327/",
    "review": "  Document�rio feito com desenhos, di�rios, escritas, v�deos e �udios de Kurt. A edi��o � espetacular. Alguns desenhos ganharam anima��o, assim como hist�ria contadas pelo pr�prio Kurt. Edi��o fant�stica.",
    "rating": "40",
    "date": "October 5, 2015"
  },
  {
    "reviewer": "In 3 lines or less",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/971384179/",
    "review": "  Cobain documentary makes fame a living hell inside a living cell called obscurity and ridicule. Which will rule? Grunge music, or brain drilling commodity pushing. Sadly, the end came to both at just the right moment in history.",
    "rating": "35",
    "date": "September 24, 2015"
  },
  {
    "reviewer": "Prentice S",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/971171868/",
    "review": "  As a kid that grew up in the 90's and worshiped grunge retroactively, Kurt Cobain was a personal hero of mine. \"Nevermind,\" \"In Utero,\" and Nirvana's MTV Unplugged show were classic albums to me: they helped shape my musical upbringing. Brett Morgen's \"Montage of Heck\" is the best representation of Cobain's life that I have yet to see in any form, be it film or book. \"Montage of Heck\" is largely so good because it uses so much unused footage from Cobain's childhood and his years of fame. For those scenes that weren't filmed, Morgen utilizes the private diaries of the Nirvana front man and in some cases, he even creates cartoons to re-enact events from those diaries. The soundtrack is just as original: he finds broken down demos of classic Nirvana songs, like \"All Apologies\" and \"About a Girl\" and incorporates them beautifully. Scenes of Nirvana performing, of Kurt at home with Courtney and Frances Bean, are truly heartbreaking and, above all, human. Kurt Cobain was a flawed man, unable to deal with the fame he gained virtually overnight. \"Montage of Heck\" beautifully captures the life of one of music's greatest heroes and I'd be surprised if we don't see this film again when January rolls around.",
    "rating": "40",
    "date": "September 20, 2015"
  },
  {
    "reviewer": "Emma W",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/823508814/",
    "review": "  Overly long and incredibly strange in parts, only watch if you are a Cobain fan. Made me dislike him more and wonder why I wasted my time watching until the end.",
    "rating": "20",
    "date": "September 14, 2015"
  },
  {
    "reviewer": "toejambaseball24",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/782541711/",
    "review": "  A fascinating chronicle of a troubled music icon.",
    "rating": "35",
    "date": "September 10, 2015"
  },
  {
    "reviewer": "Carey C",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/771099782/",
    "review": "  The fact of the matter is, the people who absolutely hate this film either #1: do not like Kurt Cobain and/or Nirvana or #2: are super fans who want Kurt exalted and not humanized and think they know him best because they identified with him or listened to his music. After watching the film and learning of the developmental issues he had starting when he was a toddler, my personal opinion is that he suffered from mental illness; his mother even mentions that the pediatrician told them they were in for trouble after looking into his eyes with a flashlight (I suspect something to the effect of Aspergers, Autism, severe ADHD, clinical depression) although they never expand on what the doctor's diagnosis was, except that his mother was to give him prescription pills that seemed to worsen the condition. Keep in mind, he was a child of the 60's/70's when mental illness was more taboo and certain conditions had not even been discovered yet, so essentially he was labeled as being an over active or \"bad\" kid when in actuality, he needed and would likely have benefitted from professional help. This I feel sets the tone for the remainder of the film and sheds light into his eventual and tragic demise. It is clear that the longer his condition went untreated, the more exacerbated his behaviors became (violent dreams, journal entries and drawings), leading him to self-medicate with pot and eventually heroin to fight the demons inside - making it obvious that he wasn't just some druggie to be accepted by the \"cool\" kids, but that it was the only way he knew how to silence his erratic brain activity. The film shows the many sides of Kurt Cobain: charismatic/funny, insecure, self-loathing, loving, disturbed, artistic, sad, hopeful - proving that there were many intricate components to this rock legend who I feel is too often simplified. I think the most disheartening aspect of the movie is you get the sense through his journal entries that he really did want to be a better person, especially once Francis was born; but alas, his inner demons got the best of him. Ultimately, my husband and I left the theater with a greater appreciation of Kurt Cobain and his tumultuous life. In the end, it doesn't matter what any of us think - Francis Cobain stated that this was the movie she was hoping for, and since she is his daughter, I would say rightfully that if she is accepting of the film, then we should be too.",
    "rating": "50",
    "date": "September 2, 2015"
  },
  {
    "reviewer": "Tyler R",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/926167322/",
    "review": "  I've seen a ton of Cobain docs but this is by far the best. the animation combined with the style of how this documentary was shot is fantastic.",
    "rating": "50",
    "date": "August 27, 2015"
  },
  {
    "reviewer": "Barry T",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/795283715/",
    "review": "  Equally disturbing equally excellent this was a must see doc. Some parts especially when he meets Love and they have a baby are sickening but showing these home vids is a brave choice. Not sure what we really learn but along with Amy this is a superb doc.",
    "rating": "45",
    "date": "August 16, 2015"
  },
  {
    "reviewer": "Jake C",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/970997801/",
    "review": "  Kurt Cobain: Montage of Heck (2015) has the distinction of being the first Kurt Cobain documentary made with the cooperation of the Cobain family (Cobain's daughter, widow, and mother). This film stays away from any of the conspiracies or conjecture swirling around Cobain's suicide. To convey the narrative and prevent any one talking head's point of view to dominate the narrative the filmmakers rely largely on home videos, Kurt's own artwork, notebooks, and journals some dating back to Kurt Cobain's early childhood. Lucky for the film maker it appears Kurt Cobain's mother kept all his childhood art projects. This choice gives you some very personal insight into the doc's subject and allows the director/writer Brett Morgen to not make a traditional biography or an over glorified Behind the Music. The film has a sense of honesty and candor that is exemplified in the scenes taken from home videos of Kurt Cobain and his wife bathing their baby daughter. Mr. Morgen doesn't fill in the blanks of Kurt's life with theory and postulation or give rationalizations or explanations for actions. The films real trick is making you feel satisfied you've been told a complete narrative despite the shadowy ambiguous areas. Morgen's access to archived material and use of journals and artwork is ingenious because it allows the deceased to tell us his own tale posthumously through his artistic expression. The film uses several interview clips where Kurt himself tells the viewer, \"The art speaks for itself\". Noticeably missing from the documentary is former Nirvana drummer Dave Grohl. Mr. Grohl's absence is ever more conspicuous due to his former band mate Krist Novoselic compelling and charismatic interview intercut and used throughout the film. The movie doesn't attempt to fill in the blanks nor should it. The film is less about the facts and figures of Cobain's life but how those events made him feel and how it influenced his art. Kurt Cobain: Montage of Heck (2015) is a fantastic example of a narrative that shows rather than tells through amazing access to Kurt Cobain's art work and archives. If you're in the mood for a documentary with interesting storytelling choices and devices or a music fan you'll enjoy this film.",
    "rating": "40",
    "date": "August 15, 2015"
  },
  {
    "reviewer": "Jeff C",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/645118333/",
    "review": "  Critically Acclaimed documentary that I thought was boring and confusing. There are some good tidbits in there about Cobain, but it feels disorganized",
    "rating": "20",
    "date": "April 22, 2015"
  }
,
  {
    "reviewer": "Marina A",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/782081317/",
    "review": "  Interesting and though the videos, audio and other materials from the Cobain family certainly provide great insight into the mind of a complicated artist, I didn't love it. The quality of the animation is all over the map and though I love the concept, the execution doesn't fully work. Solid and a must for fans but I'm not sure we've seen the ultimate Cobain documentary yet.",
    "rating": "30",
    "date": "August 7, 2015"
  },
  {
    "reviewer": "Bruno S",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/940069312/",
    "review": "  Vacilando entre uma narrativa cansativa e o vergonhoso desespero em estampar Courtney como uma mulher \"de bem\" fazem \"Montage...\" derrapar. Ainda assim, as imagens de arquivo valem a pena.",
    "rating": "30",
    "date": "August 4, 2015"
  },
  {
    "reviewer": "Rodrigo H",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/793922922/",
    "review": "  La primera mitad me tenia mas entusiasmado que la segunda. Igual en dos horas no es posible entender lo mal que estaba Cobain. Recomiendo a cualquier seguidor del grupo.",
    "rating": "35",
    "date": "August 1, 2015"
  },
  {
    "reviewer": "Anwar V",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/874435369/",
    "review": "  El rechazo y las drogas. Mala combinaci�n.",
    "rating": "35",
    "date": "July 30, 2015"
  },
  {
    "reviewer": "Ramiro G",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/962205959/",
    "review": "  Full of unreleased music, art and tapes from the Nirvana lead with a perfect pace that makes perfect use of the group songs, Montage of Heck is the definitive Kurt Cobain documentary that will satisfy fans of the musician and someone looking for a good documentary all the same",
    "rating": "50",
    "date": "July 26, 2015"
  },
  {
    "reviewer": "Matt G",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/906794753/",
    "review": "  The only way to say something new about Kurt Cobain is to say it in a new way. You know the innovative bits in The Devil and Daniel Johnston, when his artwork comes to life, giving us a glimpse into the mind of a tortured genius? Montage of Heck is like that, but for 2+hrs. It can definitely be depressing to spend that amount of time in Cobain's mind, but it's also fascinating to witness such honesty in art. A succinct and fully comprehensive look at a complex and troubled man's life.",
    "rating": "40",
    "date": "July 25, 2015"
  },
  {
    "reviewer": "Lee Anne W",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/848864990/",
    "review": "  Well done, artsy-fartsy (in a good way) doc about Kurt Cobain. It made me wistful for my youth, when every weekend I saw a million bands (including Nirvana) that sounded like this, sad for the bottomless pit of need and pain that was KC, grossed out by the pimply, nude KurtandCourtney show, worried for the kitten and baby Frances Bean that they would suffer \"Trainspotting\" fates.Notably absent: Dave Grohl. I'm pretty sure he's a bit of an ass now.",
    "rating": "40",
    "date": "July 24, 2015"
  },
  {
    "reviewer": "John C",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/880252311/",
    "review": "  Very interesting perspective into a very troubled yet intensely creative mind. If you are into the Law of Attraction this is an extremely enlightening perspective into the dark side.",
    "rating": "40",
    "date": "July 19, 2015"
  },
  {
    "reviewer": "Jeremy E",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/915362509/",
    "review": "  An incredible film conveying the aspects of not only a rock icon, but of a truly troubled man who was crying for help. Not often does a documentary this original and this artistic, all while sticking to the point, come around. My only gripe is that this piece almost never shows the dark side of Courtney which is undeniable.",
    "rating": "45",
    "date": "May 10, 2015"
  },
  {
    "reviewer": "Abdulkadir N",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/804294370/",
    "review": "  Best rockumentary of 2015., for Nirvana fans.",
    "rating": "35",
    "date": "July 14, 2015"
  },
  {
    "reviewer": "Private U",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/796223125/",
    "review": "  An amazing film that draws together raw footage, animation and interviews to build an intimate portrait of Cobain. Must see.",
    "rating": "40",
    "date": "July 11, 2015"
  },
  {
    "reviewer": "jamieadamson1",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/950822656/",
    "review": "  Lots of material but poorly edited",
    "rating": "30",
    "date": "May 5, 2015"
  },
  {
    "reviewer": "Sandeep N",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/813572273/",
    "review": "  The phrase to be used is \"Hypochondria of the Heart\" when you fall prey for nostalgia but just how fleeting. The story of \"Kobain - the spokesperson of a disaffected generation\" still feels significant as always. Try not to lose your mind to the grunge, Try not to have heart ache for the scribed, Try not to keep the sobs from raising your throat. So buckle up for Montage of Heck!",
    "rating": "40",
    "date": "July 7, 2015"
  },
  {
    "reviewer": "Lesley R",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/962304077/",
    "review": "  Really enjoyed this, seeing all the home footage, and the way they mixed on his writing and art. Well done and shows more insight into who he really was.",
    "rating": "50",
    "date": "July 5, 2015"
  },
  {
    "reviewer": "Riff R",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/964308306/",
    "review": "  Surprisingly good; beautifully crafted.",
    "rating": "45",
    "date": "July 5, 2015"
  },
  {
    "reviewer": "Rob H",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/970743641/",
    "review": "  Not only the best music based documentary I have ever seen, but one of the best documentary films I have seen, period.",
    "rating": "50",
    "date": "July 4, 2015"
  },
  {
    "reviewer": "Cody M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/842424632/",
    "review": "  An amazing look at Kurt Cobain's life and legacy.",
    "rating": "50",
    "date": "July 4, 2015"
  },
  {
    "reviewer": "Adam R",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/898375055/",
    "review": "  A unique music documentary that even casual Nirvana fans should enjoy. The animated sequences were pretty cool. And the music was spot-on for once, as these kind of movies often don't end up using applicable songs. I am mostly out of the grunge phase in my life and would have enjoyed this more in my teen years, but it was nice to revisit an old interest. (First and only viewing - 5/16/2015)",
    "rating": "35",
    "date": "May 9, 2015"
  },
  {
    "reviewer": "Ally L",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/801679797/",
    "review": "  I watched this over the weekend, and I still can't shake it. It's really tough to watch, but it's a very good documentary. I was alternately anxious, angry, sad, and many other emotions while watching. The amount of footage, drawings, etc are impressive, and makes it stand out amongst a standard rock doc. But man...can't shake it. It's really staying with me.",
    "rating": "45",
    "date": "June 30, 2015"
  },
  {
    "reviewer": "Luis P",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/906529970/",
    "review": "  Many Kurt Cobain documentaries have come and gone, and some might argue that there is nothing more to be said about the grunge godfather that took his own life when the walls seemed to be closing in. But I beg to differ. Kurt the musician has been demystified time and time again, but Kurt the human being has never seemed so tangible as he does in this masterful documentary. With never-before-seen footage and access to the people closest to him such as Courtney Love and his parents, this film paints an empathetic portrait of a man who would define Generation X without ever wanting to. Super 8 home footage of him and his beau's tomfooleries at home really serve to paint him as the doting husband and loving father that he really was (trying to be). Some of the most effective scenes are animated recreations of certain pivotal moments where Kurt himself serves as narrator. They reallt don't make docs like this anymore, and it would be a disservice to the lasting impact of his music and singular voice if you didn't give this doc a chance! Masterpiece.",
    "rating": "50",
    "date": "June 28, 2015"
  }
,
  {
    "reviewer": "Gavin P",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/797827800/",
    "review": "  A very in-depth look into Cobain's life - including ~25min of childhood & teenage years, that you don't hear about too often. It's a hard story to tell, since we all know there's no happy ending and it really is Nirvana's music that truly defines him. I guess it's just a little annoying that there's not more interview footage of him (due to his stubbornness/anxiety) and we have to rely on Love's home videos, which are intimate, but don't really show either of them in the best light (except when she's trying to get as many shots of her breasts in as possible, trying to show how 'hot' she once was). Because of Love's control of the film, there's unfortunately only Grohl (& Smear) in archive footage, which is a major shame, since he would no doubt have plenty to say on the matter, and probably more articulately than Novoselic. Good, but nothing too new or shocking.",
    "rating": "30",
    "date": "June 26, 2015"
  },
  {
    "reviewer": "Sean L",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/793676809/",
    "review": "  An uncomfortably close look at the private life of Kurt Cobain, short-term rock superstar and unwilling voice of a disgruntled generation. In the decades since his untimely suicide, Cobain's become an almost mythical figure, which isn't to say he was anything less at the height of his mid-90s popularity. To that end, it can be useful to ground his legacy in this way: intimate home video footage shows him unguarded behind closed doors, but also captures his steady state of mental decay. Where there's a gap in his video history between childhood (and it's heartbreaking to watch this happy little boy, knowing what tragedies his life held in store) and early adulthood, journal entries, artwork and beautiful animated segments keep the narrative moving. Clearly he was hanging on by a thread for longer than most could manage, pushed into a pit of despair by a bleak combination of abandonment, physical frailty, intense media scrutiny and constant, desperate drug abuse. It's not the Cobain many of us might want to see, or to believe in, but it feels so close to the truth that I could almost feel his breath on me. As an extreme close-up on one of my era's biggest names it's significant, with a killer soundtrack of course, and unexpectedly real. It frequently feels invasive, though, especially in the interviews with his parents (his stepmother's continuous, awkward smile is particularly unnerving) and I'm not sure I'm totally okay with the way it made me feel. Powerful in many good, and many bad, ways.",
    "rating": "35",
    "date": "June 25, 2015"
  },
  {
    "reviewer": "Giordano G",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/906213740/",
    "review": "  Sens�vel, humano, nada hagiogr�fico, nada apelativo, bem ilustrado, nunca � chato, bem pesquisado, com foco e direcionamento espec�fico. Enfim... um document�rio biogr�fico perfeito. Thumbs up, Brett Morgen.",
    "rating": "50",
    "date": "June 23, 2015"
  },
  {
    "reviewer": "Oscar G",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/897629591/",
    "review": "  Un retrato extraordinario y profundo de un �cono del siglo XX. Un trabajo impecable de investigaci�n, y una propuesta visual extraordinaria. Este documental es un vistazo a las profundidades de un genio, sin raspar en lo morboso, como s� lo hace en lo humano.",
    "rating": "45",
    "date": "June 23, 2015"
  },
  {
    "reviewer": "Connor G",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/848376327/",
    "review": "  I was disappointed. It is exactly what the title says, a montage. The director seems to want to portray Cobain's mind as chaotic, which it likely was. He leaves out most of the events that lead up to Cobain's suicide and abruptly ends with the overdose in Rome. There is no mention of the You Know You're Right recording sessions and honestly very little mention of In Utero. Anything you get from this film can be received by purchasing Cobain's published diaries. You may be better off purchasing the diary because it offer more for the reader to interpret rather than seeing things through the eyes of this director. There are large holes in the plot of this film. It is far from a comprehensive look into the life of an artist. It is the approved version. It is only what certain parties want you to see.",
    "rating": "30",
    "date": "June 22, 2015"
  },
  {
    "reviewer": "Brian N",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/806693106/",
    "review": "  While it was a decent documentary, and I know a lot of people really enjoyed it, I am going to be honest, I was bored a lot. I have always loved Nirvana, Nevermind hit my freshman year in high school and was an album I listened to over and over and over. There were a few new aspects about Kurt I wasn't aware of, it was good to see the old footage, but they could have cut a good hour of animation out to make it a shorter and better film. I am also at a loss to why Dave Grohl was not interviewed. Some of the best parts of the film were listening to Krist Novoselic. I would have liked to hear from Grohl as well. I also feel they didn't show the dynamic of Kurt's relationships with people, especially with Courtney Love. I feel they left out a big part of the story because they didn't want to create or discuss controversies. All and all, worth a watch.",
    "rating": "25",
    "date": "June 21, 2015"
  },
  {
    "reviewer": "John T",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/785233910/",
    "review": "  Really good documentary. This showed his whole life along with audio tapes of him and video footage and diary entries. You start to understand a little more about why he was the way he was.",
    "rating": "35",
    "date": "June 20, 2015"
  },
  {
    "reviewer": "Elizabeth H",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/782403467/",
    "review": "  Fascinating but sad.",
    "rating": "35",
    "date": "June 19, 2015"
  },
  {
    "reviewer": "Annie K",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/857152521/",
    "review": "  Certainly doesn't glorify Cobain but rather tells an intimate story of who he really was. Excellent.",
    "rating": "50",
    "date": "June 16, 2015"
  },
  {
    "reviewer": "Fran&#xFFFD;ois M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/780573751/",
    "review": "  Il y des manques. L'absence de Grohl entre autre chose... Mais il y a la musique. L'univers perturb� et perturbant de Cobain dans un montage d�lirant. Il �tait essentiel de faire les choses comme Morgen l'a fait.",
    "rating": "40",
    "date": "June 16, 2015"
  },
  {
    "reviewer": "Jimmy H",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/897910848/",
    "review": "  90 minutes of psychedelic hero worship followed by a half hour D.A.R.E. ad.",
    "rating": "15",
    "date": "June 14, 2015"
  },
  {
    "reviewer": "Eduardo B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/907446744/",
    "review": "  Well put together, very entertaining, but it's very clear that the Director takes Courtney's version of the story and avoids all the tough questions. The whole conundrum of them losing custody of Frances for a while and how Courtney was \"misbehaving\" in the final years is not even mentioned.",
    "rating": "40",
    "date": "June 14, 2015"
  },
  {
    "reviewer": "Martin P",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/807795242/",
    "review": "  20 years on does seem a long time to wait, but the film goes into detail of Kurt Cobain's short life including his troubled childhood and teenage years. A must for any Nirvana fans.",
    "rating": "30",
    "date": "June 14, 2015"
  },
  {
    "reviewer": "Kallie S",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/802309113/",
    "review": "  Before accusations began flying, I took the facts in this film with a grain of salt. The issue with making a documentary about a deceased person is that facts often become bent or twisted, or things get left out. Despite the fact dilemma, I found the documentary to be very well done. A great combination of video, and audio from the life of Cobain, along with journal entries, drawings and animated clips. Very well done.",
    "rating": "45",
    "date": "May 30, 2015"
  },
  {
    "reviewer": "Pete T",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/784317500/",
    "review": "  Very intimate and personal doc using archival home video and scribbled diary notes. The biggest flaw is that Dave Grohl is all but ignored as well as the 4th member of the band, Pat Smear. I found myself getting very frustrated with Cobain all over again. This one can be added to the list of best rock documentaries ever made.",
    "rating": "40",
    "date": "June 12, 2015"
  },
  {
    "reviewer": "Miguel A",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/906710148/",
    "review": "  Para quem j� conhece a hist�ria de Kurt Cobain e dos Nirvana, \"Montage of Heck\" n�o vai revelar muito mais al�m do que j� foi dito e escrito mil vezes. As grandes revela��es do document�rio n�o est�o na perspectiva supostamente intimista de Brett Morgen, mas na quantidade enorme de v�deos caseiros que poucos conheciam at� aqui. Isso faz com que, a partir do momento em que Kurt e Courtney se aproximam, \"Montage of Heck\" n�o seja assim t�o diferente da tape de Tommy Lee com Pamela Anderson, ainda que sem sexo. S�o duas pessoas apaixonadas e filmadas durante momentos que em princ�pio n�o deveriam ser violados pelo voyeurismo do restante mundo. Ao revelar tanto da vida familiar de Cobain, Brett Morgen n�o podia estar mais perto de perpetuar a \"viola��o de privacidade\" de que o l�der dos Nirvana se queixa tanto nos di�rios. Tiro no p�, claro. Tamb�m n�o se entende o porqu� de recuperar uma vez mais o artigo da Vanity Fair, quando o que l� vem escrito � s� lixo para chocar as dondocas da Am�rica. \"Montage of Heck\" � portanto t�o contradit�rio quanto poss�vel enquanto document�rio feito � imagem de Kurt Cobain. A maior heran�a do homem est�, como todos j� deviam saber, na m�sica que deixou gravada e n�o no seu rasto biogr�fico. Uma nota final: as anima��es funcionam para preencher alguns vazios, mas parecem ter sa�do de v�deos de Korn e Limp Bizkit, o que tamb�m n�o abona muito a favor de \"Montage of Heck\".",
    "rating": "25",
    "date": "June 12, 2015"
  },
  {
    "reviewer": "Marc B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/969976980/",
    "review": "  Movie of the year so far for me.",
    "rating": "50",
    "date": "June 12, 2015"
  },
  {
    "reviewer": "Spinstar Holomeme",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/901383004/",
    "review": "  Shaming kills. Slowly but surely. The more exuberant & uniquely uncontainabally original the youthful enthusiasm the more deeply implanted it leaves its deadly sting pumping away long after the bee is dead already.Kurt died for the music he couldn't perfect then share with the world without celebrity & scandal. He wanted to make a living, then live comfortably enough to die a happy addict in the bewildering wonder of his own unfettered dreams & their creative juices & urges. Not to be. Not to be for any of us corperate consumer conformity processed children from brilliant lumps of wonderment with or without any drugs to self medicate that damage & the pain in the belly it plants.",
    "rating": "40",
    "date": "June 11, 2015"
  },
  {
    "reviewer": "John J",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/877950849/",
    "review": "  Beautifully made. This is a movie not a rockumentary. The cutaways to animation with the cover tracks. Kurt's own voice speaking. Listening to Nirvana's music again. So much pain and sadness in the background. RIP Kurt.",
    "rating": "50",
    "date": "June 10, 2015"
  },
  {
    "reviewer": "Pablo G",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/962828500/",
    "review": "  Masterfully put together and perfectly paced, Montage of Heck is one of those unforgetable documentaries that both teaches and entretains in the best ways possible.",
    "rating": "45",
    "date": "June 10, 2015"
  }
,
  {
    "reviewer": "Patti T",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/970445346/",
    "review": "  Big Disappointment!! I was so looking forward to this new Kurt Cobain documentary. Hardly anything about it was new. The beginning, when Kurt was growing up, was truly enjoyable, loved seeing video of him as a child!! But that's where the fun stops!! Enter, Courtney Love and that is all you see and hear for the rest of the film. It literally hurt me to see her jumping all over poor Kurt's back, she obviously weighed more than him, and her non-stop nagging \"Kurt, come here, Kurt, watch me open Frannie' s gifts\", blah,blah,blah....There is no way it took 7 years to make this film, the director even said he became involved in a Kurt Cobain documentary in 2007, after a meeting with C.L. First of all, it didn't even have a title yet as of 2007 and if Courtney had nothing to do with the contents of the film, then why did production begin after their meeting??!! \"MONTAGE OF LIES\"",
    "rating": "05",
    "date": "June 10, 2015"
  },
  {
    "reviewer": "Shawn R",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/867661587/",
    "review": "  Decent interpretation of Cobain's life.",
    "rating": "35",
    "date": "May 10, 2015"
  },
  {
    "reviewer": "Ian C",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/947609447/",
    "review": "  A truly amazing documentary about the late great Nirvana front man. My only complaint would be that, Dave Grohl's interviews couldn't be included. So, fingers crossed they get added in for a DVD release.",
    "rating": "50",
    "date": "June 8, 2015"
  },
  {
    "reviewer": "Patti T.",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/970423571/",
    "review": "  definitely enjoyed seeing Kurt growing up.The concert footage I have already seen before. Krist was genuine and I enjoyed his interview. Tracy Marander was wonderful, it's a shame he didn't stay with her. You could tell she really loved him. The director said he worked on this for 7 years......that is truly hard to believe. I was also surprised at how cold Kurt's family seemed. Why did this movie put Kurt down so much?!? I thought it was supposed to be about Kurt, not Courtney trying to polish her image. There should have been tons of more never before seen footage and music. Disappointed to say the least. True Nirvana fans will see right through it!!",
    "rating": "10",
    "date": "June 8, 2015"
  },
  {
    "reviewer": "Laim M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/970419664/",
    "review": "  Good documentary, but I don't know if I could watch it over and over again like some others. I don't think it went far enough into certain things about his life, and I didn't really like how it just ended, but other than that I would suggest it to friends to watch.",
    "rating": "35",
    "date": "June 7, 2015"
  },
  {
    "reviewer": "Phiphat C",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/917423475/",
    "review": "  Fucking Awesome Rockumentary ???",
    "rating": "50",
    "date": "June 4, 2015"
  },
  {
    "reviewer": "Kerby H",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/882692630/",
    "review": "  Really interesting, although a weird take on his life. The interviews are gripping, and the footage of his childhood is remarkable. Overall, this film is really well done, but I could have done without the numerous montages of weird animation.",
    "rating": "45",
    "date": "June 3, 2015"
  },
  {
    "reviewer": "John Eric D.",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/966892496/",
    "review": "  This is an awesome documentary. It's more of an intimate portrait of Cobain's life! I like the animation and the montages of art they put to it. They combine art and story telling of Cobain's life at the same time. It is fascinating. I love Nirvana and Nevermind is one the best Rock albums ever. If your not a fan, you will still appreciate the creativity they did on this film. I love it! And IMO, a must have. Amazing job by Brett Morgen. Perfect 5!",
    "rating": "50",
    "date": "June 3, 2015"
  },
  {
    "reviewer": "Carlos M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/891372896/",
    "review": "  A comprehensive documentary that combines a great amount of video and audio footage with gorgeous animation and interviews to create a profoundly revealing character study, even if the final result feels a bit too long and some things are left hanging - like, where is Dave Grohl?",
    "rating": "40",
    "date": "June 1, 2015"
  },
  {
    "reviewer": "Coleman M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/908414511/",
    "review": "  One of the best documentaries in years, this perfectly captivates the insanity, craziness, but most of all artistic genius of Kurt Cobain.",
    "rating": "50",
    "date": "June 1, 2015"
  },
  {
    "reviewer": "Marcin P",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/871185535/",
    "review": "  The title \"Montage of Heck\", taken from one of Kurt's old mixtapes, is surely a fitting name. The film makes use of several clips from Kurt's home videos, drawings, notebooks, poetry and love letters. The editing in these montages is fantastic and there are some animation segments that are absolutely beautiful.Home videos himself and Courtney produced, both while pregnant with, and then after Frances Bean was born similarly get us up-close and personal.It has been made with the co-operation of his family. His daughter Frances Bean is an executive producer. His parents, sister, wife- Courtney Love, first girlfriend and fellow band member Chris Novoselic (the third band member Dave Grohl is the notable absentee) have all contributed, allowing themselves to be interviewed.Intriguing documentary but for Kurt's own, I suggest sticking to what he says \"Just listen to the music, everything I have to say is there\".",
    "rating": "35",
    "date": "June 1, 2015"
  },
  {
    "reviewer": "Andr&#xFFFD; D",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/799569684/",
    "review": "  El director Brett Morgen (\"On The Ropes\") dirige este documental producido por Frances Bean Cobain sobre la vida de Kurt Cobain, el tr�gico l�der de Nirvana, a partir de un montaje sonoro realizado por el cantante (de ah� el t�tulo de la pel�cula) y de videos familiares de super 8. El documental cuenta con una excelente factura y es un poderoso retrato �ntimo de la vida de Cobain, que as� como permite acercarse a la humanidad del artista, de alguna manera tambi�n destruye el mito.",
    "rating": "40",
    "date": "June 1, 2015"
  },
  {
    "reviewer": "Dylan N",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/905546712/",
    "review": "  Your love for this will correspond directly to your love for Nirvana & the lore surrounding them. The film is artfully made, but spending two hours in the subject's head may not be a comfortable thing for everyone. I am a reasonably big fan of Cobain as a songwriter, and his songs fill the movie wall-to-wall. That sealed the deal, for me.",
    "rating": "40",
    "date": "May 31, 2015"
  },
  {
    "reviewer": "Ben M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/836974574/",
    "review": "  Amazing documentary! Even though Courtney Love is seen in it....",
    "date": "May 31, 2015"
  },
  {
    "reviewer": "Kirk S",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/794012098/",
    "review": "  lots of interviews with Kurt & Courtney, including their home video's and excerpts from Kurt's journal paint the picture you'd expect. I didn't expect this documentary to make me dislike Courtney Love anymore than I already did.",
    "rating": "35",
    "date": "May 30, 2015"
  },
  {
    "reviewer": "Braydan H",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/816481023/",
    "review": "  Intensely visceral and intimate.",
    "rating": "40",
    "date": "May 30, 2015"
  },
  {
    "reviewer": "Massimo B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/807896363/",
    "review": "  Non mi � piaciuta la chiave con cui hanno concluso il documentario ma per il resto lavoro fantastico, specie la parte centrale in cui apre una porta sul genio creativo di Kurt negli anni in cui fondava i Nirvana.",
    "rating": "45",
    "date": "May 30, 2015"
  },
  {
    "reviewer": "Jonny S",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/793016733/",
    "review": "  Gillar du Nirvana, se den!",
    "rating": "40",
    "date": "May 30, 2015"
  },
  {
    "reviewer": "Pratap T",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/889222610/",
    "review": "  A must see movie ..for all Kurt's fans",
    "rating": "50",
    "date": "May 30, 2015"
  },
  {
    "reviewer": "Viet Phuong N",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/846471446/",
    "review": "  Not a Nirvana fan, I watched this film with the hope to find an \"authentic\" portrait of Kurt Cobain (this is the first documentary officially endorsed by Cobain's estate) 21 years after his suicide (this film should have been released last year to commemorate two full decades since \"the World lost Kurt\"). Disappointingly, I only got exactly what the title is (!) - a \"montage of heck\" about Kurt's life from a peaceful childhood to an \"adolescence-in-crisis\", to an early burst in fame, and finally a chaotic family life that was more \"Sid and Nancy\" than \"John and Yoko\". The montage was made with beautiful 16mm sequences of a bright, handsome, energetic, and deeply sensitive Kurt, and plenty of psychedelic illustration of his painful scrawls and symbolic drawings. Indeed the film has a huge amount of original footage and first-hand information about Kurt, but they were arranged in an \"artsy\" way that might look like Kurt's style and thought but in fact did not deliver anything about how he really lived his life, how he really thought about people, about love (well, there were touching moments when Kurt shared about his love for Courtney and Frances, but such precious \"moments of truth\" were again cut in piece by confusing illustration and out-of-tone soundtrack), how people did did love Kurt, did care for Kurt. Actually, the interview sequences of Krist about Kurt are surprising good - honest, touching - that shows how humble Krist is, how much he understands and cares for Kurt, and through his words, how sensitive Kurt always was, and how naive and unprepared Kurt (and Nirvana) was facing fame. But such honest sequences of interview were often under-used and, when used, misplaced (the interview of Kurt's mother did not look real, and did not provide much information about Kurt's thoughts or characteristics when he was still a child under her care). The soundtrack is not really outstanding either with a confusing arrangement throughout the film that did not provide much \"emotional boost\" when necessary for the audience. Maybe I am not a Nirvana fan, but Kurt's songs like \"Smell Like Teen Spirit\", \"Come As Your Are\", or \"Where Did You Sleep Last Night\" are really a part of my meager \"music knowledge\" to the point that I will probably sing them to my child as ... lullaby. That is why I really want a good cinematic portrait of Kurt, but sadly enough, this is not such portrait, what a waste of original footage.",
    "rating": "30",
    "date": "May 30, 2015"
  }
,
  {
    "reviewer": "Daniel T.",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/970303766/",
    "review": "  A montage indeed. I was hoping to like this documentary, but was instead brain damaged by it's series of montages which were collections of Kurt Cobain's writings, home movies and music. It was slightly enjoyable, if jarring in it's narrative, except I would have liked it if there were more interviews. Overall, felt incomplete to me.",
    "rating": "20",
    "date": "May 29, 2015"
  },
  {
    "reviewer": "Judy B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/845033145/",
    "review": "  I thought this was horrible! whoever produced this movie is a jerk, I was soo sad when I saw this, they made him look to be just a junkie! what happened to the scenes with all of his great qualities??? Smells like Courtney Love had alot to do with this movie, I will keep my opinion to myself about HER!",
    "rating": "wts",
    "date": "May 28, 2015"
  },
  {
    "reviewer": "Mark L",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/906973659/",
    "review": "  very human documentary. I think it was well done",
    "rating": "30",
    "date": "May 28, 2015"
  },
  {
    "reviewer": "John D",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/918195855/",
    "review": "  This is an awesome documentary. It's more of an intimate portrait of Cobain's life! I like the animation and the montages of art they put to it. They combine art and story telling of Cobain's life at the same time. It is fascinating. I love Nirvana and Nevermind is one the best Rock albums ever. If your not a fan, you will still appreciate the creativity they did on this film. I love it! And IMO, a must have. Amazing job by Brett Morgen. Perfect 5!",
    "rating": "50",
    "date": "May 27, 2015"
  },
  {
    "reviewer": "Elizabeth M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/874692669/",
    "review": "  Kurt Cobain es una leyenda, y algunos dicen que es uno de los m�sicos m�s influenciales de todos los tiempos, por lo tanto realizar un documental acerca de su vida es una gran responsabilidad. Brett Morgen no s�lo lo logr�, sino que esto es lo m�s cercano que estaremos de entender a Kurt y a su cabeza. Montage of Heck es una colaboraci�n junto a su hija Frances Cobain, lo cual le da a�n m�s legitimidad, ya que ella m�s que nadie necesita las respuestas. Kurt tuvo una infancia bastante complicada e infeliz. Al pasar a la adolescencia sus problemas se fueron exacerbando y consigui� algo de paz en su m�sica. R�pidamente fue catapultado a la fama y su nombre estaba en todas partes. Con Nirvana logr� el reconocimiento que siempre quiso, pero esto trajo una mirada que problemas que no pudo manejar. Su adicci�n a las drogas, problemas cr�nicos de salud y mentales y su relaci�n inestable con Courtney Love, fueron todos factores que lo llevaron a su inevitable suicidio.Montage of Heck repasa todo lo que fue su vida, pero desde su punto de vista. Recursos como sus diarios y animaciones son utilizados para hacernos sentir que estamos viendo un flashback de su vida a trav�s de sus ojos. Este documental no nos trae mayores respuestas acerca de su suicidio, pero nos permite ver sus tormentos desde otra perspectiva, y lo que fue uno de los pocos momentos de felicidad en su vida, el nacimiento de Frances. Las entrevistas hacia sus padres, Courtney Love y Krist Novoselic, son solamente complementos y me hubiese gustado que fuesen un poco m�s largas, especialmente la de Novoselic que fue la �nica que se sinti� honesta y se nota que la perdida de Kurt lo persigue hasta hoy en d�a. Falt� definitivamente los recuerdos de Dave Grohl. Pero a pesar de esto Montage of Heck es una mirada atormentada y ruidosa de lo que fue la vida de Kurt Cobain.",
    "rating": "45",
    "date": "May 4, 2015"
  },
  {
    "reviewer": "Josh A",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/781792242/",
    "review": "  Intense, personal, and with its heavy use of home video footage and journal entries, probably the closest we can get to being inside the mind of Cobain; The movie also manages to remain unbiased in its portrayal, focusing on the person he was, for better or worse.",
    "rating": "40",
    "date": "May 24, 2015"
  },
  {
    "reviewer": "Midlands M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/958559897/",
    "review": "  Kurt Cobain: Montage of Heck (2015) Dir. Brett MorgenWith unprecedented access to the Cobain family's archive, director Morgen also gets the blessing from Courtney Love in this documentary about the '90s grunge icon Kurt Cobain. In a variety of styles all sound-tracked by Nirvana's breakthrough garage sound, the film uses family footage, home videos, vox pop interviews and voice recordings to build up a true \"montage\" rockumentary of the front man as he battles his demons. Beginning with his family background, Kurt is portrayed as an (almost) typical teenager looking for an ideal that his home life cannot give him. Wanting but at the same time resisting the family dynamic around him, the film cleverly uses animation made from his sketchbook drawings and handwritten notebooks to bring the parts of his life, well, to life. Morgen even goes for a Scanner Darkly-style animated film to showcase Kurt's attempts at escapism from the mundane suburban life. His white trash \"friends\" he surrounds himself with are set against his first thoughts of suicide after a failed attempt at losing his virginity. These turbulent teenage years living with a variety of family members and friends but never belonging are insightful reminders of the fragile human behind the legend. Unheard songs and reworked versions of his classic, dare I say, hits show the inherent contradiction of the man wanting yet shunning adulation at the same time. Personal ambitions grate against the ugly commercial aspects of the \"biz\" and it is a comprehensive portrait to the point of obsessive. The film's 132 minute run time may put off the casual viewer but I suspect the film's target audience would be as fanatical as the film's protagonist about his music and how the world influenced / infected him. Taking its name from a cassette recording of a musical collage made by Cobain, his daughter, Frances Bean Cobain, was also a producer on the film and the documentary is brilliantly haphazard. With the feel of an unfinished scrap book, the film solidifies Cobain as the generation's voice of dissatisfaction. Like Cobain, the movie has a unique take on the world but tries a little too hard to be alternative and its bloated run time has an air of the excessive adulation Cobain wrote about and often shunned from. An ongoing stomach illness is brought to the forefront as the cause of pain but Cobain admits it could have been the aching inspiration of his genius. Sadly, his subsequent suicide resulted in a happiness he forever denied himself and also denied his closest family, friends and fans. A denial til the end.8/10 Midlands Movies Mike",
    "rating": "40",
    "date": "May 23, 2015"
  },
  {
    "reviewer": "Calvin C",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/782314003/",
    "review": "  Whether you like his music or not, this documentary is a fascinating look into a man who, for the most part, was a troubled genius. The super 8 films and home videos of Kurt and Courtney are what make the film standout. I thought the interviews were insightful, but didn't need the dramatic lighting and camera angles. It is less about his music than it is trying to figure out what was going through his mind and made him what he was.Grade: B+",
    "rating": "35",
    "date": "May 23, 2015"
  },
  {
    "reviewer": "Jason H",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/932570856/",
    "review": "  It's been 21 years since the untimely death of rock legend Kurt Cobain. Since then, there have been countless biographies and documentaries looking into his life and music, but there has never been one deeply as intimate as Montage of Heck. Brett Morgan dives not just into the music of Nirvana, but into what made his music so impactful. With access to the entirety of Cobain's archives, it's no doubt the territory Morgan was entering would be earth shattering: Unheard tracks from before Nirvana had formed, tape recordings of Cobain's astonishing ideals and disturbing confessions, and some heartfelt home videos of his childhood. To go even further, he animated his journal entries to really bring to life his drawings and poems, giving us a glimpse at how agitated and alone Kurt felt. Truly this is no average documentary. Morgan goes the extra mile to give you the feeling you're actually getting to know Cobain for the first time. He reminds us that he was more than just the \"voice of a generation\". He was a person like you and me. He struggled and he triumphed. He had a longing heart to be part of a loving family. He hated rejection, and he thrived on attention. His fame was driven by his pain, all the while leading him to his self-destruction. Brett Morgan's Montage of Heck tells the hard story of Kurt Cobain's life with integrity and care. It's electrifying, raw, heartrending, honest, and keeps his fire from never fading away.",
    "rating": "50",
    "date": "March 21, 2015"
  },
  {
    "reviewer": "Jason M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/814608062/",
    "review": "  It's hard to separate my feelings about this person from my thoughts on the movie. While I didn't know him, I and many more like me always felt a closeness and kinship beyond what one normally senses for an artist whose work one finds appealing. The movie's great. It finds a lot of its artistry through an expression and interpretation of Kurt's own artistry; it feels connected to him that way, as if he's helping tell the story. It seems to cover pretty familiar territory as a rock movie in the first half (I was mostly reminded of The Wall), but eventually (and successfully) detours into what feel like uncharted waters. It seems an empathetic and yet unflinching look at Kurt. The movie lays him bare, but seems to love him, too; and for that it's beautiful. And sad. There's a lot that gets said here, particularly in the interviews; but there's a lot that's still unsaid and that one can easily read between the lines. Not an easy film to watch, but done with care and compassion, and worthy of its subject.",
    "rating": "50",
    "date": "May 6, 2015"
  },
  {
    "reviewer": "Mario F",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/966141760/",
    "review": "  if I didn't grow up watch a ton of Nirvana bootlegs, I would have enjoyed it more. But it felt like a repeat dazzled with some home video and animation.",
    "rating": "25",
    "date": "May 18, 2015"
  },
  {
    "reviewer": "Nathan M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/802043196/",
    "review": "  Absolutely brilliant and moving, #kurtcobain:montageofheck is a uniquely artistic and fitting documentary of one of the most iconic artists of a generation.",
    "rating": "45",
    "date": "May 18, 2015"
  },
  {
    "reviewer": "bill s.",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/911733308/",
    "review": "  Well done doc....sad to see and say that sometimes you know some people are not long for this world but he left one hell of a legacy.",
    "rating": "40",
    "date": "May 18, 2015"
  },
  {
    "reviewer": "Nitesh K",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/804724231/",
    "review": "  Experience Kurt Like Never Before...Its Dark, Its Intense, Its Overwhelming..Its Evrythn Which a Rock Fanatic Can Evr Wish For....The whole experience is so unreal..",
    "rating": "40",
    "date": "May 17, 2015"
  },
  {
    "reviewer": "Zenkai T",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/799506816/",
    "review": "  Excelente documental ! A�n no puedo creer que la diva pedorra de Dave Grohl no diera ninguna entrevista en el mismo :/",
    "rating": "30",
    "date": "May 17, 2015"
  },
  {
    "reviewer": "Duncan K",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/934976895/",
    "review": "  The documentary gives a good insight to Kurt Cobain's life, but not every single aspect of that is particularly interesting.",
    "rating": "40",
    "date": "May 16, 2015"
  },
  {
    "reviewer": "MovieReviewer1",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/901228504/",
    "review": "  Informative, and unique, Montage of Heck shows a more intimate, yet disturbing side of Cobain's short life of fame.",
    "rating": "40",
    "date": "May 15, 2015"
  },
  {
    "reviewer": "Jacob P",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/939191739/",
    "review": "  Whether or not you're a Nirvana fan, I highly highly recommend Montage of Heck. Its absolutely riveting from start to finish.",
    "rating": "50",
    "date": "May 14, 2015"
  },
  {
    "reviewer": "Static Journal",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/969973480/",
    "review": "  Something tells me the next few months are going to get interesting as far as how the media picks up on the official story of Cobain's death. 'Montage of Heck' is going to debut on HBO, May 4th, 2015. 'Soaked In Bleach', which reveals the events behind Kurt Cobain's death as seen through the eyes of Tom Grant, will debut in some international countries (Norway, Sweden, Germany, Japan, Australia and Finland) soon, and a US date might be announced within the next month.I recently saw 'Montage of Heck', and will offer my review of the film below. Warning: This contains spoilers.To be honest, I like some parts of this movie and hate other parts of it. I'm going to try to include some of the better moments, because who wants to constantly talk about depression? It was obvious that the director was trying to build the narrative that Kurt was suicidal from his formative years to his later years, but I like how it was Kurt telling parts of his story in the beginning and not Courtney, even though what was shown in the film was picked to build the narrative. I also appreciate how much work went into some of the animation and the editing. One of my favorite songs 'Territorial Pissings' is played to start off, and I thought it was well done; the way they showed clips and photos from the culture of the 50's and 60's as the song fades away and it's just Kurt's vocal track. These were the highlights of the movie to me, the new Nirvana music videos we were able to experience.The movie then goes into the beginning of Kurt's life in Aberdeen, with Kurt's mom, Wendy O'Connor telling the story. I'm not going to do a play-by-play of the movie, but it is amazing there are so many home movies of Kurt as a child. He was definitely loved as a little kid before his sister was born. Anyway, the most interesting thing from this part of the movie is the interview with Kurt's dad and his stepmother. This is the first time I've ever seen them besides the early pictures of Don with Kurt as a kid. What struck me was how uncomfortable they looked talking about how they handled the divorce situation. Kurt had a hard time getting along with his family after the divorce. His mom didn't seem to like some of the habits that Kurt inherited from his dad (Hint: when she says, \"That's very Don Cobain.\") I never really bought into the idea that Kurt slept under the bridge he wrote about in 'Something In The Way', I thought he may have spent some time there (not sleep there), but I believe the broken home scenario was more real than I initially thought.It then starts getting into some uncomfortable material, with the story of Kurt wanting to lose his virginity before he died and his first attempt at suicide. It can be debated whether this should have been included, but at least it was Kurt's voice telling this (his story should come from him). The one thing that is interesting is how Kurt recorded everything; even a telephone conversation between him and Buzz Osborne (The Melvins). It kind of reminds me of 'The Devil and Daniel Johnston', where Daniel Johnston recorded his own movies and audio.Then, my favorite part of the movie starts where they get into him actually playing music. You know... the music. The journal entries were turned into animation, showing the different band names that Kurt went through before deciding on Nirvana. I liked how this was done, and it didn't always have that somber tone. It has clips of Kurt trying to write 'Breed' and 'Been A Son'. The interview with Kurt's girlfriend, Tracy, was not too bad (but nothing really new), and there was a funny moment of Kurt playing his guitar when the phone rings; Kurt picks up the phone and tells whoever is on the other end that Tracy is at work, and he takes a message. I don't know why I found this so funny, it was like Kurt was writing a song one minute, and then he had chores to do.I thought they should have spent more time on this era in his life, as he was laying the foundation for Nirvana. I agree with Alice Wheeler, that the film never focused on the scene in Olympia; other artist's that helped support his creativity. This is the time he wrote most of his songs; even some that are on 'In Utero.' They try to talk about Kurt's heroin use at this time, again to build the narrative for later in the film, but even in Kurt's own journal entries, he says he tried heroin 5 to 10 times during this period. Not exactly a hardcore addict, so of course, Tracy didn't know about it. It's not exactly revealing that he tried heroin because of his stomach problem.Then, we get to the interview with Wendy O'Connor that didn't entirely make sense. She tells a story of when Kurt showed up at her place (looking like Don Cobain) with the master tape of his new album (Nevermind). She tells Kurt to play it and turn it up, up, up... and then she says she was scared. Really? Wouldn't the first reaction be, \"Hey Kurt, this is really good.\" If Geffen Records knew it was going to be such a big hit then why did they only print 50,000 copies of the first run of 'Nevermind'? She should have been working at Geffen. Her story of telling Kurt, \"You are not prepared for this,\" seems a little too contrived.The film then goes into Kurt's rise to fame by showing an airplane taking off. Even though this is a movie focused on Kurt and not Nirvana, I felt they should have mentioned how Dave Grohl joined the band through Buzz Osborne. Kurt was excited when Dave joined the band, so even though the film is just about Kurt (not Nirvana), it is still a part of Kurt's life. We then get the somber rendition of 'Smells Like Teen Spirit'. The film does this a lot, with having a less serious moment, followed by a somber moment. According to the director, it's because that's the way Kurt was. Hmmm, ok, whatever... nevermind.Then, we get to Courtney. I'm not going to talk trash. Actually, there was a fun Courtney moment, where she was dancing on the side of the stage to Nirvana's music. It was actually a decent moment to show (if she was actually dancing to Nirvana and not some other band; remember context is important).Another funny moment was when they started showing the home videos between Kurt and Courtney. Courtney says to Kurt, \"How come everyone thinks you're the good one and I'm the bad one?\" Kurt replies, \"Because I know how to use my illusion\"; which is a reference to Axl Rose. It shows how quick and funny Kurt actually was at times, even though the rest of these home videos become really annoying. They seem obsessed with what is said about them in the tabloids.I haven't seen anyone talk about the comment \"I paid for this\" yet. Courtney asks Kurt, \"Where are you going?\" as he starts to walk away. Kurt jokes, \"I'm going to MY end of the room... I paid for this.\" Yes, you did Kurt. I didn't think about it at first, but I think it is interesting that the director included this, and the disclaimer during the end credits, kind of says something about how the director was a little conflicted.Did anyone else notice that someone must have been filming Kurt and Courtney in the bathroom? It wasn't a selfie shot like some others. I'm guessing it was Eric Erlandson, as he was shown filming in the clips just before this scene. When Courtney drops her towel and kind of smiles at the camera while Kurt's back is turned, that kind of says it all.Anyway, back to the music. I really liked when they showed Nirvana playing 'Drain You' at a sound check which was played before their show at the Paramount Theatre in Seattle on October 31st, 1991. If I remember correctly, Kurt's guitar was out of tune when they played it live during the show, so it was good to hear the intro (in tune) during the sound check. I also liked that they showed Kurt cracking jokes at the 'MTV Unplugged' taping, even though they then turned it into a somber moment. This wasn't the last show Kurt played, the band toured for another 4 months after this.Some of the Courtney interviews will make you cringe; especially when she talks about how she thought about cheating in London, but never did. And the comment where she says Kurt told her, \"I'm going to get to 3 million dollars and then I'm going to become a junkie.\" Really? That seems really specific. Why wasn't it 2 million dollars or 3 1/2 million dollars? 3 million dollars? Ok. Whatever.Some Nirvana fans know that 'Where Did You Sleep Last Night' was covered by Kurt before Courtney even came into the picture. So the idea that he played that song just because of Courtney's infidelity, doesn't really jive. Even if he did pick that song because of Courtney, then her story of the first time she thought about cheating was in London of 1994, doesn't make sense with why Kurt chose to play the song in November of 1993.It would be nice if we could get a confirmation (since this is the 'definitive Cobain documentary') on the number of rohypnols that Kurt actually ingested during the Rome overdose? Medical documents? Anything? Courtney has changed the number on this. First it was 50, now it's 67. Supposedly, Kurt was a psychic and knew that Courtney was 'thinking about cheating'. So he got so upset that she was 'thinking about cheating on him' that he overdosed on rohypnols (the date rape drug).All you have to do is listen to Nirvana's concert on February 24th, 1994 (four days after Kurt's birthday) to know that the person she was 'thinking' about cheating on him with was Billy Corgan. During that show in Milan, Kurt and Krist were cracking jokes. Krist would say, \"I'm Billy Pumpkin.\" Kurt would reply, \"No you're not! You're Meat Loaf!\" That's not exactly the depressed state the film attempts to make you believe about how Kurt couldn't cope with her 'thinking about cheating.'I don't want to talk about Kurt's heroin use, because I wasn't there. The clip where he is holding Frances while she is getting a haircut isn't really all that comfortable to watch. Brett Morgen (the director) stated in an interview that Krist Novoselic and Kurt's sister did not want this shown in the movie, while Frances (Kurt's daughter) did. It does beg the question, if he couldn't function on a normal hit of heroin, how does he take a massive hit of heroin, cap the needles, put them away and operate a gun?Some of the journal entries don't always fit the timeline. They show an entry that repeats \"Kill Yourself\" followed by \"Rape is good\". For those who don't know, one of Kurt's notebooks was stolen around 1992. The song 'Do Re Mi' and the journal entry above can be interpreted as Kurt not wanting his privacy raped. The line 'Kill Yourself' could be meant to say to anyone reading this kill yourself because you think raping my privacy is good. And that is the only problem with the movie; it sometimes takes things out of context to fit its narrative.Also, the film never talks about how Kurt got his stomach problem diagnosed properly. In 1993, Kurt's stomach problem was diagnosed as a pinch nerve. He had talked about this in interviews that he was so relieved that this problem didn't bother him anymore. Since the movie talked about him being sick and trying heroin because of the stomach problem, then there should have been some insight into what caused the problem.The film ends as you think it would, you know, Kurt couldn't cope so he committed suicide. It does end abruptly leaving room for discussion. Then, Nirvana's cover of 'Ain't It A Shame' starts playing. Yes, it is a shame.Final thoughts:'Montage of Heck' has some good moments, and some things that make me scratch my head and test my logic. The music still sounds great, 25 years later, in any format. There is footage and audio that I've never heard before, and I am glad to hear anything new all these years later. I wish they would have done 2 separate films; one that is a film focused just on Nirvana and Kurt's music (all of those audio tapes of him writing songs could have made its own film). The other film could have been the story of a man destined to commit suicide. The humiliation and shame Kurt experienced only made him try to rise above each time throughout the film, and it will be debated whether or not he was planning to die or rise above Courtney's wandering eye.I will say this, though; there are hints that the director was conflicted in how he told this story. If you watch closely, you will find one thing sometimes contradicts the other. So is this the 'definitive Cobain documentary' that has been advertised? In some ways, yes and in some ways, no. It's the only documentary that obtained the rights to use Kurt's music and art. It's dark, but when you peel away the somber undertones that will make any person look like they were destined to destroy themselves and try to remember the better moments; it's pretty good.",
    "rating": "30",
    "date": "May 1, 2015"
  }
,
  {
    "reviewer": "Ian G",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/771273532/",
    "review": "  By no means a traditional doc telling the backstory of Grunge Icon Kurt Cobain but more of an artistic retelling through the huge archieves of previously unseen home videos, sketches, music and new interviews with key people close to Kurt. In some ways it is almost like the Cobain Journals that came out last decade was put to screen in a lot of ways. Not hugely relevetory outside of the lead up to the Rome suicide attempt and Courtney's potential trigger for it, along with the painful; intimacy for the homevideos of Kurt, Courtney and Frances while Kurt was severely high. Very painful to watch. Full marks for being unflinching and the use of some staggering animation throughout the proceedings although seemed to be a tad long. However would have been cool to see some more intimate videos with Kurt and the band outside of one token jam session when they were first starting out but otherwise fairly intriguing.",
    "rating": "35",
    "date": "April 27, 2015"
  },
  {
    "reviewer": "Casey B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/784518975/",
    "review": "  Sure it doesn't delve into the music side of things as much as it arguably should. But both as a glimpse into the headspace of a tortured artist and as an avant garde narrative, it is a stunningly effective journey.",
    "rating": "45",
    "date": "May 12, 2015"
  },
  {
    "reviewer": "Daniel C",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/935671186/",
    "review": "  awesome on so many levels..",
    "rating": "50",
    "date": "May 12, 2015"
  },
  {
    "reviewer": "Nick C",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/883891452/",
    "review": "  I don't review movies much anymore, but this is enough to possibly revert me back to homeostasis without even being fiction.",
    "rating": "50",
    "date": "May 11, 2015"
  },
  {
    "reviewer": "Chris C",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/907082999/",
    "review": "  Really like the visual elements they used to tell his story, it felt less like a conventional hollywood documentary style and more of an artistic approach, something Kurt may have appreciated. Just wish the ending wasn't glossed over as much, seeing as the rest of the film felt raw enough to have covered the topic.",
    "rating": "40",
    "date": "April 24, 2015"
  },
  {
    "reviewer": "Beau B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/970064588/",
    "review": "  This was absolutely created in poor taste.",
    "rating": "20",
    "date": "May 9, 2015"
  },
  {
    "reviewer": "Christopher G",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/834152501/",
    "review": "  This is a window into the mind of one of the all-time great rock visionaries. Rather than having a strict plot, it mostly consists of montages of Cobain's art and home movies. Mesmerizing on first view, especially the behind-the-scenes footage of some iconic Nirvana moments. But the lack of a narrative makes me feel like it'd be harder to rewatch.",
    "rating": "30",
    "date": "May 9, 2015"
  },
  {
    "reviewer": "Jackie S",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/898557325/",
    "review": "  watching this two days after \"boyhood\" was weird. same movie but with a less ambiguous ending.",
    "rating": "45",
    "date": "May 9, 2015"
  },
  {
    "reviewer": "Jason R",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/784110364/",
    "review": "  Brett Morgen (The Kid Stays In The Picture) uses archival footage, notes, drawings, and unseen home videos to bring to light the life and times of Kurt Cobain, the legendary singer/guitarist for the band Nirvana. We get a very intimate glimpse of the beloved musician from his early years all the way up to 1994, when he tragically took his own life at the age of 27. Having seen other documentaries produced on Nirvana and Cobain, I couldn't help feel that they were more idol-worship and spent less time focusing on the troubled life this man had. So, I was surprised and in some cases shocked with how much of his past they discussed. The use of home video footage to show how drug addiction drastically changed his mental and physical state, it was extremely upsetting to see. I grew up listening to these guys! Kurt was a gifted songwriter and musician. So, to get this level of intimacy and detail about his life. To see the events that made him the way he was. It was impressive that someone was able to put a documentary together that felt less like a love letter and more of a character study. I think it is the only real way you can effectively tell this story and they did it very well. On top of all this! Morgen utilized the incredible animation skills of Stefan Nadelman and Hisko Hulsing, to bring to life drawings done by Kurt. As well as, brilliantly bringing to life major events in the young Cobain's life. Which included his family troubles and his musical beginnings. The only issue I really had with the film was the exclusion of Dave Grohl, whose omission was a choice the director made. I felt it would have given the film a little more. But, ultimately I had no major issues with this documentary. It is very well done! The animated sequences alone make this worth your time. Even if you don't like Kurt Cobain! This is a great character study that doesn't pull any punches as it focuses on the events that both made and ultimately destroyed an extremely talented musician.",
    "rating": "45",
    "date": "May 9, 2015"
  },
  {
    "reviewer": "Macke D",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/858006437/",
    "review": "  Ganda nung animated short story at kung paano ginamit yung mga art work, journlas home video etc. mula kay Kurt. Over all medyo magulo at di comfortable panuorin pero siguro ganun naman kasi yung buhay ng subject.",
    "rating": "40",
    "date": "May 8, 2015"
  },
  {
    "reviewer": "Raji K",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/783249204/",
    "review": "  Brett Morgen writes and directs Kurt Cobain: Montage of Heck. The film focuses on the life of Kurt Cobain, and does not venture much into the aspects of Nirvana. The film starts off with footage of his childhood as well as interviews from his family. Its clear that his troubled teen years led to much of the angst present in his music. The film somewhat loses the documentary sense and becomes more of a myriad of imagery, and splicing together montages to construct what may have been going though his life. Footage of his wife Love also ensues, and the focus of the film really shifts to that relationship. Those looking for more a music based documentary will be disappointed as this film really only mentions the albums being made in passing. The film does not attempt at all to look at the impact or legacy of his life past his death. Overall Montage of Heck is worth watching for any Kurt Cobain or Nirvana fan, but I felt the film had a bit more fluff with the imagery and montage aspects as an artistic film rather than a documentary.",
    "rating": "30",
    "date": "May 8, 2015"
  },
  {
    "reviewer": "David T",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/959515101/",
    "review": "  I think this documentary is a success overall, but it has a few flaws. Kurt died in 1994, and in a lot of ways the sound of his gunshot is still ringing. There were a couple of entire generations (myself included) that were deeply affected by Kurt's suicide, and perhaps we still have some repressed feelings about it. This film brought back a lot of emotions from the time, and it made me think about how quickly we seemingly \"got over it\" as a society.It made me feel like I had some buried-away, bad memories about losing or being betrayed by a loved one, and that I've tried to forget through the years more than I'd like to admit. And I wasn't even the biggest Nirvana fan at the time, but I still remember that awful feeling, like horrible, confused betrayal and a feeling like we we're collectively abandoned. So it made me wonder about the lasting effects that his life and his suicide may have actually had on the public these past 20 years, its probably more than we can quantify. It was nice to see video of Kurt as a young, happy kid. It was almost cathartic. I wish the movie had focused more, however, on this happy, positive side of Kurt. As the film progressed, it seemed to get darker and darker. I know that parallels his actual life, and obviously things got very dark at the end. But there were times in this film that I thought the writers were exploiting this, and unfairly portraying Kurt only as an out of control, suicide obsessed maniac, without focusing at all on his art, or any other positive thing he did.Even happier scenes with his wife and daughter were riddled with shots of scrawled lyrics in notebooks about suicide and mental illness, most of which were obviously taken out of context. There is one set of lyrics that say \"kill yourself. kill yourself...\" over and over. But at the bottom of the screen the next verse is out of focus. It says \"rape is good. rape is good...\" These are clearly satirical lyrics. It's like the director won't let Kurt have those happy memories, and has made the choice not to let us have those happy feelings either. All in all, this movie has shed some light on some really intense emotions that I think some of us have effectively hidden away through the years, but it didn't do much to resolve those feelings, and in some ways it made them feel worse. It was successful, however, in documenting his life, and I think it has helped to restart the conversation. The film was well constructed, chock full of rare, unseen footage and some insightful interviews. Maybe in the long run it can help heal some of the wounds that some of us perhaps never properly dealt with.",
    "rating": "30",
    "date": "May 8, 2015"
  },
  {
    "reviewer": "Theo G",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/786101487/",
    "review": "  AMAZINGGGGGG MOVIE!!!!",
    "rating": "45",
    "date": "May 7, 2015"
  },
  {
    "reviewer": "Jonathan B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/781872470/",
    "review": "  As with every other kid who grew up in the 90s, Nirvana was instrumental in molding my musical tastes. Whether he liked it or not, Kurt Cobain came to represent the voice of a generation, and nearly no stone of his mythic rise to fame has been left unturned in the 20+ years since his tragic suicide. The new documentary, and first officially supported by his family, Kurt Cobain: Montage of Heck, takes a little bit of a different angle by attempting to pear inside the headspace of the mythic figure instead of merely covering all of Nirvana's milestones. Part of it is very much a conventional life-to-death biography, featuring scattered interviews of family and a few close friends (although the fact Dave Grohl's interview apparently couldn't be completed in time to make the cut is a glaring loss), but the other part is much more abstract, mishmashes from Cobain's journal and home videos along with animations of his artwork, often set to Nirvana songs or home demos. It's a haunting look at a man who clearly experienced a lot of personal hurt and turmoil in his brief time here on Earth, and a stark reminder of the horrors of heroin. Whether or not it allows us to understand Cobain better, well, that's anybody's guess.",
    "rating": "40",
    "date": "May 6, 2015"
  },
  {
    "reviewer": "Andrew L",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/914446268/",
    "review": "  For the most part it was good. There was plenty of video footage and some audio clips that have never been scene before (officially and unofficially). The first half of the documentary had home movies of all the Cobain's and it puts out a good vibe with plenty of info on Kurt throughout his early life and his teens. About half way through though, around \"Nevermind\"'s release things sort of start breaking down and becomes less informative and more of showing off Kurt's home videos of him, Courtney and Frances. It gets rather boring and kinda weird and then the whole documentary ends abruptly. Maybe its suppose to represent the title but I would have preferred it to be a little more traditional. Overall its still a good documentary but its not the best one on one of the most brilliant musicians to ever live.",
    "rating": "35",
    "date": "May 5, 2015"
  },
  {
    "reviewer": "Aaron M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/940395698/",
    "review": "  Really good. Really dark. Must watch again soon.",
    "rating": "50",
    "date": "May 5, 2015"
  },
  {
    "reviewer": "Julia H",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/970026950/",
    "review": "  Even though I wasn't completely objective due to my extremely distain for Courtney as well as a newfound annoyance with Brett Morgan (he just seems a bit too pompous, exhibiting an extremely righteous glee about MOH), I tried my best to watch without too many preconceived notions.I've read a plethora of glowing reviews, hailing Montage of Heck as sensitive, deeply moving and genius. I disagree.Montage of Heck was strangely disturbing to me, in a violating kind of way for the lack of better words.The weird thing is that I cannot pinpoint why I was so fucking uncomfortable during most of the movie. Was it Courtney's feeble attempt to deflect attention away from her issues, thus making Kurt the scapegoat in some of the footage, or maybe it was the films general voyeuristic tendency?I don't know why the movie left such a bad taste in my mouth, something just seemed wrong. I do however support Alice Wheelers reaction/post about Montage of Heck and share very similar feelings about this so called \"honest\" travesty.",
    "rating": "05",
    "date": "May 6, 2015"
  },
  {
    "reviewer": "Keith L",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/859002826/",
    "review": "  This was engrossing and well done artistically, but left a lot to be desired in the way of information. Still recommended. Eerie, to see the man behind the music, and the reality behind lyrics.",
    "rating": "40",
    "date": "May 6, 2015"
  },
  {
    "reviewer": "Razif O",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/866027124/",
    "review": "  A journey into Kurt Cobain's life, often misunderstood and complicated since his younger days which influenced his music. A lot of personal unseen videos on his life which sometimes sad to watch especially when he was heavily living with drugs. A bit disappointed Dave Grohl wasnt interviewed tho.",
    "rating": "40",
    "date": "May 6, 2015"
  },
  {
    "reviewer": "Michael L",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/912733204/",
    "review": "  Totally blown away by KURT COBAIN: MONTAGE OF HECK. The best doc I have seen in years and that rare film whose style and format is totally in keeping with the spirit of its subject. You feel immersed. You understand. You see what's important in all new ways. A staggering achievement!",
    "rating": "50",
    "date": "May 5, 2015"
  }
,
  {
    "reviewer": "Delicate I",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/811801162/",
    "review": "  Not enough.....never enough,,,,,,,",
    "rating": "35",
    "date": "May 5, 2015"
  },
  {
    "reviewer": "Charles R",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/970010168/",
    "review": "  A captivating examination of the paradox that was the voice of Generation X, Kurt Cobain. From his early childhood in Aberdeen to his death, Brett Morgen weaves a tapestry of film footage, notebook scribblings, recordings, and stories together to narrate the journey through Kurt's 27 years on planet Earth. I liked it, but I am biased as I was a freshman in high school the year Nevermind was released. The imagery is dark, not for the faint of heart. I had no idea how busy Kurt Cobain's mind was producing the images and lyrics he so urgently had to express to the rest of us. Sad story, but helps us better understand this tortured soul.",
    "rating": "45",
    "date": "May 5, 2015"
  },
  {
    "reviewer": "Mike K",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/906158321/",
    "review": "  A frenetic, fascinating sprint through Cobain's life that never gets lost in its maker's clearly abiding love for the man and his music. An uncensored look at what made -- and unmade -- Cobain.",
    "rating": "50",
    "date": "April 24, 2015"
  },
  {
    "reviewer": "Ian W",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/894821791/",
    "review": "  A superb documentary offering new insight in to the life of the enigmatic legend that is Kurt Cobain. With never before seen footage this is both touching and disturbing and reminds us all of the loss the world gained when Kurt Cobain sadly took his own life - RIP.",
    "rating": "40",
    "date": "May 5, 2015"
  },
  {
    "reviewer": "David F",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/786661982/",
    "review": "  If you're familiar with the mythology of Kurt Cobain and Nirvana, the epic rise out of nowhere-Washington to the biggest rock God of them all, then this is a splendid film which greatly humanizes Kurt and Courtney and checks in with Krist Novoselic in his balding middle-age. The endless home movies from Kurt's childhood up to his last days show sides of him that were not well known before and add something different to the way he and those close to him have been portrayed up till now. Likewise the quotes and illustrations from his journal fill in this artful portrait of the sarcastic lead singer of Nirvana.",
    "rating": "30",
    "date": "May 5, 2015"
  },
  {
    "reviewer": "Ryan B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/889395996/",
    "review": "  Ugh, what a mess. Such a disappointment.",
    "rating": "25",
    "date": "May 5, 2015"
  },
  {
    "reviewer": "Jay Kay",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/901363305/",
    "review": "  It is always interesting to discover new aspects of Kurt's life. This documentary sheds some light into his family history and it sort of makes sense that a child who was neglected/abandoned by his mother and father would grow up unhappy and angry. His mother seemed to hate Kurt's father more than love her son. It was interesting to see his ex-girlfriend talk about him, it looks like she supported him a lot and helped him develop and deepen his creativity. I certainly don't think that Courtney Love is evil, she grew up with very similar problems herself and she still seems like a very troubled individual. I think that she really loved Kurt. However, she and her daughter initiated and produced this documentary and it seems to me that they cared more about protecting Courtney's legacy rather that Kurt's - Was there any need for the \"We love you Courtney\" incident? But still, it's interesting to see things through her perspective. All biographies are pieces of a puzzle that you can put together with other input in your mind and form your own opinion of a personality you are interested in. I read that their daughter Frances Bean wanted to debunk her father's myth and the subject of a glorified rock n' roll suicide with this documentary and to some extent she achieves it. However I do think that Kurt was a very complicated person and so much more than a sad junky who couldn't get laid, which is basically what you take away from this documentary. I, like I am sure all Nirvana fans, was surprised and disappointed not to see Dave Grohl in this documentary. I did some research and read that he was interviewed for it, but very late and there was no time for his interviews to be in. I hope that they will manage to get them in at a later cut, or as bonus features. But even with no Dave being interviewed, couldn't the director at least mention him and how/when he got into Kurt's life, instead of treating him like a film extra? Apparently the director said that Dave wasn't so important in an \"intimate\" documentary about Kurt, but this was one of Kurt's close friends and main artistic collaborators, and that's a very intimate process they went through together. Big miss, very disrespectful to Dave, and it won't help improve Courtney's notoriety, many people will assume it was because of their bad relationship and lawsuits over rights to Nirvana's music. It was nice to see Krist Novoselic talking about Kurt, you can feel the love he had for him. The documentary was very well made and I loved the gradual, fast-paced montages of Kurt's artwork and writing, which give you an idea of his manic creative flow. Also depicting Kurt's zeitgeist helps to better understand him. We miss you, Kurt.",
    "rating": "35",
    "date": "May 5, 2015"
  },
  {
    "reviewer": "Hunter G",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/832615119/",
    "review": "  Great Doc! Gives a real insight to his creativity",
    "rating": "45",
    "date": "May 5, 2015"
  },
  {
    "reviewer": "Andrew B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/970016898/",
    "review": "  The most intimate of Cobain documentaries. Brilliantly told through remarkable visual and audio pieces.",
    "rating": "45",
    "date": "May 5, 2015"
  },
  {
    "reviewer": "Jon F",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/936034567/",
    "review": "  Definitely worth checking out if you were into Nirvana or a kid who grew up in the grunge era surrounded by that scene taking over the world (briefly). Well-crafted and engaging from start to finish. It shows a side of most people that we never see, the carnally insecure and flawed side we keep hidden and locked in dark places and behind masks. Even if it can be hard to watch at times, there is certainly value in that exploration.",
    "rating": "45",
    "date": "May 5, 2015"
  },
  {
    "reviewer": "Richard J",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/909962519/",
    "review": "  21 years since we lost this incredible musician. It was interesting to look back on what led to his rise and inevitable fall into extreme degradation. I was unable to appreciate this during the pre-internet age.",
    "rating": "35",
    "date": "May 5, 2015"
  },
  {
    "reviewer": "Michael H",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/847188110/",
    "review": "  Although it offers no new insight into Kurt's troubled mind, the story is told very well especially in the montages of sound and vision. Say what you will about Courtney, but it's clear that he loved both her and the baby without question, and it's still very sad that he's gone from us far too soon",
    "rating": "35",
    "date": "May 5, 2015"
  },
  {
    "reviewer": "Andrew K",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/791024175/",
    "review": "  I saw a Facebook post, reviewing this movie, saying \"He was a human -- not a god.\" I never thought Kurt Cobain was a god. I have always respected him, because he was a person who suffered deeply, and he tried to make something with it. Whether it was just to work out his own pain and rage or not, he has now reached multiple generations of troubled kids and at the very least let them know they are not alone (which is the one thing almost all of them believe they are). Someone else has felt this. He, like so many, was trying to find a light in the darkness that wanted to consume him. Unfortunately, and very tragically, that did not happen, but he tried. His music is one of the things he helped to create that has outlived him, and the world is better for him having been here. However short his time here may have been.",
    "rating": "50",
    "date": "March 12, 2015"
  },
  {
    "reviewer": "Freddy H",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/841086800/",
    "review": "  Really enjoyed watching the succession of such a talented virtuoso, the tender home videos were precious as hell. Who wrote better songs than this cat?",
    "rating": "40",
    "date": "May 4, 2015"
  },
  {
    "reviewer": "Rob P",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/863632823/",
    "review": "  This... this was very good.",
    "rating": "50",
    "date": "May 4, 2015"
  },
  {
    "reviewer": "Yum Yum C",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/875278167/",
    "review": "  Sterile, disengaged, heartless vanity piece.",
    "rating": "05",
    "date": "May 4, 2015"
  },
  {
    "reviewer": "Phillie E",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/908438789/",
    "review": "  The rare interviews and other source material make this a must see for any Nirvana enthusiast.",
    "rating": "35",
    "date": "May 3, 2015"
  },
  {
    "reviewer": "Paul M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/907500036/",
    "review": "  Access: amazing. Animation: inspired. It's so rare that you get an insight like this into an artist who has had such an impact. Storytelling is equally impressive, up until the very end, when the filmmakers decide to drop the mic on the whole thing and hastily walk out of the cinema. Maybe they thought it was punk rock of them, but it makes their carefully-built story unsatisfying by the end. Must still give it 4 stars, for everything up to this point.",
    "rating": "40",
    "date": "May 3, 2015"
  },
  {
    "reviewer": "Maierean I",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/786148468/",
    "review": "  A Must- See !!! This movie will take you for a ride you won't forget !",
    "rating": "45",
    "date": "May 2, 2015"
  },
  {
    "reviewer": "Riley A",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/844566243/",
    "review": "  Montage of Heck does justice to Kurt Cobain in many ways. The movie give's extremely intricate detail from the start of his life leading to his playing on MTV Unplugged. Kurt Cobain was already someone i thought was quite a philosophical and intelligent person, but this movie made me gain a lot more respect for him. This is the one film this year that i believe everyone need's to watch. 9.5/10",
    "rating": "50",
    "date": "April 16, 2015"
  }
,
  {
    "reviewer": "Harrison W",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/787346698/",
    "review": "  Incredibly self-indulgent, but I guess it has to be, right? Seemed a bit long to me. Very fair portrayal, though probably too heavy-handed at some points. Could have used more Dave Grohl. I heard that the director didn't have time-MAKE TIME, dude. He's the most famous/successful out of all of the people who knew Kurt.",
    "rating": "40",
    "date": "May 1, 2015"
  },
  {
    "reviewer": "Mark C",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/832800147/",
    "review": "  Morgen went a little heavy with the surreal montages in lieu of, I don't know, actually information about Cobain and the events leading up to and following his death. This documentary has to about 80% animated collage. If Morgen was just going to stop the night before he died, this only needed to be an hour long maximum ( minus the dancing cartoons ).",
    "rating": "30",
    "date": "April 30, 2015"
  },
  {
    "reviewer": "lewis09tab",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/955651398/",
    "review": "  Half decent documentary but the music is dreadful and so painfull to listen to, he really couldn't sing. Don't understand why he was so famous",
    "rating": "05",
    "date": "April 30, 2015"
  },
  {
    "reviewer": "Neil S",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/920220597/",
    "review": "  two stars taken away because i hate courtney love and she is clearly pulling the strings on this , controlling the discourse if you will and you don't learn anything new really",
    "rating": "30",
    "date": "April 30, 2015"
  },
  {
    "reviewer": "Hawain K",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/969956138/",
    "review": "  An amateur porn would be less intimate that what is shown in this movie. As the documentary itself reveals, Cobain hated being ridiculed, judged for his life rather than for his music, and more generally being exposed, chewed by and eventually sentenced by strangers who were and are morbidly attracted by how he was in his privacy. Despite its positive elements-such as the richness of the materia or the animation parts-I could not help but feeling uneasy for the most part of it, a little ashamed of me partaking in this, commercially-driven, and socially shared act of violation.",
    "rating": "20",
    "date": "April 30, 2015"
  },
  {
    "reviewer": "Brian H",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/836674526/",
    "review": "  As a Nirvana fan, I enjoyed this, but would be lying if I said I wasn't a bit disappointing considering the hype built around this. It's a very profound examination of Cobain as an artist, but aside from home video footage, there is nothing new here that you haven't seen before or don't know about. It also skims over several important parts of Cobain's life and gets a bit repetitive at over 2 hours. I also really disliked the way the director chose to end it as well. An entertaining watch if you're a Nirvana fan, but it's all just a bit too familiar.",
    "rating": "35",
    "date": "April 29, 2015"
  },
  {
    "reviewer": "Alfia T",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/923124047/",
    "review": "  ???????????? ????????? ??????. ??? ???? ??????????? ???????? - \"???????\" ??????? ??????? ? ???????????? ??? ????????????. ????????? ??????, ?????? ?? ???? ???????? ? ?????? ??????.",
    "rating": "50",
    "date": "April 29, 2015"
  },
  {
    "reviewer": "Peter F",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/782851126/",
    "review": "  The documentary about the most enigmatic rock musician of the 90s is a rich tapestry to his pathos. Built around videos, notebook writings, and artwork that Cobain himself made over the years (along with some unexpected use of rotoscoping) Montage of Heck attempts to get to the root of Cobain's affliction, and does it in a rather unorthodox way. Fans of Nirvana will enjoy seeing the previously unreleased material, and others will admire the documentary's craft, and unconventional design. Like Nirvana's music, Motage of Heck is beautiful, disturbing, and fun all at the same time.",
    "rating": "45",
    "date": "April 29, 2015"
  },
  {
    "reviewer": "Carla P",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/925159264/",
    "review": "  Drugs and addiction in general suck!! Not a Nirvana fan but still this was a very enjoyable documentary, perfect for the hard-core Nirvana fans.",
    "rating": "40",
    "date": "April 29, 2015"
  },
  {
    "reviewer": "Trevor S",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/782821626/",
    "review": "  As far as the unseen and unheard footage, interviews, and sound clips go, this is about as personal as we can get into his life. It does a decent enough job for an overall documentary I suppose. However it glazes over many subjects mostly due to the fact that Courtney Love and Cobain's family had the control of what was shown and detailed. You can tell that it is completely biased in that regard. The created animations were superbly meshed well with Kurt's art and sound clips. Definitely worth watching, even if you're not a fan of Kurt or Nirvana. I'm looking forward to Soaked In Bleach which will cover more concerning the conspiracies and usually overlooked details about the end of his life.",
    "rating": "40",
    "date": "April 29, 2015"
  },
  {
    "reviewer": "Earla G",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/904812996/",
    "review": "  I cannot wait to see this....",
    "rating": "wts",
    "date": "April 27, 2015"
  },
  {
    "reviewer": "Scott C",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/785471116/",
    "review": "  A hard-hitting, visually arresting new angle of the complex, contradicting personality of Kurt Cobain.",
    "rating": "35",
    "date": "April 26, 2015"
  },
  {
    "reviewer": "Danny C",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/969899367/",
    "review": "  I am a Nirvana fan, my wife hates Nirvana. We both loved Montage of Heck.",
    "rating": "50",
    "date": "April 25, 2015"
  },
  {
    "reviewer": "David C",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/783976514/",
    "review": "  Makes creative and enlightening use of rich archival material. Should be seen on a big screen with the volume turned up. God, I miss troubled-genius rockstars.",
    "rating": "35",
    "date": "April 25, 2015"
  },
  {
    "reviewer": "Kenny G",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/781862229/",
    "review": "  First off I'd like to point out I am and always will be a Nirvana fan. If you are a fan its a must see. If you're not a fan, you should watch it and look at him as someone who had it all and struggled with the fame. The film (produced by his daughter Frances Bean and Widowed wife Courtney Love) show how Kurt made something of himself after years of negation from family and school mates. The story is heart breaking but develops into a story of success, but its not all glam and party all the time. \"He wanted to make $3,000,000 and quit to become a junkie.\" as his widowed wife mentioned in the film. Although it shows more private videos of Kurt and how he was with family (which had a few funny moments) You also meet his parents and sister that have NEVER been in the public eye. Not going to go into detail about everything in the film because its something you should watch yourself if any interest at all. But a few things bothered me, such as no mention of their wedding in Hawaii and how Kris wasn't there, or when Kurt lived with Dave Grohl (No Dave was not in the movie either due to timing of the filming and Dave filming Sonic Highways). The movie kinda leaned toward how Kurt was a tortured soul and made you believe he would of committed suicide, It made Courtney Love seem like such a level headed person who didn't really have much control of Kurt and how they were a team when I've heard stories of how she controlled him. Another part was when Courtney was telling the Rome story, yea you make your own call of judgement on that one if she was lying or not. Me? I wanted to yell out bullshit but i held my tongue. I understand now why some people who knew Kurt thought this movie was bullshit and Courtney had to be part of the editing process of this film when the director Brett Morgen continues to claiming he and the editor were the only ones who were in the room editing this film.Final word. May 4th.. HBO and movie theaters North America will be playing this film. I say go and enjoy the soundtrack along with the visuals.",
    "rating": "40",
    "date": "April 24, 2015"
  },
  {
    "reviewer": "Jimmy H",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/905408626/",
    "review": "  A must for any fan of the late Kurt Cobain. A look inside his life and career featuring plenty of rare and unreleased footage. After coming out in limited release, it will go straight to HBO. He's been dead for 20 years and yet he still has a large cult of fans and followers.",
    "rating": "30",
    "date": "April 22, 2015"
  },
  {
    "reviewer": "Tim F",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/784658451/",
    "review": "  Montage of Heck was absolutely incredible. Director Brett Morgen truly succeeded in breathing new life into the icon, by shedding light on the story of man behind the music and myth. The documentary was humanized through the integration of Kurt's writings and recordings, as well as by the gritty animation of the frontman's paintings, drawings, sculptures, and sketches. This is a must see, and not just for devout Nirvana / Cobain fans.",
    "rating": "50",
    "date": "April 21, 2015"
  },
  {
    "reviewer": "Bob H.",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/969818751/",
    "review": "  In a feature too long for my tasting, Brett Morgan cleverly knits together the remains of what was a short but fruitful rockstar career. The film never fails to entertain, but lacks the ability to tell a new story. The most important additions are the Love-Cobain couple's home-videos, which leave an image of the artist that should be remembered. But that is not an addition we can thank the makers for. What we can thank them for however, is the bril animation sequences.",
    "rating": "30",
    "date": "April 18, 2015"
  },
  {
    "reviewer": "Ian T",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/786988107/",
    "review": "  So its good that a lot of the key people in his life give interviews and you get some real insights into the man. There seems to be a lot of great footage, the shots of him as a kid and him with his kid are heart breaking. However by the end the arty montages get a bit tedious and they could have spent a lot more time and detail elsewhere.",
    "rating": "30",
    "date": "April 18, 2015"
  },
  {
    "reviewer": "Reini U",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/839674136/",
    "review": "  The one and only Kurt Cobain film. Now I wish I could just unsee all the other previous Kurt Cobain films. Esp. Gus Van Sant's version is horrible in retrospect.",
    "rating": "35",
    "date": "April 16, 2015"
  }
,
  {
    "reviewer": "Adrian P.",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/960907126/",
    "review": "  A ridiculous memento mori of an overhyped musician, who did his best to kill the music that made him famous. The only reason why this film exists, is because he made the smart career move of dying before his 15 minutes were up.",
    "rating": "10",
    "date": "April 16, 2015"
  }
,]