[

  {
    "reviewer": "Kevin M. W",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/787154086/",
    "review": "  Every now and again comes a film wherein all the characters are chasing something they want, and often that thing needn't be much of anything. So is the case here where we are introduced to several different types of folks, all in search of the same thing, in this case $2000, which may not seem like a lot now but back then was quite a lot. A nicely told tale.",
    "rating": "35",
    "date": "November 1, 2015"
  },
  {
    "reviewer": "Carlos M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/891372896/",
    "review": "  A more than impressive debut for John Maclean, who revisits the Western genre in an intense story about a long gone time of violence and death, showing the West in its raw brutality but with a lot of dark humor, and backed by a beautiful cinematography and great sound design.",
    "rating": "40",
    "date": "August 2, 2015"
  },
  {
    "reviewer": "Al S",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/200490042/",
    "review": "  A bold, exciting, fun and wonderfully original directional debut from Director, John M. Maclean. Maclean shoots like Wes Anderson and has the Coen Brothers gritty storytelling. A fresh, darkly comic and pistol-whipping western with heart and great characters. Kodi Smit-McPhee and Michael Fassbender are absolutely excellent. They have a charming and unique chemistry to them. I really enjoyed this movie its colorful edge, beautiful landscapes and compelling story. A sharp and vastly enjoyable movie.",
    "rating": "40",
    "date": "July 11, 2015"
  },
  {
    "reviewer": "Gimly M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/861960467/",
    "review": "  Not exactly a milestone in cinema, but still a great film, and one of the few examples I've seen recently of a movie that gets *better* as it progresses.",
    "rating": "30",
    "date": "August 22, 2015"
  },
  {
    "reviewer": "Harlequin68",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/900682338/",
    "review": "  In \"Slow West,\" Jay Cavendish(Kodi Smit-McPhee) wants nothing more than to be reunited with Rose(Caren Pistorius). Through sheer determination, grit and mostly just pure dumb luck, Jay has advanced as far as Colorado in 1870. That luck has just run out when he encounters a group of Indian hunters who are really not that picky who they kill. And that's where Silas(Michael Fassbender) enters the story, saving his life and then making a deal to guide him the rest of the way.\"Slow West\" is a wildly unpredictable and beautiful movie about the old west that shows the immigrants' dilemma in this new land of widespread violence.(This is a UK/New Zealand co-production which might account for the unique perspective.) So, while there was opportunity to be had for those willing, it did not come without more than its share of risks. This is highlighted well in the closing montage of all the characters who died in the film.",
    "rating": "40",
    "date": "June 8, 2015"
  },
  {
    "reviewer": "Jeffrey M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/906508836/",
    "review": "  An exercise in subtle, quiet, and poetic filmmaking, Slow West is a familiar western story done in an unfamiliar way. The film follows a teen boy, recently emigrating from Scotland, in search for a woman he loves. That woman, Rose, becomes that center of attention for numerous bounty hunters as her and her father become wanted over a supposed murder. First time director John Maclean gives an impressively mature feel to the film, which features a number of impressive performances, headlined by Michael Fassbender. He is able to find a unique tone of the film and stick with it, one that is matter-of-fact, oddly cold, and peculiarly disinterested with the triumph or failure of the characters. It's a movie that deals with themes of love and death, but in a nearly nihilistic way, with a sort of forlorn sensibility that permeates the story. There's fairly sparse dialogue, but some humor. It's a slow build, but also accented with moments of peak action.It's never dull, but Slow West is also never really enveloping. It borders on too detached; we don't feel tied to any one character. It's almost as if we're watching a documentary, we appreciate the realism, but fail to identify with the heart of the story.3.5/5 Stars",
    "rating": "35",
    "date": "October 25, 2015"
  },
  {
    "reviewer": "Alec B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/790680964/",
    "review": "  It's mostly a collection of odd affectations and digressions . . . some of which are amusing and others seem to exist purely to disguise the more predictable plot developments. Thankfully the ending holds enough surprises to make it an interesting, if still extremely flawed, anti-western.",
    "rating": "30",
    "date": "July 11, 2015"
  },
  {
    "reviewer": "Matt H",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/897795408/",
    "review": "  Too minimalist for its own good. Beautifully shot. Kind of empty. Michael Fassbender is wasted in a role that frankly doesn't require one of the best actors working today. An odd western.",
    "rating": "25",
    "date": "September 16, 2015"
  },
  {
    "reviewer": "JennabGreat",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/901953586/",
    "review": "  Slow West is one of the most realistic portraits of the old west on film yet it is unlike any western I have ever seen. Probably mostly because of this unique story. The direction is fantastic. Visually, it's unbelievable at times. Fassbender & Smit-McPhee are excellent. I wasn't expecting a lot from this one and I was left beyond delighted.",
    "rating": "45",
    "date": "August 21, 2015"
  },
  {
    "reviewer": "Jason D",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/785989309/",
    "review": "  Slightly slow but enough going on to make it not an unbearable indie bore. Some story flaws and voice over that is not fully developed, but various things make up for it. Climax sequence is really energetic and involving. A couple of super blatant symbolic things and some vague, though deep themes explored. In sum, a film with a lot of small flaws. But in this particular case, I think the positives outweigh the negatives. An indie film worth checking out.",
    "rating": "35",
    "date": "March 10, 2015"
  },
  {
    "reviewer": "Teemu P",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/803257979/",
    "review": "  Not the greatest western film but since there's not too many of them coming out nowadays I had to watch it. Pretty weird one but totally watchable.",
    "rating": "20",
    "date": "January 27, 2016"
  },
  {
    "reviewer": "Ethan L",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/854708289/",
    "review": "  A way better and more beautifully shot western than Hateful Eight, and in half the time. A",
    "rating": "45",
    "date": "April 23, 2015"
  },
  {
    "reviewer": "John D",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/217342012/",
    "review": "  Slow West is a flawed but interesting neo-Western, with a distinctly modern quirkiness elevating its less-solid characters. Kodi Smit-McPhee's naif Jay is interesting but infuriating as a lead, where Michael Fassbender's Silas is enigma who never quite comes into focus (some narration on his part doesn't help). But even if some of the dialogue is a bit stilted, the film builds to a brutally funny second act. It's only 85 minutes, and while it doesn't quite scratch the Western itch, its interesting and entertaining in its own way.",
    "rating": "30",
    "date": "January 18, 2016"
  },
  {
    "reviewer": "Bayard L.",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/901315217/",
    "review": "  The best Western since Unforgiven. Sweeping landscapes, a great cast, and stellar direction make this a modern western worth seeing.",
    "rating": "45",
    "date": "January 16, 2016"
  },
  {
    "reviewer": "Freddie K",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/927118589/",
    "review": "  At first, this seemed like a bleak attempt to become a soppy bond between a girl and a boy. But instead it produced a truly cruel and heartbreaking message about the tragedy that was the American Frontier whilst also giving insight to how society began to evolve and change for empathetic meaning. Michael Fassbender once again, excels. A tweak on the opening would've made this movie better I do think.",
    "rating": "40",
    "date": "January 15, 2016"
  },
  {
    "reviewer": "Brett H",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/794472835/",
    "review": "  Slow West is the debut feature film from writer/director, John Maclean and though the Western genre has been bled dry, the third act adds just enough to throw a twist on the familiar formula and the conclusion is shocking to say the least! The film stars Kodi Smit-McPhee as a Scottish teen (though he mysteriously has no accent) who's on a quest to find the love of his life, who is on the run due to her father's wrongdoings. Along the way, he crosses paths with Michael Fassbender, an outlaw who agrees to protect him; though he has intentions all his own and he is easily the best performance in the film. The movie is very grim and in many ways is a black comedy; the violence comes across as a mix between the Coen Brothers and Tarantino's styles, both startling and darkly funny. The film is pretty standard for the first two acts, but holy crap did the third act ever impress me with a climactic shoot-out that was filmed well and the resolution of McPhee's character is AMAZING; my jaw was on the floor for a solid minute. It's not a film I'd revisit anytime soon as the story is pretty basic and slow-moving (hence the title), but whenever there is on-screen violence, in particular, a scene in a trading post and the final shoot-out, it is extremely engaging and the cold irony of the ending is masterful!",
    "rating": "35",
    "date": "January 15, 2016"
  },
  {
    "reviewer": "bill s.",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/911733308/",
    "review": "  A different type western...a thinking mans western.Not for everyone and not the shoot 'em up some like but interesting and well acted.",
    "rating": "35",
    "date": "January 13, 2016"
  },
  {
    "reviewer": "ElmosLively",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/901062789/",
    "review": "  Stunning cinematography and some very decent performances highlight this almost lyrical tale of a young man's bizarre search for the woman he loves through the old west of the United States. Very well written and directed with a Shakespearean flare.",
    "rating": "40",
    "date": "January 8, 2016"
  },
  {
    "reviewer": "Jack W",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/912701970/",
    "review": "  Uninteresting story and characters bring the film down into the realm of boring despite being well made and having a good finale.",
    "rating": "20",
    "date": "January 8, 2016"
  }
,
  {
    "reviewer": "Teemu P",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/803257979/",
    "review": "  Not the greatest western film but since there's not too many of them coming out nowadays I had to watch it. Pretty weird one but totally watchable.",
    "rating": "20",
    "date": "January 27, 2016"
  },
  {
    "reviewer": "Ethan L",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/854708289/",
    "review": "  A way better and more beautifully shot western than Hateful Eight, and in half the time. A",
    "rating": "45",
    "date": "April 23, 2015"
  },
  {
    "reviewer": "John D",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/217342012/",
    "review": "  Slow West is a flawed but interesting neo-Western, with a distinctly modern quirkiness elevating its less-solid characters. Kodi Smit-McPhee's naif Jay is interesting but infuriating as a lead, where Michael Fassbender's Silas is enigma who never quite comes into focus (some narration on his part doesn't help). But even if some of the dialogue is a bit stilted, the film builds to a brutally funny second act. It's only 85 minutes, and while it doesn't quite scratch the Western itch, its interesting and entertaining in its own way.",
    "rating": "30",
    "date": "January 18, 2016"
  },
  {
    "reviewer": "Bayard L.",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/901315217/",
    "review": "  The best Western since Unforgiven. Sweeping landscapes, a great cast, and stellar direction make this a modern western worth seeing.",
    "rating": "45",
    "date": "January 16, 2016"
  },
  {
    "reviewer": "Freddie K",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/927118589/",
    "review": "  At first, this seemed like a bleak attempt to become a soppy bond between a girl and a boy. But instead it produced a truly cruel and heartbreaking message about the tragedy that was the American Frontier whilst also giving insight to how society began to evolve and change for empathetic meaning. Michael Fassbender once again, excels. A tweak on the opening would've made this movie better I do think.",
    "rating": "40",
    "date": "January 15, 2016"
  },
  {
    "reviewer": "Brett H",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/794472835/",
    "review": "  Slow West is the debut feature film from writer/director, John Maclean and though the Western genre has been bled dry, the third act adds just enough to throw a twist on the familiar formula and the conclusion is shocking to say the least! The film stars Kodi Smit-McPhee as a Scottish teen (though he mysteriously has no accent) who's on a quest to find the love of his life, who is on the run due to her father's wrongdoings. Along the way, he crosses paths with Michael Fassbender, an outlaw who agrees to protect him; though he has intentions all his own and he is easily the best performance in the film. The movie is very grim and in many ways is a black comedy; the violence comes across as a mix between the Coen Brothers and Tarantino's styles, both startling and darkly funny. The film is pretty standard for the first two acts, but holy crap did the third act ever impress me with a climactic shoot-out that was filmed well and the resolution of McPhee's character is AMAZING; my jaw was on the floor for a solid minute. It's not a film I'd revisit anytime soon as the story is pretty basic and slow-moving (hence the title), but whenever there is on-screen violence, in particular, a scene in a trading post and the final shoot-out, it is extremely engaging and the cold irony of the ending is masterful!",
    "rating": "35",
    "date": "January 15, 2016"
  },
  {
    "reviewer": "bill s.",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/911733308/",
    "review": "  A different type western...a thinking mans western.Not for everyone and not the shoot 'em up some like but interesting and well acted.",
    "rating": "35",
    "date": "January 13, 2016"
  },
  {
    "reviewer": "Harry A",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/788663314/",
    "review": "  A smashing little flick, full of style and characters.",
    "rating": "35",
    "date": "January 9, 2016"
  },
  {
    "reviewer": "ElmosLively",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/901062789/",
    "review": "  Stunning cinematography and some very decent performances highlight this almost lyrical tale of a young man's bizarre search for the woman he loves through the old west of the United States. Very well written and directed with a Shakespearean flare.",
    "rating": "40",
    "date": "January 8, 2016"
  },
  {
    "reviewer": "Jack W",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/912701970/",
    "review": "  Uninteresting story and characters bring the film down into the realm of boring despite being well made and having a good finale.",
    "rating": "20",
    "date": "January 8, 2016"
  },
  {
    "reviewer": "Brad S",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/873935102/",
    "review": "  Really fun take on the Western genre. Fassbender, Smit-McPhee, Mendelsohn and the rest of the cast all give first-rate performances and endear you to their quirky and interesting characters. The music, cinematography and production design all stand out. And of course the script is a solid foundation for everything to be built upon. Definitely a re-watch for me to pick up on the subtle details of various things.",
    "rating": "35",
    "date": "January 7, 2016"
  },
  {
    "reviewer": "Blake P",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/909783806/",
    "review": "  Westerns are better off when they're bleak, unrelenting, and quiet, introspective in their every move and always sweating from the violent anticipation that surrounds them. I'll take a Sergio Leone spaghetti western over a cheery Roy Rogers show any day; while I like the bright-eyed, Technicolor phoniness of the latter, the western doesn't feel like a genre one can truthfully execute without hanging gloominess mixing into the cocktail of bullets, black coffee, and unbreakable attitudes.  So \"Slow West\" is made all the better because it combines the best qualities of both, presenting us with a dreamy, roundly pigmented world where everything looks as pretty as an Old West Norman Rockwell might have envisioned, but, in reality, still holds as many murders and double-crosses as the world Billy the Kid lived in. It is an example of conscientious filmmaking that holds grittiness in as high of a regard as stylistic, Douglas Sirk artifice. The film is opulent on the eyes and is often times provocative in its storytelling characteristics. But I'm more infatuated with \"Slow West\" on a visual level than I am on an emotional one; I hold its fashionable exterior in higher esteem than I do the film itself. But that doesn't dampen what it achieves artistically. It focuses on Jay Cavendish (Kodi Smit-McPhee), a Scottish teenager roaming the Western frontier in hopes to stumble upon Rose Ross (Caren Pistorius), his alleged love who has gone missing for reasons muddled to him. His trek finds a companion in Silas Selleck (Michael Fassbender), a bounty hunter whose motivations are unclear. During their journey do they run into various suspicious personalities as threatening as they are to each other; their partnership is hasty, and neither knows much about the other - their getting acquainted promises an eventual (and perhaps mandatory) violent showdown. A perceptive ambience keeps \"Slow West\" from turning into another seen-it-all-before western, its picturesque coloring and tendency to delve into black comedy territory making it a cabinet of curiosities that stands as one of the most memorable directorial debuts of the year, coming from musician turned filmmaker John M. Maclean. Comparable to Tarantino in the sense that there is an unmistakable admiration for cinema deep within his soul, every shot in \"Slow West\" is sensorily delicate, the landscape of the Old West appearing as a detailed canvas painting of intimate refinement. The story doesn't always match the astounding elegance of the film's sheen, but the actors are well-cast, and Maclean's compact handling of everything leaves an impression. There is no doubt that he'll go on to make bigger, more impactful films - just wait until he's in the shoes of a Colin Trevorrow or a Rian Johnson, starting off small until the big time hits him like a mallet.",
    "rating": "30",
    "date": "May 16, 2015"
  },
  {
    "reviewer": "Dan A",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/904895873/",
    "review": "  When this started and the logos for Film 4 and BFI faded onto the screen, my expectations were immediately lowered because British films are, well...British films. By the end of the movie though I was nicely surprised. I think it's a little too short and would have liked some expansion on the two lead characters, as they aren't given much time, if any at all to develop. But the film itself blends quirky humour and landscape porn with really unexpected but satisfying graphic violence. Even I was a little taken back with how out of hand things got. There's also a bit of editing at the end where shots of all the lifeless, bloody bodies of characters who were killed during the story are stitched together nonchalantly, which I found quite brilliant and impactful. The story itself is told in such a casual way you almost feel like you're watching a dream or desert mirage. This is sharply contrasted whenever violence breaks out and it really wakes you up. Quite a strange viewing experience but I liked it a lot. My main criticism would be the performance of Kodi Smit-McPhee as the young lead. I thought he was wooden and could have been more expressive, and I didn't really buy him. Overall though this is an odd but fulfilling film that will leave an impression.",
    "rating": "35",
    "date": "January 6, 2016"
  },
  {
    "reviewer": "Glenn M.",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/970916136/",
    "review": "  Slow West is a movie I had heard a lot about when it came out, and due to it being a Western I thought well there isn't the greatest chance I will personally like this... but wrong I was. It came onto Netflix in the UK recently and I decided to give a shot, no pun intended. I had a lot of fun with Slow West and to be frankly honest it is one of the better smaller movies I have seen in a long time. Slow West is roughly 90 minutes long and because of this it doesn't drag along at a slow pace it just keeps on moving which is a good thing. Michael Fassbender does what he does in every movie and that is completely beast everything, by god that man is a force to be reckoned with on the acting front. Kodi Smit-McPhee is also great in this movie and gives a very mature and layered performance. Another great thing about Slow West is the location settings, they are so beautiful. There were so many shots in this movie that I was in awe at due to the beauty of the landscapes, and it added a lot to the spectacle of the movie.The main thing I loved about Slow West was the back and forth between Fassbender and Smit-McPhee it was so natural and believable. The back and forth was also hilarious at times which surprised me even more. The action in Slow West was also handled very well and impressed me especially in the third act of the film. If you are a lover of western style movies you will love Slow West. If you also a lover of comedic road trip movies you will also love Slow West. Give this movie a chance, I'm glad I did!",
    "rating": "45",
    "date": "January 5, 2016"
  },
  {
    "reviewer": "robert b",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/936259343/",
    "review": "  this movie was garbage. slow plotline, boring sequences. honestly i could barely remember any of it at all. everyone dies in the end but its still not very interesting, because you never really cared about any of them to begin with",
    "rating": "05",
    "date": "January 5, 2016"
  },
  {
    "reviewer": "Kenny D",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/915482851/",
    "review": "  As always Michael Fassbender delivers an awesome performance.The rest of the actors are awesome as well but Fassbender brought me here and carried it for me.",
    "rating": "35",
    "date": "January 4, 2016"
  },
  {
    "reviewer": "Elgan D",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/786812305/",
    "review": "  Despite the title this is a brisk and also short western featuring Fassbender in another more indie role which punctuate his fine blockbuster based career. A strong and occasionally funny script which is built around a fairly straightforward idea.",
    "rating": "35",
    "date": "January 4, 2016"
  },
  {
    "reviewer": "Facebook U",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/926262032/",
    "review": "  It is slow, but the scenic locations and the unfaltering, occasionally witty story make for a simple yet vastly enjoyable Western tale, with a tight runtime to boot.",
    "rating": "40",
    "date": "January 2, 2016"
  },
  {
    "reviewer": "Iulia N",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/817568296/",
    "review": "  When in doubt raid Michael Fassbender's filmography",
    "rating": "50",
    "date": "January 2, 2016"
  },
  {
    "reviewer": "Grzegorz K",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/833273207/",
    "review": "  3,5/5 Like it a lot!",
    "rating": "35",
    "date": "December 23, 2015"
  }
,
  {
    "reviewer": "Adam A",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/906994066/",
    "review": "  Delivers as the title promises. Irony, blood, and love aplenty.",
    "rating": "40",
    "date": "December 21, 2015"
  },
  {
    "reviewer": "Jeremy Z",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/932550435/",
    "review": "  Slow West is a great film. it has this great ethereal quality about it and there is a scene at the end that literally \"rubs salt in the wound\" LOL",
    "rating": "35",
    "date": "December 16, 2015"
  },
  {
    "reviewer": "Matthew P",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/967212911/",
    "review": "  One way to tell if a movie is bad, it gets a 92% rating on Rotten Tomatoes. I swear every movie that's had a good score on this site turns out to be a bad movie like Lincoln - the worst movie ever (high ratings on Rotten Tomatoes). This movie is no exception. Bad directing, bad camera work, lifeless characters, poor acting with unconvincing accents and the whole thing looks like it was shot in a rain forest in New Zealand! Thats funny, I didn't know there were many rain forests in western America. Its basically a low budget Lord of the Rings backdrop played by people with cowboy hats on. Boring as hell!",
    "rating": "05",
    "date": "December 14, 2015"
  },
  {
    "reviewer": "Logan D. M.",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/970115043/",
    "review": "  Kind of cutesy for a western, but \"Slow West\" is a pleasant and stylized approach to the familiar genre.",
    "rating": "35",
    "date": "December 4, 2015"
  },
  {
    "reviewer": "Victor M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/922288708/",
    "review": "  Western are uncommon nowadays, an UK - New Zealand one more uncommon too. Though \"Slow West\" is more than a western a great story supported in a as usual suited performance of Michael Fassbender.",
    "rating": "45",
    "date": "December 10, 2015"
  },
  {
    "reviewer": "Erwin J",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/789634883/",
    "review": "  Pour Salt in an open wound.",
    "rating": "25",
    "date": "December 6, 2015"
  },
  {
    "reviewer": "Robert B.",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/965766352/",
    "review": "  Great western with the tradiotinal style, about a young scotish man that goes to America to find a girl and meets this gunslinger on the way. Solid plot around the core story, good actings and photography, great locations (all in Scotland an NZ by the way) A great title to thoose that miss the tradional western movies. 7,5 / 10,0",
    "rating": "35",
    "date": "December 6, 2015"
  },
  {
    "reviewer": "JH K",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/899933104/",
    "review": "  Me encantan este tipo de slow pace westerns.",
    "rating": "40",
    "date": "December 5, 2015"
  },
  {
    "reviewer": "Paul N",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/935595278/",
    "review": "  Absolutely magnificent.....shades of 'The Assassination Of Jesse James By The Coward Robert Ford' (with Brad Pitt) in the way it's shot and the pace of the film..... Love Westerns and blinding film making = see this!",
    "rating": "45",
    "date": "November 29, 2015"
  },
  {
    "reviewer": "Tatsuhito K",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/906702164/",
    "review": "  An interesting blend of the Western, comedy, romance, and violence, kudos to first-time writer-director John M. Maclean for coming up with an inventive Western. Slow West is an genre-defying film with gorgeous cinematography and a talented cast.",
    "rating": "40",
    "date": "November 28, 2015"
  },
  {
    "reviewer": "Niels S",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/807521742/",
    "review": "  Ganske vellykket antiwestern, der b�de saluterer og peger fingre ad Hollywood.",
    "rating": "35",
    "date": "November 28, 2015"
  },
  {
    "reviewer": "Eric M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/786640659/",
    "review": "  One of the reviews for this film said it moves along briskly and feels much like a folk song. I'd say that is pretty accurate. This is an odd movie with some weird writing at points, but overall was very well crafted. Above all, the shots were beautiful and juxtaposed against the sadness and dreamlike feel of the film.",
    "rating": "40",
    "date": "November 27, 2015"
  },
  {
    "reviewer": "Quincy T",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/883219230/",
    "review": "  A display of contrasting moral and deceptively funny journey to the west.Slow West is a very humble and honest title, the movie delivers exactly that, a road trip in the wild west with an innocent man, a bounty hunter and all sort of outlaws. The pace has a resemblance to Tarantino's movie, surprisingly Inglorious Basterds not Django Unchained. It has a deliberate screenplay that focuses on few characters at a time and calmly set the tone for western thriller.Jay Cavendish (Kodi Smit-McPhee) is a man searching for his lost love. Alone in the cruel western frontier, he immediately crosses path with Silas (Michael Fassbender). Silas has been exposed to the way of the gun for too long and he's pretty sarcastic about Jay's quest. Nevertheless, he takes a sum of money for protection and the two ride off to west while meeting unsavory characters at every stop. These two leads produce strange buddy chemistry due the contrast in personalities. Viewers would easily be sympathetic to the worn out Silas and the incredibly optimistic Jay. The pacing and screenplay are splendid, it's admittedly not fast, yet it introduces the sequences with laid back attitude. This is a very refined approach, since there are heavy themes like murder or abandonment in evidently lighthearted manner. However, the movie never becomes too melodramatic or theatrical, keeping a very accessible tone, down to its darkest scenes.It's unequivocally good how it even maintains some nifty humor along the way. From the proverbial and literal salt on the wound to some near slapstick moments, they never seem to deter the seriousness. In fact it goes hand in hand with the rather brutal tendency, in which there's a plenty of it here, glorious gunslinger action and all that chaotic blood, this is still the wild western frontier.Slow West is the type of movie one can pick up and be immersed in the journey. It's an indication of how sophisticated the production is, delivering heavy subjects and still able to create satire and adoration for the characters.",
    "rating": "35",
    "date": "November 26, 2015"
  },
  {
    "reviewer": "Nick C",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/972195847/",
    "review": "  What a brilliant western movie Slow West was!",
    "rating": "50",
    "date": "November 21, 2015"
  },
  {
    "reviewer": "finlaybuchanan",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/908240562/",
    "review": "  Reasonably enjoyable film but nothing special.",
    "rating": "20",
    "date": "November 14, 2015"
  },
  {
    "reviewer": "Reece L",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/888687546/",
    "review": "  Slow West is by no means a vital film. There's no overarching point, there isn't any sort of poignant social commentary (aside from the struggle for survival and the displacement of Native Americans, both inherent to the genre), and its central narrative largely amounts to very little. That said, it makes for an entertaining 84 minutes, the sporadic moments of humor keeping the pace breezy enough to accommodate the smatterings of violence, and the precious, cutesy visuals managing to look nice without becoming irritating. The ending is tonally inconsistent with the rest of the film, and while it's entertaining to watch (and contains a great visual gag), it would've tanked the whole thing had the previous hour not been so simple and fun.",
    "rating": "35",
    "date": "November 11, 2015"
  },
  {
    "reviewer": "Screen F.",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/971923862/",
    "review": "  Great acting and some good action, but the story could use some tweaking.",
    "rating": "35",
    "date": "November 8, 2015"
  },
  {
    "reviewer": "Garrett S.",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/970719483/",
    "review": "  Slow West is a neat little film set in the old west. Michael Fassbender is great as usual and the cinematography is great. the dark humor hits the mark. The drunk scene was a little bad but other than that not much to complain about. 3.7/5",
    "rating": "35",
    "date": "October 30, 2015"
  },
  {
    "reviewer": "Kevin M. W",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/787154086/",
    "review": "  Every now and again comes a film wherein all the characters are chasing something they want, and often that thing needn't be much of anything. So is the case here where we are introduced to several different types of folks, all in search of the same thing, in this case $2000, which may not seem like a lot now but back then was quite a lot. A nicely told tale.",
    "rating": "35",
    "date": "November 1, 2015"
  },
  {
    "reviewer": "Kelly B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/905514689/",
    "review": "  i love me some indie westerns",
    "rating": "40",
    "date": "October 26, 2015"
  }
,
  {
    "reviewer": "Phillip Z",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/835284471/",
    "review": "  Despite the fact that it's more than a little bit pretentious and slow, Slow West is nonetheless a spectacularly well executed Western with enough old school grit mixed with new school visual style to be gripping for most viewers. If you tune in for nothing else, tune in for Fassbender's ridiculously good transformation into a cowboy as compelling as anything John Wayne ever did.",
    "rating": "40",
    "date": "August 28, 2015"
  },
  {
    "reviewer": "Jeffrey M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/906508836/",
    "review": "  An exercise in subtle, quiet, and poetic filmmaking, Slow West is a familiar western story done in an unfamiliar way. The film follows a teen boy, recently emigrating from Scotland, in search for a woman he loves. That woman, Rose, becomes that center of attention for numerous bounty hunters as her and her father become wanted over a supposed murder. First time director John Maclean gives an impressively mature feel to the film, which features a number of impressive performances, headlined by Michael Fassbender. He is able to find a unique tone of the film and stick with it, one that is matter-of-fact, oddly cold, and peculiarly disinterested with the triumph or failure of the characters. It's a movie that deals with themes of love and death, but in a nearly nihilistic way, with a sort of forlorn sensibility that permeates the story. There's fairly sparse dialogue, but some humor. It's a slow build, but also accented with moments of peak action.It's never dull, but Slow West is also never really enveloping. It borders on too detached; we don't feel tied to any one character. It's almost as if we're watching a documentary, we appreciate the realism, but fail to identify with the heart of the story.3.5/5 Stars",
    "rating": "35",
    "date": "October 25, 2015"
  },
  {
    "reviewer": "Duncan C",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/877944711/",
    "review": "  Deliberately paced Western with a distinct Coen-esque vibe.",
    "rating": "40",
    "date": "October 25, 2015"
  },
  {
    "reviewer": "Kirby P",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/933137789/",
    "review": "  If a western made in Italy is called a spaghetti western, what do you call a western made in New Zealand? A kiwi western? Whatever, this is an excellent movie.",
    "rating": "50",
    "date": "October 19, 2015"
  },
  {
    "reviewer": "Anthony K",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/907023216/",
    "review": "  Slow West is a thoughtful, well-shot film with requisite period piece accuracy and strong turns by its protagonists (Michael Fassbender & Kodi Smit-McPhee). I'm not sure it entirely warrants the critical acclaim, as the pacing is occasionally bogged down by episodic passages, but it is a worthy watch for genre fans.",
    "rating": "35",
    "date": "October 11, 2015"
  },
  {
    "reviewer": "Eduardo B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/907446744/",
    "review": "  Candid, but not memorable",
    "rating": "25",
    "date": "July 10, 2015"
  },
  {
    "reviewer": "Stephen D",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/812356858/",
    "review": "  If ever there was an ultra American genre, the Western would be it. And even though John Maclean isn't a gun-totin' western cowboy himself, he surely plays by the rules when it comes to directing them.'Slow West' might have a (deliberate) pacing problem (surely those horses can gallop right?) and the outlaw narrative offers nothing we haven't seen before, but still this little flick manages to impress at times.It's exquisitely shot and packs a wallop of a dark comedic punch in its shoot out finale. Worth seeing, however if you're not a fan of the genre, this won't make you change your mind.",
    "rating": "30",
    "date": "October 16, 2015"
  },
  {
    "reviewer": "Daniel D",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/927753198/",
    "review": "  Um jovem rapaz faz uma viagem pelos EUA em busca de seu amor que est� foragida da europa por ter matado seu pai por engano.... no final ele acaba entrando em um tiroteio com todos aqueles que buscavam a recompensa paga por sua amada e o pai dela e por azar acaba morto por ela..",
    "rating": "40",
    "date": "October 11, 2015"
  },
  {
    "reviewer": "Charlie M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/922171720/",
    "review": "  A compelling story with a unfulfilling ending.",
    "date": "October 10, 2015"
  },
  {
    "reviewer": "Tanvir M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/916820917/",
    "review": "  A minimalist Western (ironically shot in UK and NZ!), this was a visual treat. Fassbender makes a great outlaw, and the story turns out quite bleak, but it's a great ride all the way.",
    "rating": "40",
    "date": "September 30, 2015"
  },
  {
    "reviewer": "Steven L",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/783914004/",
    "review": "  This is a new take on the Western film, bringing immigrants into the mix of the lawless West. Kill or be killed seems to be the winning strategy as a wealthy British teen searches for this true love in a convoluted quest.",
    "rating": "30",
    "date": "September 27, 2015"
  },
  {
    "reviewer": "Matt H",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/897795408/",
    "review": "  Too minimalist for its own good. Beautifully shot. Kind of empty. Michael Fassbender is wasted in a role that frankly doesn't require one of the best actors working today. An odd western.",
    "rating": "25",
    "date": "September 16, 2015"
  },
  {
    "reviewer": "Rangan R",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/905667511/",
    "review": "  Going across the Atlantic to find the lost love.A western movie set in the 1870 United States, but entirely shot in the New Zealand. The story of a 16 year old boy, Jay, from Scotland embarks a journey in the New World in search of his love, Rose. Later a bounty hunter joins him and makes sure his safe travel. Technically, it was a road movie, but reveals the plot from the other angles as well in the spare times like during camping at the nights.The narration was too slow and the story was ordinary, but it was enough for me to get engaged. If you wait until the final scene, especially till you figure out the puzzle of the romance theme, you may like it better. The end was so good, just like what a western movie fan looking for, a gunfight. Interestingly, that was not to be heroic, except all the earlier disasters pushed for the finale and the post finale. It is rated R, because it is so brutal in some way and for being faithful to the genre.It might not be a dream debut for the director like the big cast, the high budget and a great commercial success, but giving a satisfying movie in a simple way was his accomplishment in his first attempt. Kodi Smith-McPhee is almost 20 and he's yet to play his independent and powerful enough character that will bring acknowledgement. It was a close one, the narration started like it was his, and he was everywhere in the movie. Then going further, especially when it nears the end, he was kind of fading. But he was awesome, along with Michael Fassbender. Not a must see, as well as not refusable if you get a chance to see it.7.5/10",
    "rating": "40",
    "date": "September 2, 2015"
  },
  {
    "reviewer": "Julius Grusas",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/968762959/",
    "review": "  This movie was excellent. Acting was great directing style by John Maclean was great. The score of the move was amazing. But the real star of this movie was cinematography it was just beautiful to watch. This movie was really funny and really emotional and preitty deep if you dig deeper. The feel of this movie and the tone was on point you could see director knew what he was doing. Writing dialogue screenplay was just great. The movie was really original and different and i love the movies like this where actions speak more than words type of movies something like drive type of movie. Slow West is art house movie which is great.",
    "rating": "45",
    "date": "September 14, 2015"
  },
  {
    "reviewer": "Diganta B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/854557977/",
    "review": "  Beautifully shot and acted.",
    "rating": "35",
    "date": "September 13, 2015"
  },
  {
    "reviewer": "Kyle G",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/966562441/",
    "review": "  Reminded me of a Wes Anderson movie in some ways. Very well made. Good story, superb acting, cinematography.",
    "rating": "40",
    "date": "September 7, 2015"
  },
  {
    "reviewer": "Jay Sherman",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/971455048/",
    "review": "  Literally pouring salt on the wound right after FIGURATIVELY pouring salt on the wound... GENIUS!!!",
    "rating": "30",
    "date": "September 4, 2015"
  },
  {
    "reviewer": "Cole M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/800018900/",
    "review": "  I was close to giving it 5 our 5 stars, but it's incredibly short and some things could've been expanded on a little more. That being said, Kodi Smit-McPhee and Michael Fassbender have great chemistry together and the film itself amounts to a unique, likable and genre-defying Western.",
    "rating": "45",
    "date": "September 4, 2015"
  }
,
  {
    "reviewer": "Matthieu B.",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/971443123/",
    "review": "  A really good movie. It builds its intensity through the two firsts acts to give an very exciting outcome. Even if the ending wasn't as good as it could have been, it's a bold, solid and entertaining piece. Deserved to be recognized as a great western comeback.",
    "rating": "40",
    "date": "August 31, 2015"
  },
  {
    "reviewer": "Skyler G",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/28139572/",
    "review": "  Slow West (2015) - The modern resurgence of the Western genre gains a new addition in \"Slow West\". This film acts as a love letter to Westerns in more than one way, as the film catalogues the journey of a boy's travels across the western plains to find his one true love. Everything down to the narrative structure and short running time pays proper homage to Westerns of old except this one has a bit more of a unique edge. Adding Fantasy/Fairy tale elements alongside surrealist imagery really puts this movie over the bar for me this year. I found it hard to believe this was a debut for director John MacLean, simply because of how well executed this movie was in almost every facet. The key complimentary word I'd use to describe \"Slow West\" would be \"balance\". On the one hand, there's a wide eyed, innocence to this movie which interacts very well with the young love story being played out. However, this is juxtaposed against random bursts of violence which punctuate the tension of these lighter scenes perfectly. And of course, this film is well acted; casting Michael Fassbender in anything seems to be a sure fire win no matter what and the rest of the cast nail their respective roles as well. I think this Western, for all that it does well, won't resonate initially with audiences because of some odd, surrealist sequences that will go over most people's heads. Thankfully the 80 minute long running time will give you plenty of incentive to watch this thing more than once to fully understand all of it's majesty... For modern audiences, shorter running times may feel like a hindrance on the content of the movie but for those with an appreciation of the genre, this will surely be a nice treat. So if you feel like curing that Western itch with a refreshing twist of fantasy with one hell of an explosive climax, definitely check out this road trip in \"Slow West\". GRADE: B+",
    "rating": "35",
    "date": "August 30, 2015"
  },
  {
    "reviewer": "Wayne M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/795201274/",
    "review": "  Slow West is short but oh so impressive. Set in Colorado in 1870 we follow Jay, a young man from Scotland who is searching for his love. He is brave but not prepared for the travails ahead. But he meets Silas, played brilliantly by Michael Fassbender, who guides him through. This is a western but not a typical one. It is emotionally rich as well as dramatically exciting. It is magnificently shot, it was also filmed in New Zealand, and full of surprising moments and deft touches. It didn't receive a cinema release in Sydney but it is better than 90% of films you will see this year.",
    "rating": "40",
    "date": "August 30, 2015"
  },
  {
    "reviewer": "Eric B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/782112202/",
    "review": "  Brilliantly-colored and beautiful cinematography; lean, efficient scenes; a darkly hilarious and unexpected denouement.",
    "rating": "45",
    "date": "August 29, 2015"
  },
  {
    "reviewer": "Russell J",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/964718251/",
    "review": "  Really quirky, fun revisionist western.",
    "rating": "40",
    "date": "August 22, 2015"
  },
  {
    "reviewer": "John M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/905563445/",
    "review": "  Getting west was a little too slow.",
    "rating": "30",
    "date": "May 4, 2015"
  },
  {
    "reviewer": "Gimly M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/861960467/",
    "review": "  Not exactly a milestone in cinema, but still a great film, and one of the few examples I've seen recently of a movie that gets *better* as it progresses.",
    "rating": "30",
    "date": "August 22, 2015"
  },
  {
    "reviewer": "JennabGreat",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/901953586/",
    "review": "  Slow West is one of the most realistic portraits of the old west on film yet it is unlike any western I have ever seen. Probably mostly because of this unique story. The direction is fantastic. Visually, it's unbelievable at times. Fassbender & Smit-McPhee are excellent. I wasn't expecting a lot from this one and I was left beyond delighted.",
    "rating": "45",
    "date": "August 21, 2015"
  },
  {
    "reviewer": "Harry W",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/891495465/",
    "review": "  Always fond of contemporary takes on the Western genre and any film featuring Michael Fassbender, Slow West cried out for my intrigue.Living up to its title, Slow West is ultimately a very slow film. Unfortunately, I cannot say that I felt it lived up to the \"west\" part of its name. Slow West doesn't really feel like much of a western. It seems like an experimental independent drama film which happens to contain some selective western iconography as the front for a series of vignettes depicting the events witnessed and stories heard by protagonist Jay Cavendish without much of a sense of developing narrative. They are strung together by transition scenes where the characters do little more than ride horses across the land at a pace matching the title of the film, and ultimately all the stylish imagery in the film fails to sustain itself if the story can't touch viewers. In essence, Slow West seems to capture a modicum of what western films are all about. It has small plot points and stylish elements iconic of the genre scattered loosely into the story to seem like an anthology of dot points delivering a simplistic explanation of what western cinema is all about. But the fact is that I know what it's about, and I don't like the direction that John Maclean takes it in because it doesn't feel appropriate. To compare Slow West to Jim Jarmusch's experimental take on the genre in Dead Man, the two films both have big name actors and a slow pace yet contrasting colour scehemes. Slow West is bright and Dead Man is dark. The fact is that the West itself is a a sunny place plagued by dirt and violence, so it would most appropriately meet somewhere in the middle. Yet Dead Man decided to take the iconography of the west and make a psychadelic film out of it, while Slow West takes it and makes an amateur production with a strange plot structure and a little much colour. It is a little too bright to match the true grit of the west and the genuine approach to violence that is taken by the film, creaing a sense of imbalance. And when it comes to the script in Slow West, there is too much talking and too little of interest in what the characters have to say. There isn't much of a sense of the individualistic freedom that characterises the Cowboy protagonists of the genre, rather just a collection of characters who have a varying understanding of what it takes to survive in the west. Ultimately, the narrative feels a little too simplistic and the dialogue just doesn't evoke many situations that reached me, so I feel like Slow West lacks sufficient understanding of what western cinema has historically represented.However, the one thing Slow West captures really well is the blunt nihilism of the setting. Though the somewhat thin character archetypes prevented me from finding much of a connection to the characters, the fact that they all represent nameless faces of the West reflects the grim nature of the story context well. Anyone could be killed at any second, and it's as simple as that. There are no melodramatic Hollywood goodbyes or deus ex machina plot devices to save them from the fate of death, they are just caught up in a game of the quick and the dead. In essence, that's what the west is all about. And while the rest of the film may not expand upon the western universe as much as it could, the generally grim monotony of the experience does give the feature an effective mood.And the style of the film is genuinely nice. With a slower rate of progression than most western films, Slow West, proves to be a gentle experience much of the time. It lacks the a consistently gritty punch, but it has some sporadic moment of intensity. What it does consistently maintain is an interesting visual style. The low budget nature of Slow West ensures that the scale of the narrative is very small and so it all takes place in a limited set of locations. The genuine plot structure of this may not be the most amusing, but the scenery and production design does evoke a sense of life in the narrative which prevents it from being too boring. It is all captured with nice cinematography and gentle editing as well, and these reach their endeavour during the shootout scenes in the film as the conventional approach to violence makes the experience all seem so bleak. And in essence, that's what violence is. Slow West depicts an understanding of concepts surrounding violence in the west, and its effective production values keep the experience lively.'Plus, the cast in Slow West really know what they're doing.Kodi Smit-McPhee is a decent lead. He does not have much of a great character as his inexperience makes him a character who has to learn in a narrative that hardly develops, but he conveys a sense of being an outsider in the world. He still has ambition and hope about him, unchanged by all that he witnesses throughout the story. This leads him to represent the naive young sheriff archetype of the postmodern western, and he does it with a consistent sense of monotonous spirit. Kodi-Smit McPhee doesn't have the strongest moments when it comes to genuinely saying anything, but the mood that his physical acting captures in the more silent moments of Slow West prove credible.Michael Fassbender delivers a solid performance. Though his screen time is significantly less than you would expect or hope for, Michael Fassbender delivers a solid job of characterizing Silas Selleck because he knows how to survive in the west and doesn't even flinch when it comes to gunshots. He conveys a sense of lost humanity which drives him to act normal in the face of violence, effectively sharing some entertaining moments with Kodi Smit-McPhee as he teaches the young gun what the west is truly about. Michael Fassbender's diminutive performance renders the most interesting character in Slow West.So Slow West benefits from the efforts of Michael Fassbender and a sense of blank nihilism, but it's overly simplified western ideology and poorly structured narrative leave little more than a dull script packed with too much dialogue that just fails to be of intrigue.",
    "rating": "20",
    "date": "June 10, 2015"
  },
  {
    "reviewer": "James D",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/781706651/",
    "review": "  As a long time fan of westerns, especially John Wayne and Clint Eastwood films, I've always had a soft spot for the genre. I often wished that I could take a time machine back and live in those kind of days, where justice was served with a revolver and not a gavel. But, like many old shoot em up western films, this one is similar and different at the same time. It has shades of the old style westerns, with a modern day color and more drama and dialogue then expected.Kodi Smit-McPhee plays the lead, a young Scottish boy who is traveling West across America to find his love, a young woman who is on the run with her Dad as they're wanted for murder of a complete accidental death. Along the way he encounters Native Americans, drunk bounty hunters, and scavengers with a thirst for blood. McPhee surprised me, I've never heard of the young actor, but what I witnessed was a damn good performance. The kid played the timid yet brave role perfectly, and it's hard to picture someone else playing it. Then comes one of my favorite actors the last 5 years, Michael Fassbender, playing the role of a bounty hunter who leads the boy in the right direction, knowing that when he helps him find his love, he can kill her and her father and retrieve the $2,000 reward. There isn't a lot more to say about the acting other than Fassbender and McPhee nailed their roles, and as for the supporting cast, they delivered as well.My favorite thing about this film is without a doubt the cinematography. The camera angles, the scenery and landscaping, all something worth watching. It makes you want to jump on a horse and ride into the mountains just to see how gorgeous it is. It is a beautifully structured film, and in my eyes one of the better of newly done westerns.Big props to John Maclean, the writer and director of \"Slow West,\" and his debut nonetheless. He did very well with the dialogue, the cameras, and the casting. The only small issue I had was the pacing of the film. At times it felt like it was dead in the water, more so about a quarter of the way through. That is kind of an issue considering the film is only 90 minutes long, and it seemed like it was about 120. If not for that small issue, this film would've received 4 stars from me and possibly a wide release into theaters. Other than that, I don't have many complaints. If you're a fan of westerns, this is for you. If you want a taste of the old style western films, this could be a good find, and it's also great for the newly found western watchers. 3.5/5 JD",
    "rating": "35",
    "date": "August 21, 2015"
  },
  {
    "reviewer": "Darren F",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/971266093/",
    "review": "  I don't know about it being Slow West, the film seemed more Stationary West. Half way through this film I found myself clock watching wondering when the ordeal would end. At the beginning I didn't pick up on the first thing that happened and I only realised about it at the end of the film when it all slowly started to piece itself together.",
    "rating": "05",
    "date": "August 19, 2015"
  },
  {
    "reviewer": "Matt G",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/906794753/",
    "review": "  Slow West is (gasp!) a SLOW western that definitely takes some getting used to. However, once you mosey into its pace, it sucks you in with its hypnotic tone and stunningly picturesque visuals. At times gritty and often very graceful, its quiet defense of boundless (if ill-advised) love is penetrated with subtly sharp humor and appropriately strong violence. A vibrantly colorful, fantastically storied cowboy outing.",
    "rating": "45",
    "date": "August 19, 2015"
  },
  {
    "reviewer": "Amir M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/911366836/",
    "review": "  Excellent, excellent film. Best movie I have seen this year for sure. Perhaps best movie I've seen in the past two or three years.",
    "rating": "50",
    "date": "August 17, 2015"
  },
  {
    "reviewer": "John V",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/859966160/",
    "review": "  Awesome cinematography and good story telling makes for a great modern western movie",
    "rating": "40",
    "date": "April 4, 2015"
  },
  {
    "reviewer": "Debanjan C",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/303236923/",
    "review": "  A very impressive debut from John Maclean, who serves a fast-paced, riveting Western that keeps you hooked to the proceedings. It's a simple story that has been extremely well told and one that unravels in a unique style. The culmination to this story is simply brilliant. It's a highly recommended film.",
    "rating": "40",
    "date": "July 28, 2015"
  },
  {
    "reviewer": "Dan B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/786234324/",
    "review": "  Not your average Western as it has a bit of an art-house vibe to it which not having not seen the trailer or read any reviews in advance, was a surprise to me. It plays out nicely with a smart script and stylish overtones. I like the fact that the running time was kept short too; the story was told satisfactorily and succinctly and there was no need for filler, many modern-day filmmakers should take note.",
    "rating": "40",
    "date": "August 16, 2015"
  },
  {
    "reviewer": "Johannes J",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/800113248/",
    "review": "  Werner: \"So, now...East. What news?\"Jay Cavendish: \"Violence and suffering. And West?\"Werner: \"Dreams and toil.\"",
    "rating": "40",
    "date": "August 4, 2015"
  },
  {
    "reviewer": "Johnny K.",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/969157382/",
    "review": "  Despite some on-the-nose foreshadowing/predictability as well as a problematic ending, Slow West manages to be quite entertaining due to emphasizing character development and strong dialogue, as well as blending solid performances with visually striking cinematography and action sequences. Verdict: B+",
    "rating": "40",
    "date": "August 15, 2015"
  },
  {
    "reviewer": "Seanser S",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/915525484/",
    "review": "  It's a quite well made, fairly enjoyable film. Fassbender is pretty good in it as is the young guy Kodi Smit-McPhee and there are some funny lines. It pales in comparison to Dead Man which I think it derives a lot of influence from.",
    "rating": "30",
    "date": "August 14, 2015"
  }
,
  {
    "reviewer": "Andrew E",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/871060658/",
    "review": "  While definitely a slow burn, 'Slow West' is one of the most beautiful Westerns ever filmed. There is something about Westerns that brings out amazing performances all around.",
    "rating": "45",
    "date": "August 13, 2015"
  },
  {
    "reviewer": "Oj H",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/905537159/",
    "review": "  it was better than average, but missed the Western perfection, I was hoping for. It was slow, and had trouble staying on point... however, it was a well characterized film, and the acting was solid. The direction was fine, cinematography too, as well as the writing. There was nothing that really stood out, aside from the odd ending, and color pallet of the film being really strange but good. It was a interesting take on the western... but missed keeping your attention. It was indeed a \"slow\" west.",
    "rating": "35",
    "date": "April 22, 2015"
  },
  {
    "reviewer": "Ricardo M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/899964245/",
    "review": "  um dos p�steres, que divide em quadros os personagens, refor�a a impress�o de que esse filme poderia ter sido uma transposi��o/adapta��o de uma graphic novel - ou, em �ltimo caso, a leitura de uma: a primazia da imagem, o ritmo lento e contemplativo, as digress�es, a jornada do her�i/protagonista, o desfecho apote�tico.",
    "rating": "40",
    "date": "August 12, 2015"
  },
  {
    "reviewer": "DJ B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/785627096/",
    "review": "  A really solid western flick. It's nothing too spectacular and does live up to its title at times (in a bad away). That said, there's nothing wrong with it whatsoever, and anyone who enjoys a good western flick would be smart to check out this lesser known film.",
    "rating": "35",
    "date": "August 12, 2015"
  },
  {
    "reviewer": "Michael M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/781717778/",
    "review": "  An idiosyncratic Western about the price of violence and the toll of misplaced value.",
    "rating": "45",
    "date": "August 10, 2015"
  },
  {
    "reviewer": "Hugo P",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/785163399/",
    "review": "  Nice tale, beautiful sceneries. That Jay Baruchel lookalike pretty good.",
    "rating": "35",
    "date": "August 7, 2015"
  },
  {
    "reviewer": "Ann S",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/906568331/",
    "review": "  Definitely titled correctly--very slowwww",
    "rating": "20",
    "date": "May 15, 2015"
  },
  {
    "reviewer": "Hung-Ya L",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/791999100/",
    "review": "  Michael Fassbender does not need plenty of lines to already be able to show what he can be and do. Slow West proves to be a truly amazing modern western that has pretty much every sense of beauty in every shot and every still. Looks like Kodi Smith-McPhee already has a promising future.",
    "rating": "50",
    "date": "August 4, 2015"
  },
  {
    "reviewer": "Carlos M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/891372896/",
    "review": "  A more than impressive debut for John Maclean, who revisits the Western genre in an intense story about a long gone time of violence and death, showing the West in its raw brutality but with a lot of dark humor, and backed by a beautiful cinematography and great sound design.",
    "rating": "40",
    "date": "August 2, 2015"
  },
  {
    "reviewer": "J B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/783444580/",
    "review": "  Wryly funny and tragic, \"Slow West\" is an impressive debut feature from writer-director John Maclean. A stylish neo-Western, \"Slow West\" has the narrative whimsy of a Wes Anderson film mixed with the gritty frontier aesthetic of the Coen brothers. While it evokes other influences, Maclean's film feels entirely distinctive and original.",
    "rating": "35",
    "date": "March 25, 2015"
  },
  {
    "reviewer": "Jack H",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/891178673/",
    "review": "  great movie I enjoyed it",
    "rating": "50",
    "date": "June 4, 2015"
  },
  {
    "reviewer": "Ankur B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/853016564/",
    "review": "  Small scaled but sincere, Slow West is a carefully crafted tale of the boundaries of love. The contrast in the two leads offers an interesting study of companionship. On one had, we see Jay, a young boy helplessly in love. Opposed to him is Silas, a former bounty hunter who has never known comfort or love. Ben Mendelson's imposing figure is another daunting feature of the film. For fans of spaghetti westerns, Slow West is a delicate treat.",
    "rating": "40",
    "date": "July 27, 2015"
  },
  {
    "reviewer": "Sam P",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/920113850/",
    "review": "  sweet and tasteful film mixed with strange and funny British sense of humor , beautiful story and enjoyable performances...A western road trip love story...",
    "rating": "45",
    "date": "July 27, 2015"
  },
  {
    "reviewer": "Madmartigan",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/901333002/",
    "review": "  Good, entertaining, strange western. Fassbender destroys it.",
    "rating": "35",
    "date": "July 26, 2015"
  },
  {
    "reviewer": "Blaine W",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/834138442/",
    "review": "  Poignant, thoughtful, and redemptive. I'm so grateful films like this one get made.",
    "rating": "50",
    "date": "July 26, 2015"
  },
  {
    "reviewer": "Johnny R",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/201047661/",
    "review": "  150725: A hidden gem. Loved it. Filled that western void I'm always experiencing and filled it well. Great characters though I would've liked to have seen the bounty hunters developed more. Unique, multifaceted story with fantastic costuming. Though may be a bit \"slow\" at times, features some intense action scenes and detailed cinematography. Wasn't happy with the final outcome but what can you do. Fassbender and Smit-McPhee played off each other so well and were excellent in their characters. Writing this review makes me want to watch it again, and I mean right now.",
    "rating": "45",
    "date": "July 10, 2015"
  },
  {
    "reviewer": "John Eric D.",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/966892496/",
    "review": "  At first I was like Okay, I've seen this before. Kinda over dramatic Love story in a western theme. But things get seriously interesting. I never thought it could be as fun as hell. The latter parts are the most awesome parts of the movie. I freaking love it! Not only the breathtaking views of the western setting and those beautifully shot scenes. But also the clever and poetic dialogue, and well constructed story line. I love the characterization in this film. You somewhat care for those characters. A short but somehow a I was very satisfied from what I saw. Love this one!",
    "rating": "40",
    "date": "July 6, 2015"
  },
  {
    "reviewer": "Kristi M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/956100698/",
    "review": "  It's remarkable that a movie that is indeed slow and low budget is still intriguing to watch. It takes the Western and removes the typecast untouchable gunslinger and instead focuses on the interactions of people.who are both good and bad lost together in an uncertain and lonely frontier. It's a black comedy no doubt and I was caught off guard several times when I didn't expect to laugh out loud with some of the random moments. Slow West captures a sort of confused wonder at unfamiliar surroundings and people that cross paths with each other forming unlikely alliances because they don't see other people very often and the vastness of the landscape and loneliness gets the best of them. From the beginning I caught the foreshadowing and predicted the end but throughout the movie I started guessing a few other possible scenarios as the characters interacted so I did like the fact that it kept me guessing. There was a lot of subtle symbolism and some not so subtle symbolism...the salt was a bit of overkill. Otherwise though this was a pleasant surprise.",
    "rating": "40",
    "date": "July 23, 2015"
  },
  {
    "reviewer": "Graham N.",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/970972605/",
    "review": "  I will admit, slow west had some great moments and some memorable actors like Michael Fassbender and Kodi Smit-McPhee however, the begining of the movie wasn't as exiting as I thought it was going to be. It took me quite some time to get into and the dialogue didn't improve majorly as the movie progressed. I think that this independent film doesn't deserve this generous rating.",
    "rating": "30",
    "date": "July 23, 2015"
  },
  {
    "reviewer": "Syed R",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/852030256/",
    "review": "  Beautifully shot, extremely well acted by Fassbender and Kodi Smit-McPhee, and has the western aesthetic down to a tee. This easily deserves to be up there with the best.",
    "rating": "45",
    "date": "July 22, 2015"
  }
,
  {
    "reviewer": "Isaiah F.",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/965274991/",
    "review": "  A very flawed little film.",
    "rating": "30",
    "date": "July 22, 2015"
  },
  {
    "reviewer": "Ola G",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/790840760/",
    "review": "  Jay Cavendish (Kodi Smit-McPhee), a Scottish high born boy, travels to the United States to search for his love, Rose Ross (Caren Pistorius). He runs into a group of former soldiers who chase and attempt to kill a Native American. The leader of the soldiers question Jay's ethnicity while his group continues the chase. A bounty hunter Silas Selleck (Michael Fassbender), arrives and kills all the soldiers. Jay pays Silas for protection and reveals his connection to Rose. They stop at a trading post for a meal where, unbeknownst to Jay, Silas sees a wanted poster offering a $2000 bounty for Rose and her father John (Rory McCann), and plans to use the boy to get to his bounty. Another man, Victor the Hawk (Edwin Wright), leaves just as Jay and Silas arrive and also takes notice of the poster. Shortly after they arrive at a trading post for a meal, a Swedish man and woman attempt to rob the place for money. The owner kills the man, but gets shot by the woman. Jay shoots the woman in the back, killing her. The two hastily gather some provisions and leave, and are shocked to find the couple's children waiting outside. Jay silently put down some clothes and food in front of the children, then leaves with Silas. A series of flashbacks reveals that Rose was aware of Jay's affection, but only cared for him as a \"little brother\", and was unswayed by his claim that he was the best match she would be able to find, due to her low social standing in comparison to him. One evening, he sneaked to her house, and she hid him her bed when John got home. Jay's uncle, Lord Cavendish, came to retrieve Jay. After he called Rose a peasant and slapped her, John angrily pushed him away, accidentally killing him when Lord Cavendish hit his head on a rock. Afterwards, John and Rose left for America, leaving Jay wracked with guilt. Will Jay finds Rose? And will their relation change as he has shown her how much he loves her by coming all the way to America after her?Bilge Ebiri of New York magazine said that it is \"an absurdist, melancholy coming-of-age tale that jumps from odd comedy to striking violence to stirring reflection\". \"Slow West\" made me think of \"The Assassination of Jesse James\" in terms of pace and structure, but as well of The Coen Brothers \"True Grit\". However, \"Slow West\" has a narrative that borders to surrealism and a dreamlike atmosphere/state and that gives us a very specific type of western avoiding the classic set up of a western. The violence is quite sudden and what we see is an unforgiving western where death doesn�t matter that much, it�s just part of life and it all comes down to protecting your own life and your valuables. Desperation feeds desperate actions and it�s not always pretty. But, humour is part of this tale as well and the oddness between the different layers works well, but not all will be pleased with this sort of film and narrative. The cinematography is quite beautiful, but minimalistic in approach and result most of the times. The feeling of isolation from life, mankind and humanity lingers over the film and the feeling of lost love becomes of course the pillar. Kodi Smit-McPhee and Michael Fassbender has good chemisty and when the beautiful and tough as nails Caren Pistorius finally shows up properly we get a great final part of the film that ends in a memorable way.",
    "rating": "40",
    "date": "July 22, 2015"
  },
  {
    "reviewer": "Jason C",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/915936926/",
    "review": "  What stands out the most in this movie is the look of it, excellently shot. The acting is very good, as always Fassbender and Mendelsohn are great. It does feel slow at times even though there is a lot going on leading up to the end which delivers a very satisfying and not so predictable conclusion.",
    "rating": "35",
    "date": "July 21, 2015"
  },
  {
    "reviewer": "Steven H",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/783120752/",
    "review": "  Slow West delivers itself to the name. A slow methodical wake that blends the love story in with the outlaw western. Its creative take on the old western and is undone by attempting to attract the symbolism of old Hollywood westerns. Its flaws are only seen in its unimpressive character development and its digression using the 'Hollywood Indian'. Fassbenders true talent is his acting but chemistry is lacking in what can be said as a story with great potential.",
    "rating": "35",
    "date": "July 20, 2015"
  },
  {
    "reviewer": "Ra&#xFFFD;l Z",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/970942917/",
    "review": "  That kid was a wonder. He saw things differently. To him, we were in a land of hope and good will.",
    "rating": "40",
    "date": "July 20, 2015"
  },
  {
    "reviewer": "Ryan B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/926750511/",
    "review": "  This could have been the next Django Unchained. Could've.",
    "rating": "30",
    "date": "April 19, 2015"
  },
  {
    "reviewer": "Caleb B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/783177530/",
    "review": "  Just a quick review here, Slow West is one of those Indie films in redbox I have wanted to catch up with before I do my best films of 2015 so far. Anything with Michael Fassbender in it is worth seeing and am also a big fan of the always gruesome Ben Mendelsohn. Violence is present throughout.Slow West is an unusual Western about a young Scottish man/boy, Jay (Kodi Smit-McPhee), who is in love and due to a tragedy that he claims to be his fault, his love had to flee to the West. On his way to the west Jay has a run in with some men having a \"hunting party\" for Indians. At gunpoint and not knowing what to do, Jay is rescued? by Fassbender's character, Silas. They agree to a deal where Silas will protect and lead him to the West for a hundred dollars. Along the way the audience learns that Silas is truly just using Jay in a diabolic way, and that Jay's love Rose and her dad, have a $2,000 bounty on their bodies and Silas wants to collect.On their way, encounters with Bandits and people of many kinds are frequent. Silas also learns a lot about Jay and sometimes seems to becoming fond of him but you are never really sure if Silas is using or helping Jay. Narrating, Silas says about Jay \"That kid was a wonder. He saw things differently. To him, we were in a land of hope and good will.\" The uncertain relationship and even at times, a seeming mentor-ship between Silas and Jay is a component in Slow West that outright works. Will Silas help Jay save his gal or will Jay unknowingly lead Silas to his gal?Slow West is propelled by its great characters and cast. First time writer and director John Maclean has full control of this film and while it may be too slow for some, he succeeds in getting the audience to its inevitable finale caring about the characters and their fates. Overall throughout the film I was only mildly compelled by Slow West and without the intriguing characters, I would of been uninterested. That's what Fassbender and McPhee are their for, tremendously portrayals of their well written characters.While Slow West will most likely miss my top 5 of 2015 so far list, it was an interesting and different look into the West. Hold on and focus on the characters to get you to the extremely effective and absorbing ending.",
    "rating": "35",
    "date": "July 19, 2015"
  },
  {
    "reviewer": "Magnus S",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/885747644/",
    "review": "  Enjoyable and darkly humorous western.",
    "rating": "35",
    "date": "July 19, 2015"
  },
  {
    "reviewer": "Troy K",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/898358222/",
    "review": "  Not a very exciting movie, but way above average and I liked it.",
    "rating": "40",
    "date": "July 18, 2015"
  },
  {
    "reviewer": "Adrian S",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/792478225/",
    "review": "  A smart, darkly-funny and thrilling debut that revisits the Western genre, yet offering a fresh take with a well-crafted plot and stunning imagery.",
    "rating": "40",
    "date": "February 8, 2015"
  },
  {
    "reviewer": "Becky F",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/804005532/",
    "review": "  An interesting western, I do love myself some Fassbender.",
    "rating": "30",
    "date": "July 16, 2015"
  },
  {
    "reviewer": "Patricia M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/924142989/",
    "review": "  It is slow all right. Not a 91 by any means!! I think more like a 45.",
    "date": "July 16, 2015"
  },
  {
    "reviewer": "KipNoxzema",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/901089032/",
    "review": "  Very violent movie with nothing to offer the viewer. Nothing.",
    "rating": "05",
    "date": "July 16, 2015"
  },
  {
    "reviewer": "Mikey S.",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/970621380/",
    "review": "  Wow, what an amazing directorial and writing debut from John Maclean! The film took us into a mysterious adventure into the West lead by a superior cast of such talented actors like Fassbender and Smit-McPhee. This movie was very enjoyable, and showed a lot of promise for how utterly magnificent this director can be. While it had some minor flaws such as the lack of character depth of Rose and her father, some of it actually worked better towards its plot. The cinematography and shot compositions were also right on the money. Fantastic Job! 4.5/5",
    "rating": "45",
    "date": "July 15, 2015"
  },
  {
    "reviewer": "Enze Z",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/922255919/",
    "review": "  I just can't believe this is his first movie, so freaking good",
    "date": "July 15, 2015"
  },
  {
    "reviewer": "Carlos I",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/943671690/",
    "review": "  A different approach to the western genre. The cinematography is great, this film is gorgeous and vibrant, it simply is beautiful to look at. The story is simple, yet very entertaining. I loved how there was a lot of humor in the midst of all the danger, carnage and tragedy in a movie that's essentially about an innocent, naive, young boy in love. It's all balanced superbly. There was also some commentary about the way we, or the immigrants who came to America, rather, displaced the Native Americans... I thought that was pretty great. This is a terrific film, it sucks that it came out on limited release.",
    "rating": "45",
    "date": "March 24, 2015"
  },
  {
    "reviewer": "Caleb S",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/789838949/",
    "review": "  Slow West lives up to its name, but its visuals, performances, and writing make it savory.",
    "rating": "40",
    "date": "July 14, 2015"
  },
  {
    "reviewer": "Giorgos T",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/867046575/",
    "review": "  A great western, lyrical and dramatic at the same time.",
    "rating": "40",
    "date": "July 14, 2015"
  },
  {
    "reviewer": "Lee M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/791471625/",
    "review": "  Slow West ambles to its inevitable bloody conclusion, a beautifully orchestrated ballet cast with heroes, fools, unwelcomed guests, and lovers, assembled in the fields of the Lord.",
    "rating": "35",
    "date": "July 14, 2015"
  },
  {
    "reviewer": "Geophrey G",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/818538352/",
    "review": "  Pretty good and the black sheep brother dude from Bloodline is in it.",
    "rating": "35",
    "date": "July 14, 2015"
  }
,
  {
    "reviewer": "Jamie W",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/806212184/",
    "review": "  If you loved the most recent version of True Grit, you will love Slow West. It is very much a character study in the midst of glorious scenery brought to you by great, sensitive acting with a feast for the Michael Fassbender fans.",
    "rating": "40",
    "date": "July 13, 2015"
  },
  {
    "reviewer": "David L",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/901488735/",
    "review": "  Slow West has solid direction, quite good acting and the movie looks good with some beautiful scenery, but it is unbearably boring with flat and badly written characters, simplistic and weak story and Kodi Smit-McPhee is incredibly annoying which is problematic for he is the lead. It has some strengths, but overall it is a forgettable and uninspired western.",
    "rating": "25",
    "date": "July 13, 2015"
  },
  {
    "reviewer": "Zeppo1",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/900948227/",
    "review": "  Beautifully shot and engaging western with some good central characters. It does have some slow parts, but it delivers with a bang-up conclusion.",
    "rating": "35",
    "date": "July 12, 2015"
  },
  {
    "reviewer": "Rameshwar I",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/952097193/",
    "review": "  Welcome back western... Beautiful!!",
    "rating": "35",
    "date": "July 12, 2015"
  },
  {
    "reviewer": "Alec B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/790680964/",
    "review": "  It's mostly a collection of odd affectations and digressions . . . some of which are amusing and others seem to exist purely to disguise the more predictable plot developments. Thankfully the ending holds enough surprises to make it an interesting, if still extremely flawed, anti-western.",
    "rating": "30",
    "date": "July 11, 2015"
  },
  {
    "reviewer": "Al S",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/200490042/",
    "review": "  A bold, exciting, fun and wonderfully original directional debut from Director, John M. Maclean. Maclean shoots like Wes Anderson and has the Coen Brothers gritty storytelling. A fresh, darkly comic and pistol-whipping western with heart and great characters. Kodi Smit-McPhee and Michael Fassbender are absolutely excellent. They have a charming and unique chemistry to them. I really enjoyed this movie its colorful edge, beautiful landscapes and compelling story. A sharp and vastly enjoyable movie.",
    "rating": "40",
    "date": "July 11, 2015"
  },
  {
    "reviewer": "Niall M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/970824703/",
    "review": "  Fantastic movie, Fassbender was amazing, cinematography was beautiful. Everything apart from the ending was brilliant",
    "rating": "45",
    "date": "July 11, 2015"
  },
  {
    "reviewer": "Andrei D",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/905905573/",
    "review": "  Pentru un Western care incepe lent, face nistre lucruri deosebite cu finalul",
    "rating": "40",
    "date": "July 11, 2015"
  },
  {
    "reviewer": "Linnea P",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/907423793/",
    "review": "  A uniquely pure and concise film--it tells its story, no more, no less, and does so with nearly perfect craft. If Hemingway ever wrote a Western, and that Western was adapted to the screen, I imagine it would look something like this.",
    "rating": "45",
    "date": "July 10, 2015"
  },
  {
    "reviewer": "Kevin L",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/784342193/",
    "review": "  Unconventional pacing and story structure (the title doesn't lie) may turn some people off, but the characters and superb acting and stylish-ness kept me engaged from beginning til end.",
    "rating": "35",
    "date": "July 10, 2015"
  },
  {
    "reviewer": "Mike O",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/789440327/",
    "review": "  Just a great time. A worthy homage to the western genre, with a mix of subversive humor and random philosophical musings. All of these things = my cup of tea",
    "rating": "45",
    "date": "May 30, 2015"
  },
  {
    "reviewer": "Arum Padma O",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/862442197/",
    "review": "  When you read \"dry humor\" along the description or review somewhere, trust me it's really DRY. It's different from your regular dead pans, it's in another level of dryness. That's what makes it interesting and stylish tho. Prob because the two superb actors, Kodi's accent doesn't sound Scottish but I'm not Scottish so... their acting is just great.",
    "rating": "40",
    "date": "January 24, 2015"
  },
  {
    "reviewer": "David H",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/908357246/",
    "review": "  Poorly written, weak story line, stilted acting, not worth watching. Terrible movie and I'm a western aficionados and at least like most..",
    "rating": "05",
    "date": "July 8, 2015"
  },
  {
    "reviewer": "Nathaniel B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/905167006/",
    "review": "  Good film! Keeps you interested, as slow as it is, and offers a fresh take on western films and narratives in general.",
    "rating": "40",
    "date": "July 8, 2015"
  },
  {
    "reviewer": "Kyle B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/891925965/",
    "review": "  I always love to see modern westerns these days and wish more popped up like this. The score is haunting and beautiful and captures the Western essence perfectly and the cinematography is jaw droopingly beautiful especially during sunsets. Michael Fassbender does a good job but the performance that I really enjoyed was Kodi Smit McPhee. He has been in a few movies lately but this was the first time he really made an impression on me. It is kind of short and feels like the first hour is setting up for an AMC drama but it was solid with a lot to like about it. The climax is well directed and for a first time director this was a pretty impressive debut.",
    "rating": "40",
    "date": "July 7, 2015"
  },
  {
    "reviewer": "Luis A. H",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/936385374/",
    "review": "  If Wes Anderson directed a Western Flick, this would be the result. With solid writing, strong acting, interesting thrills and well rounded with old-school action, Slow West is a nice treat for Western fans and non-western fans alike.",
    "rating": "45",
    "date": "July 7, 2015"
  },
  {
    "reviewer": "Jeremy H",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/784762615/",
    "review": "  Slow West is like an exceptionally well-made student film with some great actors but it's too bright, too pretty and too clean looking to have any real impact. A Western without any grit is a shame. The story is flat, the plot predictable, the music is uninspired and the sound design lacks any punch. The one surprising moment in the film is ruined by such a shallow, obvious visual metaphor it makes a joke of the entire film, causing us to laugh at what should be a tragic situation. Slow West is to Westerns what The Hobbit films were to The Lord of the Rings.",
    "rating": "20",
    "date": "July 7, 2015"
  },
  {
    "reviewer": "Alan W",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/795081994/",
    "review": "  Starting off like a Western made by Wes Anderson or Jim Jarmusch, the narrative meanders and characters get quirkier, but my main problem with the film is that I find the main protagonist and his romantic motivations na�ve and often irritating. But the film totally redeems itself with a relentlessly violent, very unsentimental (and not at all romantic) finale where it finds itself firmly back in the harsh realm of reality. The film wakes up and with a healthy dose of humour thrown in (the salt jar gag is priceless in my opinion), becomes the movie that I hoped it will be but worried that it won't. A gutsy and quite remarkable debut for a musician turned film-maker and a rare example of why one should not leave a film halfway, proving a film can surprise you and snatch victory in the last reels.",
    "rating": "40",
    "date": "July 7, 2015"
  },
  {
    "reviewer": "James P",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/920247161/",
    "review": "  A strange, dream like western full of laughs, tears and heart. This short but memorable film feels incredibly Coen-esque in it's execution.",
    "rating": "40",
    "date": "July 7, 2015"
  }
,
  {
    "reviewer": "Dane M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/791223426/",
    "review": "  What a strange little western. It twists delightfully in bloody ways that will leave you wanting more...of a thread. With blood or no red splashes of plasma, it's a hell of a wild west ride. So many characters come and go you pray that the director, John Maclean knows what he's doing. He does. Everything comes together only to get ripped apart. The delight is how in this rather bleak and black western.",
    "rating": "35",
    "date": "July 6, 2015"
  },
  {
    "reviewer": "Deston N",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/807048194/",
    "review": "  Oddly captivating, but still not sure about this one. Interesting western. Won't see others like it, that's for sure.",
    "rating": "30",
    "date": "July 6, 2015"
  },
  {
    "reviewer": "Skyy H",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/919700192/",
    "review": "  Lovingly crafted Western, beautifully scenic, sweetly made. Great story.",
    "rating": "40",
    "date": "July 6, 2015"
  },
  {
    "reviewer": "Jessica J.",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/970754826/",
    "review": "  This was pretty interesting - weird pacing, but overall a good movie I think. Worth a look. Something a little different is always nice.",
    "rating": "30",
    "date": "July 5, 2015"
  },
  {
    "reviewer": "Luciano G",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/894774639/",
    "review": "  The movie is dark and violent, but it's also touching and beautifully shot (the cinematography is gorgeous).... Fassbender and Smit-McPhee are both outstanding in the lead roles.... the movie also has a good supporting turn from Ben Mendelsohn, in a villainous role.... it's definitely an impressive debut, from John Maclean!...",
    "rating": "30",
    "date": "July 5, 2015"
  },
  {
    "reviewer": "Ian T",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/786988107/",
    "review": "  Its entertaining but although it was praised for being a new take on the western I found it a bit cliched in parts.The scripts a bit unsubtle: \"I'm not like you Payne\". \" Jay Cavendish taught me there's more to life than mere survival.\"..because eh thats my character arc. And everyone seems concerned with the plight of native Americans.The thing that really got me is almost every scene is filled with illogical things:- why is Ben Mendelsohn wearing half a bear in the blazing sun.- why doesnt Ben Mendelsohn even try and get the location from the kid?- why do they continue to lead the bounty hunters even after they know they are being followed?- why doesn't John Ross notice a bloke dressed as a priest, standing about 20 meters away, pointing a massive rifle at him.- how does the entire corn field go up in flames in about 5 seconds- how does Rose failed to notice she just shot her friend?- why \"Payne\" wander into the house, as if no-one would be in there with a gun",
    "rating": "30",
    "date": "June 26, 2015"
  },
  {
    "reviewer": "Barry T",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/795283715/",
    "review": "  A wonderful film and def one of my top 10 of the year. Wonderfully shot and too great performances from Fassbender and Smith. Its a western with a story of a boy searching for his 1st love only she is wanted for murder so loads of people are searching for her.",
    "rating": "50",
    "date": "July 4, 2015"
  },
  {
    "reviewer": "Patrick K",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/838369425/",
    "review": "  Good little film that follows a teenager Jay Cavendish (Kodi Smit-MaPhee) in the nineteenth century as he travels across the American Frontier when he is joined by Michael Fassbenders Silas Selleck a mysterious, weiry traveller who helps get to his destination but are heavily trailed by the outlaw along the way. Its not your usual action film but it was well written and well acted and provides a good solid piece of entertainment",
    "rating": "35",
    "date": "May 22, 2015"
  },
  {
    "reviewer": "Chris H",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/828952396/",
    "review": "  Exceptionally well-told modern Western with a simple premise and solid acting. There are no wasted characters here whose entire purpose is to tell exposition, and that's a really rare thing nowadays.",
    "rating": "40",
    "date": "July 1, 2015"
  },
  {
    "reviewer": "Andy P",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/912189877/",
    "review": "  John Maclean's exciting debut film is an offbeat, inventive and blackly comic Western that demonstrates he is a talent to be watched and serves as a refreshing treat for fans of traditional genre offerings.",
    "rating": "40",
    "date": "June 28, 2015"
  },
  {
    "reviewer": "Alasdair B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/899526316/",
    "review": "  As of late, westerns have made a resurgence in the film industry. The Magnificent Seven and True Grit (1969) are iconic westerns that have paved the way for the genre. In the 1960's, a new type of western was introduced: they are known as spaghetti westerns. These spaghetti westerns have become increasingly popular today. Recently, Quentin Tarantino released his own spaghetti western, Django Unchained. It's been a few years since I've seen a great western film, but finally we have another. \"Slow West\" is directed by John Maclean. The cast includes Michael Fassbender, Kodi Smit-McPhee, Ben Mendelsohn, and Rory McCann.Jay Cavendish (McPhee) is a young Scottish immigrant seeking his sweetheart Rose in the west of America. Along the way, Jay encounters a ruffian named Silas (Fassbender). Silas agrees to escort Jay-provided he pays him-west to find his girl. When the two travelers happen upon a roadside store, Silas notices a WANTED poster, calling for a $2,000 bounty of John and Rose Ross.Michael Fassbender is an extraordinary actor. He gave a fine performance in the iconic 2013 film, 12 Years A Slave. He was particularly good in last year's, Frank in which Fassbender plays an eccentric musician who wears a paper mache head. He's got a wide range, and he's very good in this film. Alongside Fassbender is young Kodi Smit-McPhee, known for his smaller roles in The Road and Dawn of the Planet of the Apes. I was pleasantly surprised by McPhee's solid performance. His character and Fassbender's are strikingly different, and they clash brilliantly. The young wide eyed youth searching for meaning, venturing with a rough worn down cowboy is a great dynamic. Last but not least, Ben Mendelsohn makes a small appearance in the film. Mendelsohn has been popping up everywhere in these small roles. I first saw him in Christopher Nolan's, The Dark Knight Rises. He played a very unpleasant character. In fact, he is now known for playing very unpleasant characters, and he's great at playing them. Any good western has to have memorable characters, atmospheric vibes, and bloody gun fights. Slow West has all three. The film also has subtle themes about the changing times. In a line to Silas, Jay mentions the writings of Charles Darwin. This is the time period in America when new and fantastic ideas are just waiting on the horizon. Jay encompasses the coming change to a savage and harsh country. I will admit, the film is a bit slow-pun not intended. Despite periods of slowness, the film succeedes in providing both the action and the grit.\"Slow West\" is a solid western thriller. Michael Fassbender and McFee give great central performances, and director John Maclean directs the film with steady precision. While the film sometimes wandered into a slow pace, it was never boring. The script is strong, and the cinematography is a work of art.",
    "rating": "40",
    "date": "June 29, 2015"
  },
  {
    "reviewer": "Robert B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/908893469/",
    "review": "  A young Scottish man arrives in America circa 1870 to find his sweetheart who is on the run with a bounty on her head. He befriends a mysterious traveler played by Michael Fassbender who hides his intentions from the young immigrant. A nicely paced modern western with an old school feel. The director writer has certainly been influenced by Eastwoods laler work from Josie Wales onwards. If your a fan of the genre and the type of movie which covers the great frontier you will enjoy this.",
    "rating": "40",
    "date": "June 30, 2015"
  },
  {
    "reviewer": "Vacationer UK",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/901359705/",
    "review": "  Great acting but a bit boring. 2nd half saved the movie",
    "rating": "40",
    "date": "June 29, 2015"
  },
  {
    "reviewer": "Gregory S",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/969720234/",
    "review": "  Don't see the movie. Slow, boring and stupid.",
    "rating": "05",
    "date": "June 28, 2015"
  },
  {
    "reviewer": "PEARLnDEAN",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/964123535/",
    "review": "  More like this please ,great movie.",
    "rating": "45",
    "date": "June 28, 2015"
  },
  {
    "reviewer": "Seth L",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/791439770/",
    "review": "  best new western in years. unique story. stunning cinematography. and fassbender is awesome as usual.",
    "rating": "40",
    "date": "May 30, 2015"
  },
  {
    "reviewer": "Garrison C",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/785374732/",
    "review": "  Meh, totally forgettable",
    "rating": "30",
    "date": "June 28, 2015"
  },
  {
    "reviewer": "Abhyudaya K",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/970657770/",
    "review": "  Top of the class acting, beautiful storyline, clear cut characters and an impressive ending.",
    "rating": "40",
    "date": "June 27, 2015"
  },
  {
    "reviewer": "Kyle G",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/782262884/",
    "review": "  A fresh and invigorating western with a cast that can do no wrong.",
    "rating": "45",
    "date": "June 26, 2015"
  },
  {
    "reviewer": "John M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/782214838/",
    "review": "  Resurgence of the badass. So this is about a young Scottish teenager travelling stateside (Kodi Smit-McPhee). He's trying to reach the girl who has his heart (Caren Pistorius), but in order to survive in the harsh West, he has to team up with an outlaw whose motives may be a hair on the grey side (Michael Fassbender). It's no secret: I am a gigantic fan of the Western, and it is a genre that I love to lose myself in. I cherish the time when I get to watch them, but the only problem is that you just don't see that many nowadays; apart from Appaloosa and the remakes of 3:10 to Yuma and True Grit, can you name another Western that has been released in the last decade? That's why I was giddy to watch Slow West: we don't get many cowboy movies these days (never mind Leone esque cowboy movies), and this is an original Western property, which is something I will always wholeheartedly support. Almost all of the great Westerns are sprawling in length; The Good, the Bad and the Ugly and Once Upon a Time in the West are two of my very favorites, but they both come in a few minutes under the 3 hour mark. Slow West is remarkable in that it only comes in at an unintimidating 84 minutes, which is unheard of in the genre. Because it is also an unlikely duo team up movie, it is easy to get into. They got that weird looking kid from The Road, who is good in this, but he is ultimately overshadowed by Fassbender, who shows the expansive range of his talents. He's always been a quality actor, but here, he shines in a way that would make Clint Eastwood smile. Looking at his library, I can honestly say that this might just be my favorite role of his, which is truly saying something (it's super close with his role in Inglourious Basterds, for me at least). He is playing a character where you can tell that he's been out here awhile, and he's a man of few words, but is always good for a one liner. The dynamic to their relationship is what keeps you hooked, and you're never 100% where his allegiance truly lies. They really got the look down to this, and this is a very promising directorial debut from John Maclean. I don't think I've ever seen a crisper looking Western, and I don't think I've seen a Western shot digitally before, or at least not in such high definition. How much you enjoy Westerns determines how much I recommend you check this out, but if you're like me, it's a must see.",
    "rating": "40",
    "date": "June 26, 2015"
  }
,
  {
    "reviewer": "Ahmed S",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/787110482/",
    "review": "  There is nothing about Slow West that you haven't seen before, but the chemistry between its two stars, the beautiful cinematography and the great score, could make this movie feel like something very enjoyable and very special. One of the better westerns of recent years, and another thumbs up for Fassbender, who always chooses his scripts carefully.",
    "rating": "40",
    "date": "June 26, 2015"
  },
  {
    "reviewer": "Lyn R",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/836979300/",
    "review": "  Wonderful. If you like depressing, hopeless, bad endings.",
    "rating": "10",
    "date": "June 25, 2015"
  },
  {
    "reviewer": "Laurent P",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/801036205/",
    "review": "  Un western indy qui se plait a dejouer les pronostiques tout en imprimant sa propre petite musique au genre. Fassbender la joue charisme poli qui attend son tour.",
    "rating": "35",
    "date": "June 25, 2015"
  },
  {
    "reviewer": "Mark A",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/906756406/",
    "review": "  Though not quite as fleshed out as it should've been, Slow West still offers a surprising amount of thematic and emotional depth, wrapped up in a well-acted and inspired revisionist Western package",
    "rating": "40",
    "date": "June 22, 2015"
  },
  {
    "reviewer": "Anand K",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/943400687/",
    "review": "  Slow is right. Also boring.",
    "rating": "05",
    "date": "May 20, 2015"
  },
  {
    "reviewer": "Alex H",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/861088821/",
    "review": "  If the Coen Brothers and Wes Anderson teamed up together to make a Western; \"Slow West\" would probably be the film that would come out. This oddball western is a tremendous first feature from writer/director John M. Maclean who, despite some drops in pace here and there, serves up a delightful under-90-minute treat! Filled with, somewhat heavy handed, hilarious visual metaphors - Slow West has a sense of humour unlike any other film i've seen this year while still giving space for tragedy and heartbreak. Kodi Smit-McPhee is a remarkably sensitive and sympathetic leading man who plays off Michael Fassbender's brutish character brilliantly. The centre framed still cinematography is very pretty and the 3/4 waltz like folk music accompanies the images perfectly. While it's a somewhat simple story, Slow West is best enjoyed for the wit of the screenplay and the joy of watching someones original take on an old genre.",
    "rating": "40",
    "date": "June 18, 2015"
  },
  {
    "reviewer": "Craig F",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/907233324/",
    "review": "  Smit-McPhee is excellent opposite an always superb Fassbender. Really nice cinematography and direction propel a meaningful story in this top of the line western.",
    "rating": "40",
    "date": "January 29, 2015"
  },
  {
    "reviewer": "John K",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/905617862/",
    "review": "  This takes a while to really find it's footing and slips into a good amount of genre tropes, but a good Western can go a long way, especially in a market where these are increasingly rare. Michael Fassbender is amazing as a scoundrel trying to do right in a story that has some shocking surprises and a nihilistic heart.",
    "rating": "35",
    "date": "June 13, 2015"
  },
  {
    "reviewer": "Thomas L",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/905603669/",
    "review": "  Your typical western has always been about moral fortitude. Slow West is about is about destiny, though it may not seem like it at first. True to it's name things are fairly slow going. Young Scottish immigrant, Jay Cavendish (Kodi Smit-McPhee), crosses paths with an outlaw played by Michael Fassbender while on a trek across the American Frontier (though I have a hunch it was filmed in New Zealand) to find his long lost love. Together they brave the danger's of the wild west. They meet a few bizarre characters along the way, most of which seem strangely out of place. I feel like writer/director John M. Maclean must have binged watched films by the Coen Brother's and Jim Jarmusch before conjuring this tale. Ben Mendelsohn is criminally underused as a gang leader named Payne, as is Rory McCann who was so great in Game Of Thrones as The Hound. This movie is really all about the ending, once the pieces come together and the morbid irony sets in there will be some reward in understanding the nature of the story.",
    "rating": "30",
    "date": "June 11, 2015"
  },
  {
    "reviewer": "Steve P",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/794046475/",
    "review": "  A western with a difference! I thoroughly enjoyed this fresh look at the American West through the eyes of a Scottish man (boy, really) who naively sets out to find his true love who has left Scotland because she is accused of murder. Kodi Smit-McPhee is excellent as Jay Cavendish who is \"escorted\" through the harsh wilderness by Silas Selleck, played superbly by Michael Fassbender. The story is wonderfully unpredictable, shot through with humour. The cinematography is beautiful and the direction is tightly controlled. There are two particularly dramatic, superbly choreographed set pieces that are full of tension. Excellent and highly recommended.",
    "rating": "45",
    "date": "June 10, 2015"
  },
  {
    "reviewer": "Ian C",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/947609447/",
    "review": "  Solid western. Uneventful until a mental climax.",
    "rating": "30",
    "date": "June 8, 2015"
  },
  {
    "reviewer": "Harlequin68",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/900682338/",
    "review": "  In \"Slow West,\" Jay Cavendish(Kodi Smit-McPhee) wants nothing more than to be reunited with Rose(Caren Pistorius). Through sheer determination, grit and mostly just pure dumb luck, Jay has advanced as far as Colorado in 1870. That luck has just run out when he encounters a group of Indian hunters who are really not that picky who they kill. And that's where Silas(Michael Fassbender) enters the story, saving his life and then making a deal to guide him the rest of the way.\"Slow West\" is a wildly unpredictable and beautiful movie about the old west that shows the immigrants' dilemma in this new land of widespread violence.(This is a UK/New Zealand co-production which might account for the unique perspective.) So, while there was opportunity to be had for those willing, it did not come without more than its share of risks. This is highlighted well in the closing montage of all the characters who died in the film.",
    "rating": "40",
    "date": "June 8, 2015"
  },
  {
    "reviewer": "Luis P",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/906529970/",
    "review": "  I'm a BIG fan of Westerns, and this little film that could hit all my sweet spots. A little stylistic flair here, some funny bits there, and a stellar turn by both of its leads makes this buddy-cowboy flick one of the most fun and ineteresting I've seen in a while. My only gripe is with the predictable ending, but the journey there is what matters. See this!",
    "rating": "40",
    "date": "June 7, 2015"
  },
  {
    "reviewer": "ManIsh A",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/903591870/",
    "review": "  Fassbender literally can do anything while Kodi Smit-McPhee continues to show lots of promise.",
    "rating": "30",
    "date": "June 6, 2015"
  },
  {
    "reviewer": "Eeb W",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/821534463/",
    "review": "  I liked this movie even more than I should have, I think. It has just the right amount of quirkiness and campiness that it doesn't give into moments of disbelief... too much. But even though at times it felt like one thing or another was a bit off, whether it be narrative events that are unlikely to happen in real life (not meant for comedic purposes), inconsistent pacing, the wild west being full of wildlife and almost recognizable (they actually shot in New Zealand, but I'll excuse this because of the alluring cinematography), my favorite part of the film was the 3rd act and man does eclipse all of it. I'd talk about why I loved it more but I would have to spoil it... That being said the first to acts are great on their own as well, and I'm probably just being too nitpicky.imageMichael Fassbender plays an outlaw named Silas who helps a young man named Jay (Smit-McPhee) from Scotland find his runaway love-interest. The girl of his dreams is Rose Ross, and she is in hiding with her father John Ross because they are wanted for a crime. The events of the crime are laid out to the audience in flashback fashion, consequently there is a bounty on their heads: $2000 Dead or Alive. A separate group of outlaws are aware of the bounty, except only the boy knows exactly where the Ross clan reside.imageThe genre of the journey West, or any reiteration of it, is always going to be a personal favorite of mine because it is representative of man striving towards his or her dream. The boy has a dream of being with the girl who haunts it, but being the still na�ve and innocent boy that he is he doesn't realize that in this gruesome world things don't only happen simply because you want them to. It is never only about right or wrong, sometimes its just about money; never underestimate its power.Simply said, although the film may seem inconsistent at times, it is too good to ignore. I actually think that it is one of the better movies that have come out this year. Originality plays a great factor on how I rate films, and if it were only on originality and wit I would give this movie a perfect score. I want to give it a perfect score. But I can't. There are flaws, and not just the kind a critic can brush aside.I give this film...3 kills out of 4 wanted menJust A Thought",
    "rating": "40",
    "date": "June 6, 2015"
  },
  {
    "reviewer": "Michael J",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/907545267/",
    "review": "  An unusual and singular twist on the western movie genera genre,..spendid cast, acting, scenery compose to a film that has both tense moments and humor. A must see for those who enjoy not only a good western, but suspense and violence none of which is either gratuitous or contrived...to identify the plot would be in itself a spoiler....see it, well worth the time and money",
    "rating": "40",
    "date": "June 4, 2015"
  },
  {
    "reviewer": "Erin O",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/867918354/",
    "review": "  Ironic and very interesting. A truly unique twist on the western.",
    "rating": "40",
    "date": "May 12, 2015"
  },
  {
    "reviewer": "Jason M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/906357484/",
    "review": "  Solid debut for Maclean. Doesn't try to reinvent the wagon wheel. Just good acting, good pacing, and a plot that sneaks up on you in the last third.",
    "rating": "35",
    "date": "June 3, 2015"
  }
,
  {
    "reviewer": "Christopher Llewellyn R",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/791473372/",
    "review": "  When \"Slow West\" played at the 2015 Sundance Film Festival, where it won the World Cinema Jury Prize Dramatic Award, \"The Hollywood Reporter\" published a review calling the film \"a pitch-perfect debut from musician-turned-filmmaker John Maclean.\" And though I must disagree with both Sundance and \"The Hollywood Reporter\" (and most critics) about the movie's perfection, I still find \"Slow West\" to be a fascinating meditation on violence, civilization and the western genre, itself.\"Slow West\" takes place in 1870, and centers on a young man from Scotland, Jay Cavendish (Kodi Smit-McPhee, \"Let Me In\"), who has come to America in search of his lost love, Rose (Caren Pistorius, \"Offspring\"). We don't find out until later why she left their homeland, though we catch glimpses of her in flashbacks. When we first meet Ray, he is wandering, alone on horseback, through a desolate landscape of burning Native-American dwellings. A male voice, which we will very soon connect to a bounty hunter named Silas (Michael Fassbender, \"12 Years a Slave\") narrates this stark opening, before the man, himself, shows up and shoots a would-be hold-up artist in the head, thereby effectively taking young Jay under his wing. The violence does not end here: we're only just getting started. And yet, it's a quiet film, with almost no non-diegetic sounds (differentiating itself from its bleak revisionist cousin of the 1990s, \"Dead Man,\" in which the music of Neil Young blared throughout). When guns are fired and blood spilled, there's usually very little warning. Though the film, reflecting both its title and the time in which it's set, meanders, there is nothing slow about the eruptions of brutality. This is how the so-called civilized world tames the wilderness, through mayhem and turbulence.So why is it less than perfect? Well, it all feels so schematic: no one speaks like a real human being, and very few characters are allowed enough depth to be meaningful. The film is beautifully photographed by Robbie Ryan (\"Philomena\"), yet the people who inhabit the landscape feel like constructs. When we briefly meet a German writer named Werner (perhaps a reference to the great Herzog?), he utters the memorable line, \"In a short time, this will all be a long time ago.\" That's a brilliant statement, but it merely serves to underline the fundamental artificiality of the set-up, since no one really talks like that (well, except for Werner Herzog). Still, there are a lot of great concepts up on the screen, and Fassbender is always a pleasure to watch. The equally mesmerizing Ben Mendelsohn (\"Bloodline\"), shows up for a few all-too-brief scenes, too. See it for them, and for the cinematography, and for the idea of the movie. It may not be great cinema, but it's compelling enough.",
    "rating": "30",
    "date": "May 31, 2015"
  },
  {
    "reviewer": "Tex S",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/913009053/",
    "review": "  Slow West--Riding without a CauseSlow West is a new film featuring Michael Fassbender. And yes, you smart readers, it's a Western. It hits all the benchmarks of a Western horse movie: a stranger new to the West, an outlaw of questionable character, a bounty hunters, really bad outlaws, an outpost, and a few Native Americans and others. However, they have little to do with the action. One character is looking for his true love. We forgive him, for he is young. The other character, a wishy washy anti-hero bounty hunter, is 'helping' this young man. It's interesting, and the visual are out of Wyeth painting, but it's hard to care much. We don't know why characters turn, we don't understand why the family has a bounty on their head, we don't get enough back story. While I know we are sophisticated movie goers in the 21st Century, we still like to see the motives for our characters, what drives them, what leads them to act as they do. There isn't enough exposition. There was certainly time in this lovely 90 minute film to let us in on the secrets of the characters. Top stars: the music and the cinematography. It looks and sounds delicious. The acting is okay, but not spectacular. However, the main problem was with the writing. The story just wasn't compelling enough. It would have also helped if the film featured a really nasty villain, not just a nebulous undefined band of loons. Westerns benefit from good villains and clear motives, two things Slow West is lacking. ??Rating: MatineeIt is entertaining enough and there are enough plot twists to recommend this film. Go to the theaters just to see the wonderful photography. ??Peace, Tex Shelters",
    "rating": "30",
    "date": "May 31, 2015"
  },
  {
    "reviewer": "Scott J",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/816764622/",
    "review": "  A very interesting and entertaining little movie.",
    "rating": "40",
    "date": "May 31, 2015"
  },
  {
    "reviewer": "Sham K",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/907590065/",
    "review": "  This movie is ok. They did a great job making this movie, but this is Slow West. Slow is the key word. As slow as this movie feels it doesn't make a very loud point to the plot. I would not recommend unless you're already a huge fan of the western genre and are looking for something different. =|",
    "rating": "25",
    "date": "May 30, 2015"
  },
  {
    "reviewer": "Chris A",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/905715207/",
    "review": "  Glad Randin told me about this film. Understated, simple, and fun. Perhaps the most authentic western I've watched.",
    "rating": "40",
    "date": "May 30, 2015"
  },
  {
    "reviewer": "Joel A",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/970224168/",
    "review": "  In a time when every movie is CGI-filled and explosion-ridden, Slow West is a nice reprieve for people who love a good old Western tale. Between this and All is Wilderness, you can really tell that Kodi Smit-McPhee has a bright future ahead of him. The others (Fassbender, Mendelsohn, etc.) are all great and the story really pays off, leading to a stunning climax that is truly hard to see coming.",
    "rating": "40",
    "date": "May 30, 2015"
  },
  {
    "reviewer": "George I",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/905715418/",
    "review": "  \"In a short time...This will be a long time ago.\"",
    "rating": "35",
    "date": "May 28, 2015"
  },
  {
    "reviewer": "Peter F",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/782851126/",
    "review": "  John M. Maclean debut film is often impressive, and also slightly amateurish. An attempt at making a meditative western, Slow West is often quiet and introspective. Certainly commendable, it's just Maclean's style isn't deft enough to capture a particular mood, and the violent action scenes actually contrast with the humbleness. Still, it's smartly cast and occasionally a bit fun, but those looking for a better attempt at making a weird western are well-advised to see Jim Jarmusch's Dead Man.",
    "rating": "35",
    "date": "May 27, 2015"
  },
  {
    "reviewer": "Galen M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/910221315/",
    "review": "  How movies are supposed to be. Highly recommend.",
    "rating": "45",
    "date": "May 25, 2015"
  },
  {
    "reviewer": "WS W",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/804776751/",
    "review": "  A different, quite interesting (owing much to the brisk music scores) indeed, Western genre.",
    "rating": "30",
    "date": "May 25, 2015"
  },
  {
    "reviewer": "Ryan S",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/847037809/",
    "review": "  When it comes to pacing, there is a fine line between deliberate and meandering. In this instance, we unfortunately find ourselves strolling along the glacial side of the fence. Although thoughtful and brightly colored, the film is imbued with leaden atmosphere. By the end, the irony of its title is overstated and stale, just like its sense of humor. While I am definitely a romantic who will never consider the western genre dead-as it is so often proclaimed by most jaded critics-this film makes a strong case for the spirit of the west having long since evaporated, leaving behind in the deserts and prairies an ambivalent skeleton of motions to be gone through.",
    "rating": "25",
    "date": "May 24, 2015"
  },
  {
    "reviewer": "Brandon O",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/866547751/",
    "review": "  Brilliant & unique filmmaking, a peculiar dreamlike feel, and a distinctive narrative lined with dark humor make this gorgeously-shot \"Western\" a standout.",
    "rating": "35",
    "date": "February 12, 2015"
  },
  {
    "reviewer": "Kerry M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/955050613/",
    "review": "  Depressing, but nI couldn't stop watching, hoping something good would happen for the characters. Too little, too late. I will NOT recommend.",
    "rating": "15",
    "date": "May 23, 2015"
  },
  {
    "reviewer": "Garry A",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/948344304/",
    "review": "  Kinda ironic that the best Western I've seen in ages is a British film shot in New Zealand and Scotland with an Irishman and Australian in the lead roles. Very Cormac McCarthy in tone and beautifully shot.",
    "rating": "45",
    "date": "May 23, 2015"
  },
  {
    "reviewer": "Tiago C",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/939408327/",
    "review": "  Excelente e lac�nico Western que narra a hist�ria de um garoto ing�nuo que sai da Esc�cia at� os USA em busca de sua amada que partiu com o pai.Dire��o firme, boas atua��es e roteiro.",
    "rating": "35",
    "date": "May 22, 2015"
  },
  {
    "reviewer": "?????? ?",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/923134787/",
    "review": "  Wes Anderson of Action-Westren-Drama Style.",
    "rating": "40",
    "date": "May 21, 2015"
  },
  {
    "reviewer": "Ky K.",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/904749596/",
    "review": "  Slow West is a slow burning western that is melancholic and violent, with beautiful landscapes and a tale for reflection.",
    "rating": "35",
    "date": "May 20, 2015"
  },
  {
    "reviewer": "Mike P",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/808792769/",
    "review": "  Great cinematography and decent character development. Fassbender is a naturally-tormented actor, I always enjoy any move he's in. That being said, the movie is simply too slow, and the 'coming of age' of the junior lead character (Smit-McPhee) is naively simplistic so as to be unbelievable.",
    "rating": "30",
    "date": "May 20, 2015"
  },
  {
    "reviewer": "Filipe C",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/876741169/",
    "review": "  A solid debut by Maclean, powered by some nice 4:3 photography. Ultimately, however, Slow West will be a forgettable entrance in the genre, as the film reveals tone and pacing issues as well as the lack of a stronger story to justify the names it attracted.",
    "rating": "30",
    "date": "May 20, 2015"
  }
,
  {
    "reviewer": "Mark M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/905453966/",
    "review": "  Brilliant film - Cross between True Grit, Dances With Wolves and Jarmucsh's Dead Man - The Ending blew me away. Great to see something like this by new writer/director.",
    "rating": "50",
    "date": "May 19, 2015"
  },
  {
    "reviewer": "Wayne C",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/846539436/",
    "review": "  A bit slow moving but entertaining. Well acted by Kodi Smit-McPhee & Michael Fassbender in particular. Well photographed with striking New Zealand locations easily passing for the United States terrain of the story. One question: Was it really necessary to have Michael Fassbender smoking on camera through much of the film?!",
    "rating": "40",
    "date": "May 19, 2015"
  },
  {
    "reviewer": "Keith R.",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/969300993/",
    "review": "  KR's Haiku Review:Yes, talk about \"slow\"Decent story, yet so boringGood try, Fassbender",
    "rating": "30",
    "date": "May 18, 2015"
  },
  {
    "reviewer": "Richard Y",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/792974389/",
    "review": "  A quirky weird oddball of a Western, funny and absurd at the same time. Interesting watch though!",
    "rating": "30",
    "date": "May 19, 2015"
  },
  {
    "reviewer": "Alfin N",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/881538577/",
    "review": "  \"Sensitive\" Scottish Jay.",
    "rating": "25",
    "date": "May 18, 2015"
  },
  {
    "reviewer": "Mark M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/963822019/",
    "review": "  In one of Slow West's self-reflective scenes, the young Scotsman, Jay, laments on his perceived assumption that his companion, Silas, is lonely - \"The silent... lonely drifter\" -, and that life offers more than just surviving, as the older of two retorts that there is also dying. The exchange is one of the many that make up writer-director John Maclean's Slow West involving life, death, and the juxtaposition between Kodi Smit-McPhee's optimist Jay, who believes in the innate goodness of man, hope and love, and that of Michael Fassbender's Silas, a cynical gunslinger that believes if given the chance, man will stab the other in the back for a quick dollar.At times darkly comedic, the other times self-reflective, and with short bursts of violence, the directorial debut of Maclean's slow-burn Western isn't so much a deathly serious film the aforementioned anecdote paints, as it serves - to an extent - to deconstruct the genre's image of fearless gunslingers, primarily through Fassbender's Hans Solo-ish character Silas, and his relationship with the lovelorn 16-year-old Jay, whom Silas secretly uses for his own personal gain. Slow West isn't the next Unforgiven (1992), not even close, but as a familiar gunslinger drifting in a different outfit, it has other things going for it - the performance and chemistry of the two leads, and then some - despite not being a ruthless gun-toting genre piece, as much as Ben Mendelsohn's casting as the outlaw Payne - a typecast for violent roles, and all that - might indicate.Like Westerns usually are, Slow West is almost always beautiful, delivering a picturesque depiction of America in 1870 - principal photography was done in New Zealand and Scotland -, with certain shots being reminiscent of old scenic paintings. And though Maclean presents the commentary on immigration, the systematic attempt at exterminating a land's aboriginal and native inhabitants - the Native Americans in Slow West's case -, the writer-director doesn't delve much into the topic as much as he possibly could have, as Maclean seems preoccupied with selling the film's idea that \"Love is universal like death\", with it ending exactly how it began with Jay's journey and outlook in life; pointlessly, yet with a semblance of hope, love and the innate goodness of man.",
    "rating": "40",
    "date": "May 18, 2015"
  },
  {
    "reviewer": "Dante B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/784124941/",
    "review": "  In a short time, this will be a long time ago.",
    "rating": "40",
    "date": "May 17, 2015"
  },
  {
    "reviewer": "Edward S",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/969736386/",
    "review": "  Sorry, but Slow West is dreadful. This low budget direct to cable pay per view is an unwatchable taxpayer funded vehicle to funnel money to third rate New Zealand actors and film crews. I have to give credit however to the brilliant social media and publicist team that is marketing this terrible film.",
    "rating": "05",
    "date": "May 17, 2015"
  },
  {
    "reviewer": "Kevin P",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/907903152/",
    "review": "  Slow West biedt een poetische kijk op de laatste dagen van het wilde westen met formidabele karakterstructuur die gaat zoals je niet zou verwachten. Het had misschien wel wat hulp nodig gehad bij een beter einde, maar dat valt voor ieder ander anders uit te vinden. Zoals deze western maken ze er niet genoeg meer, en dat is doodzonde !",
    "rating": "40",
    "date": "May 16, 2015"
  },
  {
    "reviewer": "Phillip S",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/906531073/",
    "review": "  While it may slow to a crawl at times, the strong acting, gorgeous cinematography and smart writing make \"Slow West\" worth the watch.",
    "rating": "40",
    "date": "February 24, 2015"
  },
  {
    "reviewer": "Jacob Z.",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/968923847/",
    "review": "  A traditional yet subversive western, Slow West pleased me with it's well matched actors and First time director John M. Maclean's talented hand",
    "rating": "40",
    "date": "May 15, 2015"
  },
  {
    "reviewer": "momatduke",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/901392602/",
    "review": "  Kodi Smit-McPhee shines. The chemistry between Fassbender and him seems to build though I know it must be purposeful since the story is written for it to build. The film making is so terrific it seems effortless. It's an immersive experience in that a very small, familiar story becomes an unfamiliar and textured movie. The scenery and the natural elements are characters as much as the actors and the horses. My only gripe, did people in this era have the insight they were wiping out a native culture? I want to think they did but it felt forced.",
    "rating": "40",
    "date": "May 15, 2015"
  },
  {
    "reviewer": "Ryan C",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/905413767/",
    "review": "  Can't really top that.",
    "rating": "50",
    "date": "May 13, 2015"
  },
  {
    "reviewer": "Matthew S",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/906665945/",
    "review": "  A refreshing take on the Western genre. Not great, but quite good and very interesting coming of age story. Why hasn't Michael Fassbender become a huge movie star?!?!?",
    "rating": "35",
    "date": "May 10, 2015"
  },
  {
    "reviewer": "Xavier C",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/965637216/",
    "review": "  This captures the essence of the old west. I haven't seen many Westerns in my lifetime, so it was nice watching this. It had all of the good-old tropes of the genre, and it was all well portrayed. It perfectly captured the era. It was mostly a relaxing time for me to sit back and watch, with an overall slow pace. The characters were sort of shallow, even Fassebender's. He didn't do much to earn the badass personality he was given. The ending was really fun and exciting. I may consider watching this again.",
    "rating": "40",
    "date": "April 24, 2015"
  },
  {
    "reviewer": "Nelson M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/905379808/",
    "review": "  A funny and thrilling western on par with True Grit.",
    "rating": "40",
    "date": "April 23, 2015"
  },
  {
    "reviewer": "David E",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/783849919/",
    "review": "  Slow West reminds me of True Grit, they are films in which an older more experienced outcast accompanies a much less experienced young person in the old west. Both are great films in their own way. While Slow West starts off as a slow burn, more and more random characters are introduced, and near the end becomes quite intense and unexpected. While at first glance it appears to be a western, in its own way it also is a black comedy. That are many really random, yet intentional, moments of hilarity. There is a seen involving a clothesline and some horses that made the audience just lose it. The 2 main actors are excellent (Fassbender-of course he was! & Smit-McPhee) and their characters fleshed out well. There are many random characters and events that occur throughout the film, but do end up coming together at the end. Not everyone will love the film's ending (I was ok with it though I did have some questions), but it works. If you are a fan of westerns, Fassbender, or unique films, made sure to check Slow West out when it plays wider.",
    "rating": "40",
    "date": "April 18, 2015"
  },
  {
    "reviewer": "Iain T",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/959751914/",
    "review": "  Best western since Assassination of Jesse James (2007) but very very different.",
    "rating": "50",
    "date": "April 12, 2015"
  },
  {
    "reviewer": "Daniel G",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/849008618/",
    "review": "  Dirty, dingy, lived-in Western is not to be found here. Slow West celebrates the hope and beauty that the United States represented to dreamers such as Kodi Smit-McPhee's Jay Cavendish in the late 1800's, post-Civil War. As Silas, Michael Fassbender leaps off the screen like he was born into the prototypical western hero outlaw role, except Slow West mainly avoids an stereotypes and works hard to elevate historically \"weaker\" roles into the most interesting parts of the film. Slow West goes out of its way to demolish Western cliches and deliver powerful performances in a slick, clean, hyper colorful world.",
    "rating": "40",
    "date": "April 5, 2015"
  },
  {
    "reviewer": "Jason D",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/785989309/",
    "review": "  Slightly slow but enough going on to make it not an unbearable indie bore. Some story flaws and voice over that is not fully developed, but various things make up for it. Climax sequence is really energetic and involving. A couple of super blatant symbolic things and some vague, though deep themes explored. In sum, a film with a lot of small flaws. But in this particular case, I think the positives outweigh the negatives. An indie film worth checking out.",
    "rating": "35",
    "date": "March 10, 2015"
  }
,
  {
    "reviewer": "Billy R",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/914829705/",
    "review": "  Beautifully shot and well acted. Adds a unique Scots-Irish perspective to the western genre.",
    "rating": "40",
    "date": "January 26, 2015"
  }
,]