[

  {
    "reviewer": "Carlos M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/891372896/",
    "review": "  A refreshing proof that you can make a funny and insightful film with a simple plot, naturalistic performances and an iPhone 5s - which adds to it and makes it look even more authentic, like a realistic fairy tale in the streets of L.A. (the character's name is even Sin-Dee Rella).",
    "rating": "40",
    "date": "December 13, 2015"
  },
  {
    "reviewer": "Liam G",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/904852337/",
    "review": "  This knocked my socks off. Groundbreaking from a technical point of view, 'Tangerine' takes us on a hectic trip through the streets of Los Angeles with two brassy, troubled but compelling trans women. The first half offers the biggest laughs of any film in 2015 so far, but where the movie really takes flight is in its second half, where it offers an insight into people who, in a vast city during one of the busiest times of the year, are forced to bear a life of loneliness and discomfort. It earns the unorthodox music cues, it earns the howls of laughter, it earns the tonal shifts, it earns the tears and in truth, 'Tangerine' earns recognition as one of the best films of 2015.",
    "rating": "45",
    "date": "November 9, 2015"
  },
  {
    "reviewer": "Eugene B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/836515740/",
    "review": "  Tangerine is gritty in its scope & neatly directed. The film's fluid portrayal, humorous dialogue and urban tone make for a solid sequential story. 4/5",
    "rating": "40",
    "date": "September 16, 2015"
  },
  {
    "reviewer": "Glenn G",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/799709308/",
    "review": "  MIDNIGHT COWGIRL - My Review of TANGERINE (4 Stars)I spent the years from 2000-2005 working as a health educator inside the LA County Mens Central Jail, primarily in its notorious \"K-11\" dorms where LGBT inmates were housed. I've often been asked to describe it, and my go-to answer has always been, \"It's as if they rounded up everyone on the corner of Santa Monica Blvd. and Highland and threw them in a cell together.\" For those out of the loop, that intersection is notoriously where transgender prostitutes ply their trade, with Donut Time being a place to rest their feet.I share this to contextualize the opening minutes of writer/director Sean Baker's (along with co-writer Chris Bergoch) propulsive, engaging, hilariously grimy TANGERINE. Just out of jail and sharing a Christmas Eve morning donut with her pal and co-worker Alexandra (Mya Taylor), Sin-Dee (Kitana Kiki Rodriguez) quickly learns that her pimp boyfriend Chester (James Ransone) has been cheating on her. Immediately, I thought, \"This film is soon K-11\", expertly capturing the lingo, confidence, smarts and outrage of its inhabitants. Like any good screenplay, the story is expertly set in motion as Sin-Dee and a drama averse Alexandra hurtle their way through the tough, sunlit streets of Los Angeles in search of the pair who did her wrong.Shot on tricked-out iPhones by Baker and Radium Cheung), TANGERINE may be a no-budget indie, but its style and feel for the streets of LA couldn't be more dead-on. Basically one long extended chase sequence, our cinematographers keeps the cameras moving and swooping around our subjects, a perfect way to capture our strutting divas. This is the underbelly of the city, you know, where people do more walking than driving and are actually used to interacting with each other. Along the way, Alexandra continuously hits up acquaintances to come to her show that night at Hamburger Mary's, while Sin-Dee badgers anyone and everyone as to the whereabouts of Chester and a woman whose name begins with a \"D\". Yep, that's all Sin-Dee has to go by, yet this ferocious survivor knows how to find her way. A somewhat random \"B\" story emerges involving a taxi driver Razmik (Karren Karagulian) and his many fares. For a while, I didn't know why we were watching these vignettes, but I was glad I stuck with it, as connections start to emerge. Regardless, there's an unforgettable moment when the driver encounters the worst kind of drunk passengers imaginable, which will force me to bring 409 with me whenever I get into another cab. Eventually, Razmik's story helps weave the fabric of the story together as everyone faces the inevitable question of whether they prefer to be alone in this world or not.Believe me, it's a tough world at best, and TANGERINE captures anger, desperation and the need to connect with another human being in ways I haven't experienced since John Schlesinger's classic MIDNIGHT COWBOY. Like Ratso and Buck, Sin-Dee and Alexandra need each other more than they know. The glaring light, street sounds and reliance on percussion on the soundtrack evoke an LA more common than its glamorous cinematic counterparts. I felt every bead of sweat and every step of their journey. There's a bravura sequence in which Alexandra busts into a seedy motel room and literally drags one of its occupants all over the city. The push-pull of their relationship is fascinating, never knowing which one is really playing the other. The emotions in this film play on so many different levels, I was astounded. Our leading pair can be quite theatrical when necessary, but there's real tenderness underneath the surface, especially during the stunning final scene. As the harsh light of day turns to desolate night, your heart comes to ache for this pair. If you're gonna live in a world where everything and anything can be your enemy, you could do worse than have a Sin-Dee or an Alexandra on your side. Laughing one minute and then cringing at how dark and combative their world can be, I came to care about the people of TANGERINE. It's a buddy movie with street smarts.",
    "rating": "40",
    "date": "September 18, 2015"
  },
  {
    "reviewer": "Joey T",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/903073695/",
    "review": "  Tangerine is most notorious for being shot on an iPhone 5s, but there's certainly plenty of heft in the narrative which is convincingly portrayed by some excellent performers. At the same time, Tangerine's first thirty minutes become repetitive, the characters and events can become annoying, and at times, the movie is excessive without having a legitimate reason for being so. Tangerine is still good on a thematic and story level, but I didn't find it to be a particularly \"enjoyable\" film. I won't go out of my way to see it again.",
    "rating": "35",
    "date": "August 12, 2015"
  },
  {
    "reviewer": "Harlequin68",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/900682338/",
    "review": "  In \"Tangerine,\" while celebrating Christmas Eve and her friend Sin-Dee(Kitana Kiki Rodriguez) being released from jail after a month at their favorite donut place, her friend Alexandra(Mya Taylor) accidentally lets slip that Sin-Dee's boyfriend Chester has been cheating on her. While she does have one bit of pertinent information about her, she does not have a name, leading Sin-Dee to start furiously looking for him. Alexandra agrees to help her, just as long as there is no drama. Which lasts all of five minutes, until they talk to Nash(Ian Edwards).With \"Tangerine,\" writer-director Sean Baker combines elements of neo-realism and screwball comedy with a superb use of locations for a winning combination. While the movie could be thought of as a holiday film with its focus on love, friendship and family, it does not look the other way, either, when it comes to the dangers of living and working on the streets. For Alexandra, her try at singing in a nightclub could be a sign of her reconsidering her options.",
    "rating": "40",
    "date": "August 12, 2015"
  },
  {
    "reviewer": "John K.",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/971594438/",
    "review": "  It's an impressive feat, but it does fall short because of a messy and sometimes petty plotline. I look forward to seeing movie from Sean Baker. Kitana Rodriguez and Mya Taylor, but Tangerine will likely be best remembered for the way it was filmed rather than direction or story.",
    "rating": "30",
    "date": "December 17, 2015"
  },
  {
    "reviewer": "Andrew D",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/783018127/",
    "review": "  Such a great great surprise. A movie about 2 transgender women but doesn't revolve around that. It's funny, current, fresh, and is amazing to see these 2 women perform and be amazing. Just netflix Tangerine immediately and watch it.",
    "rating": "50",
    "date": "January 8, 2016"
  },
  {
    "reviewer": "Nick D",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/845689761/",
    "review": "  You'd never know this tight, fierce little street drama was shot entirely on an iPhone 5s, except when I think about the fluidity of the close-ups and tracking shots in places like cabs, donut shops, and bathrooms, well, it's a long way from break-out sets on the studio lot, that's for sure. As is the subject: a bitch-match between street trannies, johns and assorted street folks radiating out from the core pair, Cind-ee and Alexandra. The former has just gotten out of jail on Christmas Eve and splits a forlorn donut with Alexandra who promptly rats out Chester, the boyfriend/pimp, who seems to have been boning a real girl with a vag. And we're off to the races, a startling, very real-feeling journey into the sun-bleached sadness of the working life. We meet a married Armenian cab driver who has a thing for chicks with dicks, and soon enough, his entire family. We meet the blond 'beeatch', who gets dragged along, literally, for the ride. And Chester, who is especially believable as the white trash, tatted up pimp who rules the world from a dollar donut shop. Great pacing, impressive performances, and technically, I'm telling you, it's a milestone.",
    "rating": "40",
    "date": "July 24, 2015"
  },
  {
    "reviewer": "kenscheck",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/890863156/",
    "review": "  Unique little movie about transgender prostitutes, including one who spends her first day free from jail searching for her pimp and boyfriend who she just found out cheated on her with a white girl. It's a funny film that looks into a subculture that you don't see in many movies, and it looks surprisingly cinematic for a film shot entirely on iPhones. I enjoyed this, it was weird and funny and unique...worth checking out if you aren't terribly conservative.",
    "rating": "40",
    "date": "December 7, 2015"
  },
  {
    "reviewer": "Jenna I",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/783718340/",
    "review": "  A great slice of life film that chooses to see the humor in what could have been a much more depressing film. However, that jovial spirit took away from the characters, teetering towards tired stereotypes a little too often for my taste. I think I would have preferred some more honesty throughout the entire film, instead of just at the end. That said, I loved Alexandra, she was really the best character in the film.Also- It's impressive that this was shot on iPhones but I found the camera work to be inconsistent, especially towards the beginning.",
    "rating": "30",
    "date": "December 6, 2015"
  },
  {
    "reviewer": "Hami W",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/973185083/",
    "review": "  The two tenets I hold when watching a movie is it needs to be engaging and entertaining. Many films have the ability to sustain these principles for the entirety of the film. This film was not only not engaging or entertaining but it sincerely challenged me to give up and stop watching. The acting is sub par, most of the heart of film I found was carried solely on the shoulders of Mya Taylor's performance but the scenes without her were either uncomfortable and unpleasant to watch, to the point where I needed to brake away from the film to regain my trust in human decency, other scenes were dull and lacked of substance to the point where on reflection I ponder if this was better off to be a short film. Some films skip the character developing aspect for an intricate story-line. Others do completely the opposite. This film did neither. Instead, this film was 80 minutes of one characters walks from the donut shop to find another character, finds her, then takes her back to the donut shop, during which I guess stuff just happens, for example, the taxi drivers character isn't developed further then he just prefers transsexual prostitutes and has a family and Mya Taylor's character goes around handing fliers for her performance, then you see her perform, and thats it. Credit where credit is due, the film has some great camera shots and the supersaturation of yellows at times gave the film a unique contrast of colours that where downright beautiful, and though I say this film was not engaging there were little times when I thought this movie was boring. There was constant movement and walking, but for me the bad parts of the film really spoke louder then the good, simply to the point where looking for anything good was like trying to find a hay in a needle stack. In conclusion this film wasn't made for me. I don't know who this film was made for. I think this could be considered a slice-of-life type film, where all the action in the film is done in one night, creating a naturalistic progression, and if you are into that stuff, fair enough. To others, this film will test you to point of considering walking away. Some films are so bad their good, others have a charm to this film. This film was just vile to watch. I wouldn't recommend it to people of similar taste to mine.",
    "rating": "05",
    "date": "January 24, 2016"
  },
  {
    "reviewer": "Bank K",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/865334756/",
    "review": "  Raw, vivid, and lively, Tangerine surpassed mediocrity of the whole transgender genre with nonstop humour, lovable performances of its cast, and uncustomary vibe of urban California.",
    "rating": "40",
    "date": "January 25, 2016"
  },
  {
    "reviewer": "John L",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/971255109/",
    "review": "  Dogme 95 modernized and on crack.",
    "rating": "40",
    "date": "January 25, 2016"
  },
  {
    "reviewer": "Magnus S",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/885747644/",
    "review": "  Innovative & hysterical indie cinema shot on an iPhone.",
    "rating": "35",
    "date": "January 24, 2016"
  },
  {
    "reviewer": "Gautham R",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/802289517/",
    "review": "  This was really a testament of technique. Always cool to see what can be done with cell phones. Then combine that with a really strange but creative story and you get a pretty cool movie with a bunch of visually striking imagery.",
    "rating": "40",
    "date": "January 23, 2016"
  },
  {
    "reviewer": "Alex M.",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/973158379/",
    "review": "  To me it seemed more than a comedy about transgender people. it is a potrait about a life, a world within los angeles i never saw. the personalities of this story are morally so different from everything i would call \"normal\". but at the same time I never lost sympathy for what they do, because in their environment it seemed perfectly plausible, and authentic.",
    "rating": "40",
    "date": "January 23, 2016"
  },
  {
    "reviewer": "Cylus O",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/903514811/",
    "review": "  Funny movie and a damn impressive one at that when you consider it was filmed using three iphone 5s.",
    "rating": "40",
    "date": "January 22, 2016"
  }
,
  {
    "reviewer": "boosh b.",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/973149572/",
    "review": "  I have to admit, I just don't see what all the hype is over this film...I totally agree with another critic's partial assessment of the movie (and I am taking this direct quote because I could not have said it better:\"...the film's colors are as electric as the characters' emotions, the setups and framing are fairly conventional...\" The pretty much sums it up: conventional. You basically have a very vibrant looking film, a great aesthetic, and some very good acting; but the story is extremely basic and, well, just not that interesting. Take away the whole cross-dressing, transgender element and you simply have another overrated \"mumblecore\" piece.",
    "rating": "20",
    "date": "January 29, 2016"
  },
  {
    "reviewer": "Hami W",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/973185083/",
    "review": "  The two tenets I hold when watching a movie is it needs to be engaging and entertaining. Many films have the ability to sustain these principles for the entirety of the film. This film was not only not engaging or entertaining but it sincerely challenged me to give up and stop watching. The acting is sub par, most of the heart of film I found was carried solely on the shoulders of Mya Taylor's performance but the scenes without her were either uncomfortable and unpleasant to watch, to the point where I needed to brake away from the film to regain my trust in human decency, other scenes were dull and lacked of substance to the point where on reflection I ponder if this was better off to be a short film. Some films skip the character developing aspect for an intricate story-line. Others do completely the opposite. This film did neither. Instead, this film was 80 minutes of one characters walks from the donut shop to find another character, finds her, then takes her back to the donut shop, during which I guess stuff just happens, for example, the taxi drivers character isn't developed further then he just prefers transsexual prostitutes and has a family and Mya Taylor's character goes around handing fliers for her performance, then you see her perform, and thats it. Credit where credit is due, the film has some great camera shots and the supersaturation of yellows at times gave the film a unique contrast of colours that where downright beautiful, and though I say this film was not engaging there were little times when I thought this movie was boring. There was constant movement and walking, but for me the bad parts of the film really spoke louder then the good, simply to the point where looking for anything good was like trying to find a hay in a needle stack. In conclusion this film wasn't made for me. I don't know who this film was made for. I think this could be considered a slice-of-life type film, where all the action in the film is done in one night, creating a naturalistic progression, and if you are into that stuff, fair enough. To others, this film will test you to point of considering walking away. Some films are so bad their good, others have a charm to this film. This film was just vile to watch. I wouldn't recommend it to people of similar taste to mine.",
    "rating": "05",
    "date": "January 24, 2016"
  },
  {
    "reviewer": "Bank K",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/865334756/",
    "review": "  Raw, vivid, and lively, Tangerine surpassed mediocrity of the whole transgender genre with nonstop humour, lovable performances of its cast, and uncustomary vibe of urban California.",
    "rating": "40",
    "date": "January 25, 2016"
  },
  {
    "reviewer": "John L",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/971255109/",
    "review": "  Dogme 95 modernized and on crack.",
    "rating": "40",
    "date": "January 25, 2016"
  },
  {
    "reviewer": "Leong C",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/829695330/",
    "review": "  Another example that low budget flick can be really good...",
    "rating": "40",
    "date": "January 25, 2016"
  },
  {
    "reviewer": "Sebastian T",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/817577480/",
    "review": "  Concept...hilarious. Script..yawn.",
    "rating": "20",
    "date": "January 24, 2016"
  },
  {
    "reviewer": "Magnus S",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/885747644/",
    "review": "  Innovative & hysterical indie cinema shot on an iPhone.",
    "rating": "35",
    "date": "January 24, 2016"
  },
  {
    "reviewer": "Gautham R",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/802289517/",
    "review": "  This was really a testament of technique. Always cool to see what can be done with cell phones. Then combine that with a really strange but creative story and you get a pretty cool movie with a bunch of visually striking imagery.",
    "rating": "40",
    "date": "January 23, 2016"
  },
  {
    "reviewer": "Alex M.",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/973158379/",
    "review": "  To me it seemed more than a comedy about transgender people. it is a potrait about a life, a world within los angeles i never saw. the personalities of this story are morally so different from everything i would call \"normal\". but at the same time I never lost sympathy for what they do, because in their environment it seemed perfectly plausible, and authentic.",
    "rating": "40",
    "date": "January 23, 2016"
  },
  {
    "reviewer": "Cylus O",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/903514811/",
    "review": "  Funny movie and a damn impressive one at that when you consider it was filmed using three iphone 5s.",
    "rating": "40",
    "date": "January 22, 2016"
  },
  {
    "reviewer": "Pablo G",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/962828500/",
    "review": "  The style ussually overshadows the substance by a mile as story development is left on the background for half the film, but it is nevertheless a breathtaking and unconventional film that is not for everyone but it most surely should be.",
    "rating": "35",
    "date": "January 20, 2016"
  },
  {
    "reviewer": "Alex H",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/868639184/",
    "review": "  Spontaneous, kooky, warm-hearted, f r e s h, really good.",
    "rating": "40",
    "date": "January 20, 2016"
  },
  {
    "reviewer": "August M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/817595137/",
    "review": "  Without a doubt the best transgender Christmas comedy you're likely to come across, Tangerine is both hilarious and heartfelt. Filmed entirely on an iPhone Tangerine also proves that you don't need big movie histrionics to make something compelling. Hell, all you need is the smart phone in your pocket! In that way, Tangerine is revolutionary and certainly indicative of the future of film making. It doesn't hurt that the characters are all well drawn and well acted. This is a very specific movie about a very specific group of people but, at the end of it all, they behave and want like any other person you'd come across.",
    "rating": "40",
    "date": "January 19, 2016"
  },
  {
    "reviewer": "Peter F",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/782851126/",
    "review": "  Having the honor of being the first film shot entirely on an I-phone, Tangerine boasts a look that's unique, contemporary, and unpolished, which all work in spades for the film's material. A story about the day in the life of two tranvestite prostitutes, the film will definitely strike familiar with Harmony Korrine's audience, although Tangerine is a far more fluid and energetic film compared to something like Kids. Frequently graphic, but just as fun as it is gritty, Tangerine avoids being exploitation, and ends on a rather heartbreaking note. With non-conformist video editing, and story-telling, and shot on a practically nonexistent budget, director Sean Baker has deftly proved himself to be a hot new talent to look out for!",
    "rating": "45",
    "date": "July 11, 2015"
  },
  {
    "reviewer": "Logan M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/794284974/",
    "review": "  It's funny how a film lauded by so many can be a complete miss for others. I have read and heard so many people commenting on how excellent the acting was, but I found everyone aside from Mya Taylor to be uninspiring. It should mean more than to just have people say words on screen to be considered great acting, hence why we don't parade Tara Reid and Adam Sandler around as the cream of the crop. Between the gimmick of shooting on an iPhone, which didn't add to the film experience in anyway, to the overall lack of quality in the edit, story, and acting, this film is tailored for the \"festival crowd\" who will always seek the oddities in art and herald them as masterpieces.",
    "rating": "20",
    "date": "January 17, 2016"
  },
  {
    "reviewer": "Eduardo R",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/954217274/",
    "review": "  Tangerine is extraordinary.",
    "rating": "40",
    "date": "January 17, 2016"
  },
  {
    "reviewer": "Brandon B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/803726340/",
    "review": "  Kitana Rodriguez and Mya Taylor are brilliant.",
    "rating": "50",
    "date": "August 6, 2015"
  },
  {
    "reviewer": "sleepyhead16",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/150944745/",
    "review": "  At last something entirely new !",
    "rating": "45",
    "date": "January 14, 2016"
  },
  {
    "reviewer": "Marty D.",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/972979297/",
    "review": "  Tangerine was a wild and confusing ride following the stories of unbelievably unique characters playing roles that are rarely ever portrayed in film. Characterization is exceptionally handled and the narrative compels and delivers a delightfully emotional tale.",
    "rating": "40",
    "date": "January 13, 2016"
  },
  {
    "reviewer": "Matt B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/808898247/",
    "review": "  Shot entirely on iPhones, Tangerine is mesmerizing; a brave example of how you can make an excellent movie with hardly any money. It's funny, well-acted, and deeply effective in its brutal depiction of downtown L.A and prostitution.",
    "rating": "45",
    "date": "January 11, 2016"
  }
,
  {
    "reviewer": "WS W",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/804776751/",
    "review": "  LGBT community credits the film for using real transgender actors for the roles.As for the film itself, it's just so... \"unconventional\".",
    "rating": "20",
    "date": "January 10, 2016"
  },
  {
    "reviewer": "Napat S",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/877522559/",
    "review": "  its style is as important to the story as its script.",
    "rating": "50",
    "date": "January 9, 2016"
  },
  {
    "reviewer": "Andrew D",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/783018127/",
    "review": "  Such a great great surprise. A movie about 2 transgender women but doesn't revolve around that. It's funny, current, fresh, and is amazing to see these 2 women perform and be amazing. Just netflix Tangerine immediately and watch it.",
    "rating": "50",
    "date": "January 8, 2016"
  },
  {
    "reviewer": "Derek M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/784618480/",
    "review": "  Despite the fact that the film picks up a little in the latter two-thirds... it's limited perspective and iphone 5 gimmick do not make it a legit film, but more of a caricature of one. Rated 2 out of 5. Reviewed 1/6/16.",
    "rating": "20",
    "date": "January 8, 2016"
  },
  {
    "reviewer": "Reece L",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/888687546/",
    "review": "  There's a charm to Tangerine's extremely low-budget, iPhone look, its radical style standing out amongst the standard glossy, mainstream fare that is championed come awards season. As an actual film, it mostly works, the two leads turning in consistently hilarious and genuinely heartfelt performances (Mya Taylor especially) to great effect. This aside, it can't keep up its initial explosive pace, lapsing into repetitive scenes where a character walks from place to place while aggressive music plays in the background to the point that it all starts to feel long at only 88 minutes. The subplot involving the cab driver is less compelling than the central narrative, and while it works for the most part, time spent away from the two leads is time that the audience doesn't get to spend in their presence and subsequently feels less interesting. While these problems hold Tangerine back from being something truly great, they can't snuff out its humor or its passion, a story of two transgender sex workers vital in an age where the stigma surrounding non-cis gender identity is still frighteningly pervasive.",
    "rating": "35",
    "date": "January 8, 2016"
  },
  {
    "reviewer": "Anthony I",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/914544585/",
    "review": "  Tangerine is the independent film of the year, and it's very obvious to see why. It was completely filmed on an iPhone. That's right, the same things that we use everyday, almost at ever hour of the day, made this movie. Guess what? An iPhone can make a really good movie. This is a groundbreaking moment for cinema. This opens the door to thousands of independent filmmakers who don't have the finances to make a great looking feature. It doesn't matter anymore. Anyone can make a great movie. Anyone can tell a great story. These are the golden ages, my friends.But what of the movie? What makes it so great? It's a down and dirty Christmas story about two transgendered prostitutes in the middle of a love triangle between a white-trash pimp and an Armenian cab driver (who tragically is a family man). The two main character of the film come across as loud and largely obnoxious, but you grow to kind of like them. They are proud to be walking the streets, and selling their bodies. Had these characters appeared in an early John Waters film, they might've been able to eclipse Divine. Speaking of Waters, this whole movie really reminded me of his work, and it's no wonder he placed it on his year-end list.The armenian cab driver is by far the most fascinating part. You just feel so bad for his family, and so bad for him. As his addiction unfolds right before their eyes, you just want to roll up in a ball and cringe.This movie is not without it's flaws, but it's also not without it's incredible moments. Just when I think i've seen everything from \"Tangerine\", the end sucker-punches me from behind. This film has many, many tricks up it's sleeve. It's a great, but very dark, comedy. Your 2015 movie list is truly not complete without seeing this.",
    "rating": "40",
    "date": "January 6, 2016"
  },
  {
    "reviewer": "Miguel R",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/918861268/",
    "review": "  A movie that nobody wants to see but everyone should.",
    "rating": "50",
    "date": "January 6, 2016"
  },
  {
    "reviewer": "Cheryl M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/922360366/",
    "review": "  You have got to be kidding. Whoever made this piece of crap must have connections in order to get it made into a movie, if you dare to call it that. Worst \"acting\" you can ever imagine. what a joke. I couldn't make it past 15 minutes. Absolutely horrible!!!",
    "rating": "10",
    "date": "January 6, 2016"
  },
  {
    "reviewer": "Kristina K",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/801365930/",
    "review": "  Don't think I'm cool enough.",
    "rating": "10",
    "date": "January 3, 2016"
  },
  {
    "reviewer": "J. Scott F",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/910301206/",
    "review": "  I made it through about 20 minutes of this film before I had to turn it off. It may be a unique film, but I found it annoying, grating and pointless. Maybe it is because I lived in these parts of LA and have known a lot of people like this - I'm not real fond of the attitudes, language, style & speech patterns. I'm not sure why so many critics found it so wonderful.",
    "rating": "10",
    "date": "July 6, 2015"
  },
  {
    "reviewer": "Ray B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/972889525/",
    "review": "  Grim. Very grim. Portrays the lives of transvestite prostitutes, a straight female streetwalker and a family man who destroys his life through his obsession with them. The acting, etc. w probably fine, but this is hardly an \"old fashioned comedy.\" I'm not sure who would like this film.",
    "rating": "10",
    "date": "January 2, 2016"
  },
  {
    "reviewer": "David B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/972868658/",
    "review": "  What a sick movie, transgender guy fighting over his druggie pimp with another drugged out whore. Great family entertainment. Cannot believe a 79% approval rate.....guess this is an indication of where we are heading!",
    "rating": "10",
    "date": "January 1, 2016"
  },
  {
    "reviewer": "Gabe L",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/909790618/",
    "review": "  Tangerine had the potential to be the most refreshing holiday film in years - a gonzo Christmas film fit for the least spirited. However, the film's relentless energy and pacing is thrown off by the visual style. The ridiculously fast shutter speed and burning color palette make for a bizarre, borderline nauseating experience, like a ninety-minute Instagram video, shot in CinemaScope, with three filters on it. The film was shot on an iPhone, so it might have been just that.",
    "rating": "25",
    "date": "December 31, 2015"
  },
  {
    "reviewer": "carrot p.",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/972847722/",
    "review": "  highly recommended! thoroughly enjoyable and emotional. would love to rewatch.",
    "rating": "50",
    "date": "December 31, 2015"
  },
  {
    "reviewer": "Rob O",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/908208414/",
    "review": "  4.0 / 5.0 Great characters, super cool style and all shot on beefed up iPhones. Pretty entertaining 90 minutes.",
    "rating": "40",
    "date": "December 30, 2015"
  },
  {
    "reviewer": "Auramadeus M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/961867740/",
    "review": "  ....M�nimo presupuesto + Gui�n concreto + Actuaciones convincentes + 1 escena + Concientizaci�n sobre la prostituc�on callejera + Idem drogas + Idem transexuales + Entretenimiento sencillo, pero asegurado = Tangerine6/10.",
    "date": "December 16, 2015"
  },
  {
    "reviewer": "Greg D",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/784304046/",
    "review": "  Shot entirely on an iPhone, Tangerine is a showcase for the entire cast and tells a compelling day in the life of transgender prostitutes in Los Angeles.",
    "rating": "45",
    "date": "December 29, 2015"
  },
  {
    "reviewer": "Nick D",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/845689761/",
    "review": "  You'd never know this tight, fierce little street drama was shot entirely on an iPhone 5s, except when I think about the fluidity of the close-ups and tracking shots in places like cabs, donut shops, and bathrooms, well, it's a long way from break-out sets on the studio lot, that's for sure. As is the subject: a bitch-match between street trannies, johns and assorted street folks radiating out from the core pair, Cind-ee and Alexandra. The former has just gotten out of jail on Christmas Eve and splits a forlorn donut with Alexandra who promptly rats out Chester, the boyfriend/pimp, who seems to have been boning a real girl with a vag. And we're off to the races, a startling, very real-feeling journey into the sun-bleached sadness of the working life. We meet a married Armenian cab driver who has a thing for chicks with dicks, and soon enough, his entire family. We meet the blond 'beeatch', who gets dragged along, literally, for the ride. And Chester, who is especially believable as the white trash, tatted up pimp who rules the world from a dollar donut shop. Great pacing, impressive performances, and technically, I'm telling you, it's a milestone.",
    "rating": "40",
    "date": "July 24, 2015"
  }
,
  {
    "reviewer": "Nick D",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/845689761/",
    "review": "  You'd never know this tight, fierce little street drama was shot entirely on an iPhone 5s, except when I think about the fluidity of the close-ups and tracking shots in places like cabs, donut shops, and bathrooms, well, it's a long way from break-out sets on the studio lot, that's for sure. As is the subject: a bitch-match between street trannies, johns and assorted street folks radiating out from the core pair, Cind-ee and Alexandra. The former has just gotten out of jail on Christmas Eve and splits a forlorn donut with Alexandra who promptly rats out Chester, the boyfriend/pimp, who seems to have been boning a real girl with a vag. And we're off to the races, a startling, very real-feeling journey into the sun-bleached sadness of the working life. We meet a married Armenian cab driver who has a thing for chicks with dicks, and soon enough, his entire family. We meet the blond 'beeatch', who gets dragged along, literally, for the ride. And Chester, who is especially believable as the white trash, tatted up pimp who rules the world from a dollar donut shop. Great pacing, impressive performances, and technically, I'm telling you, it's a milestone.",
    "rating": "40",
    "date": "July 24, 2015"
  },
  {
    "reviewer": "Rolando M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/813989577/",
    "review": "  A wild and comical little film. Shot using three iPhone 5S phones, only a 100K budget, and first time actors. Imagine how much better it would have been if they used my Sony Android phone with superior video resolution.",
    "rating": "30",
    "date": "December 29, 2015"
  },
  {
    "reviewer": "Phillip S",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/906531073/",
    "review": "  \"Tangerine\" is an incredibly weird, but surprisingly enjoyable film that is worth checking out.",
    "rating": "40",
    "date": "December 29, 2015"
  },
  {
    "reviewer": "David L",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/906520355/",
    "review": "  Remarkable and roaringly funny -- its the real lifestory of LA's \"Pretty Women\", well, the upper ho's and a simple plot but so well put together. It's not for everyone but you'll be sure to laugh out loud all the way through.",
    "rating": "45",
    "date": "December 27, 2015"
  },
  {
    "reviewer": "Tatsuhito K",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/906702164/",
    "review": "  Now this is an interesting film: a small independent film starring two transgender actresses, filmed entirely on modified iPhone 5s. Its unconventional filmmaking techniques blew everybody's minds when it first premiered at Sundance Film Festival. I have to say I didn't find that particularly groundbreaking, in fact, there were a lot of moments in the film that seemed like straight out of home-video cameras, which often took me out of the experience. But what makes this film going, what grabs us from the get-go is the realistic and surprisingly heartfelt story about minorities living in a big, crowded city, and when that's combined with the two strong lead performances, vibrantly colorful visuals and effectively in-your-face score, it becomes pretty engaging to watch. I did find the last act quite exhausting, partly because it was chaotic and so many things were happening all at once, but up until that point I was genuinely hooked. \"Los Angeles is a beautifully wrapped lie.\" I couldn't agree more. Tangerine is a unique indie.",
    "rating": "40",
    "date": "December 26, 2015"
  },
  {
    "reviewer": "Arum Padma O",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/862442197/",
    "review": "  The plot is pretty pointless but in the end, it's the part of the charm. Sometimes you only need iPhone to shoot, couple of great actors and simple story to make something beautiful. It reminds us how honest filmmaking is the best. And of course it's funny as well, gotta love Sindee and Alexandra!",
    "rating": "40",
    "date": "December 26, 2015"
  },
  {
    "reviewer": "Francisco O. A",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/905746087/",
    "review": "  \"Tangerine\" is funny, compelling and interesting. Its technical side it's impressive but it's the witty central characters, humorous realistic tone and fast pacing what makes it a great film.",
    "rating": "35",
    "date": "December 24, 2015"
  },
  {
    "reviewer": "Jae M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/972709687/",
    "review": "  This is some depressing shit. I won't be watching it again. But it's a damned well written flick which makes you feel for every character.",
    "rating": "50",
    "date": "December 24, 2015"
  },
  {
    "reviewer": "Alan W",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/795081994/",
    "review": "  My Alternative Christmas double-bill begins with this ultra lo-budget indie drama set on Christmas Eve in L.A. with a pair of transsexual prostitutes, a married Armenian taxi driver and a cheating pimp. Shot on an iPhone, the limitations are sometimes obvious, like when they have to shoot them walking and talking from behind, but for the most part, the film looks professional and pretty impressive considering its limited production values and uneven acting abilities, though Mya Taylor who plays the soulful Alexandria is a standout. More than ever, the presence of a good script will therefore make or break the film. Thankfully, despite stories that you'll find in an episode of Jerry Springer, it feels real and unsentimental, with bursts of wit and humour, in showing us the lonely lives of a bunch of Los Angelenos living on the fringe of society. It is not quite the 5 stars movie Time Out will have you think but it is original and fascinating to watch. Coupled with a weird but memorable cameo from veteran actor Clu Gulager and the most realistic vomit scene ever on screen, what more can you want from a film made for the price of your ticket?",
    "rating": "35",
    "date": "December 24, 2015"
  },
  {
    "reviewer": "Nathaniel B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/905167006/",
    "review": "  Very funny, incredibly innovative, and unexpectedly absorbing.",
    "rating": "40",
    "date": "December 23, 2015"
  },
  {
    "reviewer": "Craig T",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/785864933/",
    "review": "  The tangerine is sweeter and stronger than an orange, and this film has both sweetness and strength in surprising measure. It's proof that quality cinema can (and should) come in many forms and tell many stories. This one sneaks up on the viewer - at first jarring and slight, then layered and funny, and ultimately deceptively profound. I loved it and am ready for the sequel.",
    "rating": "35",
    "date": "December 22, 2015"
  },
  {
    "reviewer": "Richard B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/785313987/",
    "review": "  This little independent film definitely isn't for everyone, but I found myself impressed with this film. It was shot entirely on iPhones which is extremely impressive considering how good the film looks. The film consists of basically all new actors and they do a good job. I actually thought the film would have been better if a third story (maybe Chester's) would have been included and all 3 would have collided in the end, like the 2 did. Overall, tangerine is not a film for the general public, but I liked it for what it was, even though I thought it could have been better.",
    "rating": "35",
    "date": "December 22, 2015"
  },
  {
    "reviewer": "Ezra M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/915287992/",
    "review": "  Tangerine es una de las mejores pel�culas del 2015, su gui�n bien adaptado hace de la pel�cula un deleite total. Nunca pierde el ritmo y conforme avanza, la trama se vuelve mejor y mejor. El final es perfecto. Una pel�cula que sirve de ejemplo que cuando se quiere se puede, filmada enteramente con un iPhone 5 y es tan perfecta que ni se nota.",
    "rating": "45",
    "date": "December 21, 2015"
  },
  {
    "reviewer": "Jesse O",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/1202249/",
    "review": "  It's films like this that really help show why people need to keep an eye on independent filmmaking as this is unlike anything you will ever see out there. It's not that I would call it the most inventive film of all time, though I would call it fresh and lively, but it takes a look at a group of people that have been vastly under-represented in the movie world and that is transgender people, something that the film's description on this page fails to mention. Though, with shows like Transparent on Amazon, hopefully that perception is changing. Perhaps Transparent's, a show I haven't seen yet, only fault is the fact that it cast someone in the lead role, Jeffrey Tambor, whom I love, isn't someone who actually identifies with the character he plays. That's not his fault, of course, and I don't blame him for that, but it is something worth pointing out. This film casts two actresses in the lead roles who actually do identify with their characters in the film and this is so much better of a movie for it. Their performances are authentic and real and that is always a benefit. The film does a great job in not trying to create stereotypes out of these two people, which is something that a lot of films covering this very sensitive topic can be accused of doing. It takes a human and poignant approach to these characters. Showing all their flaws, all their roughness, but also showing us who they are as people and what makes them strong individuals. The film, again, doesn't sugarcoat any of Sin-Dee's or Alexandra's flaws, they're right up in your face, but that, and Kitana's and Mya's performances as Sin-Dee and Alexandra respectively, also shows us that they are complex human beings, the film doesn't explicitly tells us everything that's going on in their lives, but you can tell that they, and really every character that's focused on in the film, is really try to make the best of their situation, even if it might seem fucked up to others. So I thought that was well-done, it's a movie that's manic and it entertains, but it's also one that never forgets to look at its characters with respect. One of the things I liked about the movie, and this is something I tend to like a lot when it's done, is how everything and everyone seems to be heading to the same end. Like there's a clear endgame in sight and everything in the film is the steps to get there. Because of that, the film is incredibly focused. There's no wasted motion in the film, everything here serves an actual purpose in where they want to go by the ending. The film, also, is in constant motion so it moves at a really brisk pace because of that, no one sticks around in one place for long. The film was actually shot entirely, due to budget constraints, on three iPhones, which I found incredibly impressive. I'm not saying that the movie looks as good as some of the bigger budgeted independent films, but it looks pretty damn good. And I'm sure there's a lot of tricks being pulled in post, but the look adds so much to the feel and tone of the film. It adds to the film's authenticity. I know it's a cliche to say that the city is a character, but I think it really does apply in this cause, because the city affects, perhaps in more subtle ways, the way the characters in the films lead their lives. Maybe they moved to LA with hopes of grandeur, like many others, only to find themselves in the seedier parts of it, so that worked really well. All in all, this is an excellent film and one that, honestly, really sneaked up on me. It's one of the sleeper hits of the year, for sure, and one that I would wholeheartedly recommend.",
    "rating": "40",
    "date": "December 21, 2015"
  },
  {
    "reviewer": "Brenda D",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/913747790/",
    "review": "  I watched it because it was made with iPhones. I did not like the theme and really could not empathize with any of the characters.",
    "rating": "05",
    "date": "December 20, 2015"
  },
  {
    "reviewer": "Anthony K",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/907023216/",
    "review": "  Devastating. Unbelievable. Apparently shot on an iPhone 5, with a limited budget (obviously) that turns the blocking and set pieces into something almost like a stage play. But the kinetic energy with which this film flits through LA is truly remarkable - even more so is the warmth, intelligence, and humor that Tangerine brings to an incredibly underrepresented community.",
    "rating": "45",
    "date": "December 10, 2015"
  },
  {
    "reviewer": "J B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/783444580/",
    "review": "  Vibrant, unapologetic and bitingly funny.",
    "rating": "40",
    "date": "July 19, 2015"
  },
  {
    "reviewer": "John K.",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/971594438/",
    "review": "  It's an impressive feat, but it does fall short because of a messy and sometimes petty plotline. I look forward to seeing movie from Sean Baker. Kitana Rodriguez and Mya Taylor, but Tangerine will likely be best remembered for the way it was filmed rather than direction or story.",
    "rating": "30",
    "date": "December 17, 2015"
  },
  {
    "reviewer": "Mark A",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/906756406/",
    "review": "  With its stripped-down, lively aesthetic and committed naturalistic performances, Tangerine is a thoroughly original and entertaining indie. However, it is a total tonal jumble, often confusing sadism for pathos, and at times, humor- there isn't a single character worth rooting for",
    "rating": "35",
    "date": "December 16, 2015"
  }
,
  {
    "reviewer": "Brian S",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/797749670/",
    "review": "  Sean Baker's Tangerine is bound to be one of the Water-Cooler Films of 2015. It was shot entirely on an array of iPhone 5s, a majority of its story-an effective one-is not mainstream in the slightest and it is a unique glimpse into what independent cinema can potentially look like-showing the world what is achievable with inventive use of resources. After the initial visual acceptance that this is shot on iPhone (the opening looks like an above-average YouTube video), Baker and his cast and crew do an accomplished effort in immersing you into this crazy, insightful and interesting world they create (which happens to be on Christmas Eve). In the state of \"normalcy\" that is presented, Baker uses deft comedic timing and curious use of editing and music selection to help push the rather straightforward plot into motion. It is telling that by the time the film ends talk of how the picture looked isn't the main topic of discussion (although there are some great looking scenes), rather it is how well the story is told and the scope of it all. Tangerine could have been a gimmick-an attention seeker that was hitting its moment in the zeitgeist-but Baker knew that the long lasting stories are the ones told well.",
    "rating": "40",
    "date": "December 15, 2015"
  },
  {
    "reviewer": "David L",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/901488735/",
    "review": "  Tangerine does have a weaker first half with too quick pace, unlikable characters at first and annoying score, but the second half is anything but as the score is better, the pacing slows down and the characters get much development and become really likable with the sweet relationship between the two protagonists at the center of the film being the highlight. It is also superbly well acted, shot and directed and it has a big heart and some laughs as well. It is unique and new, but also so heartwarming in the end and such a pleasant surprise.",
    "rating": "40",
    "date": "December 15, 2015"
  },
  {
    "reviewer": "Kong L",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/907149831/",
    "review": "  \"AMAZING | CONVINCING | EXPLICIT | OFF-BEAT\" (90-out-of-100)",
    "rating": "45",
    "date": "December 15, 2015"
  },
  {
    "reviewer": "Carlos M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/891372896/",
    "review": "  A refreshing proof that you can make a funny and insightful film with a simple plot, naturalistic performances and an iPhone 5s - which adds to it and makes it look even more authentic, like a realistic fairy tale in the streets of L.A. (the character's name is even Sin-Dee Rella).",
    "rating": "40",
    "date": "December 13, 2015"
  },
  {
    "reviewer": "Mike M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/868368368/",
    "review": "  This one is going to become my \"go to\" Christmas movie. You have never seen anything like it. Kitana Kiki Rodriquez and Mya Taylor are fabulous in their lead as is Mickey O'Hagen the tweaker prostiture real fish they drag around the city. Funny and audacious this film really captures the essence of Highland and Santa Monica (my old hood) A classic!",
    "rating": "50",
    "date": "December 13, 2015"
  },
  {
    "reviewer": "Richard S",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/851405698/",
    "review": "  It's a good movie, elevated by really solid performances, but it wobbles a bit under the weight of its style.",
    "rating": "35",
    "date": "December 13, 2015"
  },
  {
    "reviewer": "Kristina H",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/972576070/",
    "review": "  Jokes almost always hide a truth. This movie is funny, but also hides some painful truths.",
    "rating": "40",
    "date": "December 13, 2015"
  },
  {
    "reviewer": "peanutdonut",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/900842936/",
    "review": "  Funny and touching (and a little educational)",
    "rating": "40",
    "date": "December 13, 2015"
  },
  {
    "reviewer": "David J",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/918209822/",
    "review": "  LA's bright skies mask something much darker this holiday season: Angry prostitutes, an unfaithful Armenian taxi driver, drug usage, and plenty of bodily fluids. Director Sean Baker and plenty of critics would have you think that \"Tangerine\" is some form of high art, but the disgusting acts on display here don't look any prettier through a glittery lens, in front of giant murals, under LA's beautiful sunset, or with classical music playing over it. Would it be bad if I said that, within the first half-hour, I thought this was the next outrageous Larry Charles social commentary starring Sacha Baron Cohen with an ironic underlying message about friendship? That aside, there's nothing special to see here.",
    "rating": "25",
    "date": "December 12, 2015"
  },
  {
    "reviewer": "Facebook U",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/935590807/",
    "review": "  Despite a somewhat thin narrative, this wonderfully innovative comedy succeeds by delivering a deft mixture of hearty laughs and touching moments while providing an engaging inside look at a little-known subculture. Fine performances, inventive cinematography and clever dialogue make this a surprise treat, especially for those who appreciate films that take on the unexplored.",
    "rating": "40",
    "date": "December 12, 2015"
  },
  {
    "reviewer": "Cody C",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/784322380/",
    "review": "  So fucking good. Best of the year",
    "rating": "45",
    "date": "December 11, 2015"
  },
  {
    "reviewer": "Kevin C",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/906463663/",
    "review": "  All those trannies, hookers, and low-lifes deserve an oscar. then again, i'm not sure if they were really acting or not lol",
    "rating": "45",
    "date": "December 9, 2015"
  },
  {
    "reviewer": "Logan D. M.",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/970115043/",
    "review": "  With a realistic story and plenty of compelling characters, \"Tangerine\" is indie filmmaking at its most raw and charismatic.",
    "rating": "45",
    "date": "December 4, 2015"
  },
  {
    "reviewer": "Sergio Andres P",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/946409154/",
    "review": "  \"Tangerine\" is surprisingly good, beyond all that sexual content and vicious references, this tells a sad and raw situation for the \"transgender\" community, their limited thoughts, discussions and moralists actions. Technically it is an innovative accomplishment, filmed with an iPhone 5 manages to create a stunning visual setting accompanied by a soundtrack that transports you and makes you feel that rawness. 4/5",
    "rating": "40",
    "date": "December 8, 2015"
  },
  {
    "reviewer": "Greg N",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/907111989/",
    "review": "  The fact the movie was shot using an iPhone is surprisingly the least interesting part of this film.",
    "rating": "40",
    "date": "December 8, 2015"
  },
  {
    "reviewer": "kenscheck",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/890863156/",
    "review": "  Unique little movie about transgender prostitutes, including one who spends her first day free from jail searching for her pimp and boyfriend who she just found out cheated on her with a white girl. It's a funny film that looks into a subculture that you don't see in many movies, and it looks surprisingly cinematic for a film shot entirely on iPhones. I enjoyed this, it was weird and funny and unique...worth checking out if you aren't terribly conservative.",
    "rating": "40",
    "date": "December 7, 2015"
  },
  {
    "reviewer": "Peter C",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/545822697/",
    "review": "  O filme gravado com um celular Iphone 5S, tras uma vis�o triste e realista com um humor selvagem e inescrupuloso com uma gama de personagens tristes, engra�ados e desesperados.� uma declara��o de independ�ncia do dinheiro dos est�dios, da est�tica e da representa��o Hollywood como a cidade onde se cumpre o sonho americano.\"Tangerine\" � como Sin-Dee Rella, a protagonista. � diferente na apar�ncia, mas no fundo � bastante normal, � um drama, mas te provocar� um sorriso; � trai��o e amizade, � amor e sexo.",
    "rating": "45",
    "date": "December 6, 2015"
  },
  {
    "reviewer": "Jenna I",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/783718340/",
    "review": "  A great slice of life film that chooses to see the humor in what could have been a much more depressing film. However, that jovial spirit took away from the characters, teetering towards tired stereotypes a little too often for my taste. I think I would have preferred some more honesty throughout the entire film, instead of just at the end. That said, I loved Alexandra, she was really the best character in the film.Also- It's impressive that this was shot on iPhones but I found the camera work to be inconsistent, especially towards the beginning.",
    "rating": "30",
    "date": "December 6, 2015"
  },
  {
    "reviewer": "Kevin P",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/907903152/",
    "review": "  Indrukwekkende kijk op het rauwe straatleven, dat desondanks de grimmige toon toch heel grappig en oplevend kan zijn. Dit bewijst zonder twijfel dat transseksuele acteurs/actrices zeker een film kunnen dragen, en meer werk zouden moeten krijgen !",
    "rating": "40",
    "date": "December 6, 2015"
  },
  {
    "reviewer": "Chad B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/786923056/",
    "review": "  This is an absolute must see. The entire movie was filmed on an iphone. Sean Baker did a phenominal job directing this",
    "rating": "45",
    "date": "December 4, 2015"
  }
,
  {
    "reviewer": "Alex J",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/972268584/",
    "review": "  As a straight guy myself, i was pretty uncomfortable while watching Tangerine,. as it had many sexual scenes which almost made me puke. But keeping that thing aside i really enjoyed Tangerine. The fact that the whole movie was shot on an i-phone is a Big Shock to me. The actors were great. You really feel for these characters..especially the girl who was dragged brutally from one place to another. Great Movie.Overall Ratings: 87%",
    "rating": "45",
    "date": "December 3, 2015"
  },
  {
    "reviewer": "Jacob Z.",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/968923847/",
    "review": "  The kind of movie you don't expect to be great at all due to it's extremely cheap filming style on an iPhone. Nonetheless writer-director Sean Baker and his talented mostly unknown cast makes the most of what they've got and deliver a good old fashioned dramedy with constantly funny dialogue and is surprisingly fleshed out.",
    "rating": "45",
    "date": "August 4, 2015"
  },
  {
    "reviewer": "Craig F",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/907233324/",
    "review": "  Visually, technically, and narratively unique.",
    "rating": "30",
    "date": "August 9, 2015"
  },
  {
    "reviewer": "Lucy M.",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/971160763/",
    "review": "  Dreadful movie - a road trip movie to a place I never want to go to again. Not funny, not interesting, not enlightening, not engaging. I go to the movies a lot and this is one of the worst I've ever seen.",
    "rating": "05",
    "date": "December 1, 2015"
  },
  {
    "reviewer": "Dany L",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/908062309/",
    "review": "  Funny, wildly authentic, shocking and all filmed on a iphone. Set's the bar for indie film making.",
    "rating": "40",
    "date": "November 29, 2015"
  },
  {
    "reviewer": "Joe C",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/788363715/",
    "review": "  This movie is absolutely awful. I have no idea why it got such high ratings. The dialogue is awful and the storyline is vacuous and uninteresting. There really is no character development that makes you actually care what happens to the people in this movie.",
    "rating": "05",
    "date": "November 28, 2015"
  },
  {
    "reviewer": "Thurman A",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/929787703/",
    "review": "  Really strange and artful!",
    "date": "November 27, 2015"
  },
  {
    "reviewer": "Kevin L",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/795129248/",
    "review": "  Some salt of the earth characters. Chock full of profanity and shenanigans. Ultimately a story of friendship.",
    "rating": "35",
    "date": "November 26, 2015"
  },
  {
    "reviewer": "Nick C",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/972195847/",
    "review": "  Shot on an iPhone throughout the whole movie, Tangerine offers some very big laughs and a riveting story.",
    "rating": "45",
    "date": "November 23, 2015"
  },
  {
    "reviewer": "Jason B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/802430747/",
    "review": "  I think this may be the first movie about transgender prostitutes I've seen. And it was pretty good! And shot on an iPhone no less. Had a good energy about it and performances were entertaining.",
    "rating": "35",
    "date": "November 22, 2015"
  },
  {
    "reviewer": "Greg W",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/872965938/",
    "review": "  u get 'em grrrrrl & fuck their shit up!!!!!!!!",
    "rating": "30",
    "date": "October 9, 2015"
  },
  {
    "reviewer": "Lester Y",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/830694564/",
    "review": "  \"los angeles is a beautifully wrapped lie\"",
    "rating": "40",
    "date": "November 18, 2015"
  },
  {
    "reviewer": "Jimmy H",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/905408626/",
    "review": "  \"Tangerine,\" proves that anyone with an iPhone can be Steven Spielberg. The entire movie was shot on an iPhone 5. Strictly for adults. Watch it once then do the \"Three B's.\" Burn it, bury it or blow it up. Stars no one you'll know, but that OK, but that's OK, as the real star is the story and the way it is told and filmed. If you want to take a walk on the wild side, venture outside the box, check out this VERY adult adventure. Filmed on the seedy streets that I travel everyday.",
    "rating": "30",
    "date": "November 16, 2015"
  },
  {
    "reviewer": "Trenton L",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/835386530/",
    "review": "  A very strong cast with bold performances from lead transgender actresses, Kiki Rodriguez and Mya Taylor --- the film itself is very funny and entertaining from beginning to end --- the music for the film is great --- the film also have some very dramatic moments which showcase how brilliant the director is. The style which the movie were shot, fits it, and makes it even more unique. One of the years best films and it deserves all its nominations that at the Gotham Independent Film Awards",
    "rating": "45",
    "date": "July 12, 2015"
  },
  {
    "reviewer": "Di V",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/862168366/",
    "review": "  My kind of Christmas movie! Looks fantastic....",
    "rating": "wts",
    "date": "November 11, 2015"
  },
  {
    "reviewer": "Tom S",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/785718590/",
    "review": "  OK, transgender people are the stars of the film. Let's get over that and maybe we'd realise it's actually quite boring. Shame as I've never seen the subject covered before.",
    "rating": "25",
    "date": "November 10, 2015"
  },
  {
    "reviewer": "Blake P",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/909783806/",
    "review": "  Before I can begin my critique of \"Tangerine,\" let me start by applauding it for being one of the first films to be headlined by transgender actresses, giving them juicy parts that do not rely on the weight of a mainstream star or a more conventional supporting player. There is not a Jared Leto, an Eddie Redmayne in sight. We don't have to have a discussion in which we call a cisgender actor \"brave\" for playing the part of a transgender woman: finally, we are given the opportunity to see the cinematically underrepresented demographic in a movie that rewards them considerably. That being said, \"Tangerine\" is not an entirely successful film, sizzling with chattery virtuosity for the most part but sometimes coming across as being too improvised. Some of the film is organically, fluently funny, while other moments, particularly its climax, meant to be a screwball-esque showdown, ultimately come across as being forced, attempts to fulfill Baker's idea for a film modern in its cultural expression but old-fashioned in its laughs. Yet \"Tangerine,\" shot using three iPhone 5 smartphones and edited with Final Cut Pro, is, for the majority of its length, a notable example of a film that overcomes its budgetary constraints by having enough flair to fill the gaps left open by cash and quick filmmaking. It stars Kitana Kiki Rodriguez and Mya Taylor as Sin-Dee Rella and Alexandra, best friends navigating life in Los Angeles through sex work and dreams of stardom. Sin-Dee has just finished a twenty-eight day prison sentence and hopes to resume the serious relationship she was in with her pimp, Chester (James Ransone). But when she discovers that he has been unfaithful, with a cisgender prostitute (Mickey O'Hagan), no less, she goes on a rampage that Alexandra, who is trying to advertise her hours away cabaret show, does not want to be a part of. It doesn't help that it's Christmas Eve - revenge is made simpler, the streets being mostly empty. When \"Tangerine\" threatens to fly off the rails into independent filmmaking oblivion, with Baker employing amateurish techniques such as near constant Kardashian soundtrack echoes and side plots without the eventual importance of a Robert Altman hued one, it is Rodriguez and Taylor that keep our interest. Both crackle with an energy hard to come by in the mainstream - their genuine thrill to be leads in a movie (a rarity in the transgender community) is obvious, and they possess an irrepressible talent that can only be called infectious. I love the way Rodriguez fast walks nearly everywhere she goes like a model late to fashion week, extraordinarily confident and extraordinarily courageous, and I love the way that Taylor can appear thoroughly wise beyond her years with just a foreboding glance. They are a massively charismatic duo.  And though \"Tangerine\" isn't the film of the year, it is at least a magnificent magnification of social change in the movies. That, in itself, is a triumph worth talking about.",
    "rating": "30",
    "date": "November 10, 2015"
  },
  {
    "reviewer": "Madmartigan",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/901333002/",
    "review": "  It's certainly interesting and engaging.",
    "rating": "30",
    "date": "November 9, 2015"
  },
  {
    "reviewer": "Liam G",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/904852337/",
    "review": "  This knocked my socks off. Groundbreaking from a technical point of view, 'Tangerine' takes us on a hectic trip through the streets of Los Angeles with two brassy, troubled but compelling trans women. The first half offers the biggest laughs of any film in 2015 so far, but where the movie really takes flight is in its second half, where it offers an insight into people who, in a vast city during one of the busiest times of the year, are forced to bear a life of loneliness and discomfort. It earns the unorthodox music cues, it earns the howls of laughter, it earns the tonal shifts, it earns the tears and in truth, 'Tangerine' earns recognition as one of the best films of 2015.",
    "rating": "45",
    "date": "November 9, 2015"
  }
,
  {
    "reviewer": "Tiago C",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/939408327/",
    "review": "  Filme sobre um travesti que, quando sai da cadeia, descobre que seu namorado o traiu. A partir da�, come�a uma busca pela ruas da cidade at� encontrar a mulher com quem ele o traiu desencadeando uma s�rie de acontecimentos na vida das pessoas que o circundam. Boa dire��o e filtro com tons quentes. Roteiro diferente por abordar o mundo sujo e desbocado dos travestis. Mediano.",
    "rating": "30",
    "date": "November 7, 2015"
  },
  {
    "reviewer": "Chris C",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/820627960/",
    "review": "  biting, striking, funny, heartbreaking, beautiful, and thought-provoking. Everything you want in a film.",
    "rating": "40",
    "date": "November 3, 2015"
  },
  {
    "reviewer": "Graham B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/784063724/",
    "review": "  A dramatic comedy of errors focusing on trans-sexual prostitutes and their tricks, on Christmas eve in West Hollywood.Alexandria and Sin-Dee are celebrating Sin-Dee's release from jail and xmas eve, when Alexandria slips that Sin-Dee's boyfriend has been cheating on her when she was in prison. Bitch wants some comeuppance. This is a mesmorising drama and super real. It's all shot on iPhone cameras, but blimey it is great to look at. Superb acting. Great storyline. Just great.Tiny budget film done good. Watch it.",
    "rating": "45",
    "date": "November 3, 2015"
  },
  {
    "reviewer": "Kace C",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/820543051/",
    "review": "  Tangerine [US, 2015] Funny and adorable. My favourite comedy of 2015. 7.5/10",
    "rating": "35",
    "date": "November 3, 2015"
  },
  {
    "reviewer": "Alfin N",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/881538577/",
    "review": "  Life goes on in Hollywood.",
    "rating": "40",
    "date": "November 2, 2015"
  },
  {
    "reviewer": "Satoko H",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/868853905/",
    "review": "  one of the best movies i have seen lately, an electric comedy that is grounded in great authentic characters and an emotional undercurrent that deals with friendship, loneliness, anger and love in such a natural and empathetic way, it is just as emotional as it is funny. there is no preachiness or saccharine bullshit going on which makes it even more of an enjoyable watch.",
    "rating": "50",
    "date": "October 30, 2015"
  },
  {
    "reviewer": "Glenn G",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/799709308/",
    "review": "  MIDNIGHT COWGIRL - My Review of TANGERINE (4 Stars)I spent the years from 2000-2005 working as a health educator inside the LA County Mens Central Jail, primarily in its notorious \"K-11\" dorms where LGBT inmates were housed. I've often been asked to describe it, and my go-to answer has always been, \"It's as if they rounded up everyone on the corner of Santa Monica Blvd. and Highland and threw them in a cell together.\" For those out of the loop, that intersection is notoriously where transgender prostitutes ply their trade, with Donut Time being a place to rest their feet.I share this to contextualize the opening minutes of writer/director Sean Baker's (along with co-writer Chris Bergoch) propulsive, engaging, hilariously grimy TANGERINE. Just out of jail and sharing a Christmas Eve morning donut with her pal and co-worker Alexandra (Mya Taylor), Sin-Dee (Kitana Kiki Rodriguez) quickly learns that her pimp boyfriend Chester (James Ransone) has been cheating on her. Immediately, I thought, \"This film is soon K-11\", expertly capturing the lingo, confidence, smarts and outrage of its inhabitants. Like any good screenplay, the story is expertly set in motion as Sin-Dee and a drama averse Alexandra hurtle their way through the tough, sunlit streets of Los Angeles in search of the pair who did her wrong.Shot on tricked-out iPhones by Baker and Radium Cheung), TANGERINE may be a no-budget indie, but its style and feel for the streets of LA couldn't be more dead-on. Basically one long extended chase sequence, our cinematographers keeps the cameras moving and swooping around our subjects, a perfect way to capture our strutting divas. This is the underbelly of the city, you know, where people do more walking than driving and are actually used to interacting with each other. Along the way, Alexandra continuously hits up acquaintances to come to her show that night at Hamburger Mary's, while Sin-Dee badgers anyone and everyone as to the whereabouts of Chester and a woman whose name begins with a \"D\". Yep, that's all Sin-Dee has to go by, yet this ferocious survivor knows how to find her way. A somewhat random \"B\" story emerges involving a taxi driver Razmik (Karren Karagulian) and his many fares. For a while, I didn't know why we were watching these vignettes, but I was glad I stuck with it, as connections start to emerge. Regardless, there's an unforgettable moment when the driver encounters the worst kind of drunk passengers imaginable, which will force me to bring 409 with me whenever I get into another cab. Eventually, Razmik's story helps weave the fabric of the story together as everyone faces the inevitable question of whether they prefer to be alone in this world or not.Believe me, it's a tough world at best, and TANGERINE captures anger, desperation and the need to connect with another human being in ways I haven't experienced since John Schlesinger's classic MIDNIGHT COWBOY. Like Ratso and Buck, Sin-Dee and Alexandra need each other more than they know. The glaring light, street sounds and reliance on percussion on the soundtrack evoke an LA more common than its glamorous cinematic counterparts. I felt every bead of sweat and every step of their journey. There's a bravura sequence in which Alexandra busts into a seedy motel room and literally drags one of its occupants all over the city. The push-pull of their relationship is fascinating, never knowing which one is really playing the other. The emotions in this film play on so many different levels, I was astounded. Our leading pair can be quite theatrical when necessary, but there's real tenderness underneath the surface, especially during the stunning final scene. As the harsh light of day turns to desolate night, your heart comes to ache for this pair. If you're gonna live in a world where everything and anything can be your enemy, you could do worse than have a Sin-Dee or an Alexandra on your side. Laughing one minute and then cringing at how dark and combative their world can be, I came to care about the people of TANGERINE. It's a buddy movie with street smarts.",
    "rating": "40",
    "date": "September 18, 2015"
  },
  {
    "reviewer": "Bryan S",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/830029266/",
    "review": "  The movie was pretty funny and entertaining from start to.... the ending was lack luster.",
    "rating": "35",
    "date": "September 16, 2015"
  },
  {
    "reviewer": "k.g. lee",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/951091027/",
    "review": "  A- Wickedly funny, and surprisingly well paced. It would've been easy for this movie to go off the rails, into a cliche' riddled diva-land, of sorts, but the humane heart at it's center keeps that from happening. The movie never wallows in the obvious challenge of the lifestyles herein... it runs past those assumptions with great confidence and a strong cast of unknowns (to me, anyway); with at least one star being born (Kitina Kiki as Sin-Dee).",
    "rating": "40",
    "date": "September 13, 2015"
  },
  {
    "reviewer": "Sandra S",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/969186958/",
    "review": "  The story is simple. The characters have depth and you genuinely become attached to them over time. The filming and editing is unusual - different views of the same scene, pace changes, and cutaways are used for comedic effect and transfer emotion into the viewer. The film explores dignity, friendship, marriage and sex.",
    "rating": "45",
    "date": "September 10, 2015"
  },
  {
    "reviewer": "Joey T",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/903073695/",
    "review": "  Tangerine is most notorious for being shot on an iPhone 5s, but there's certainly plenty of heft in the narrative which is convincingly portrayed by some excellent performers. At the same time, Tangerine's first thirty minutes become repetitive, the characters and events can become annoying, and at times, the movie is excessive without having a legitimate reason for being so. Tangerine is still good on a thematic and story level, but I didn't find it to be a particularly \"enjoyable\" film. I won't go out of my way to see it again.",
    "rating": "35",
    "date": "August 12, 2015"
  },
  {
    "reviewer": "Kyle B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/891925965/",
    "review": "  A truly unique, one of a kind movie with great breakout performances all around. Mya Taylor is great and Kitana Rodriguez is great but was a little over the top in some moments that made it unbelievable, but only a few times. I liked the \"all in one day\" story structure but there were things in the movie that could have been cut that weren't essential to the plot. It just started to drag towards the end and for an 88 min movie, it felt over 2 hours. The whole sub plot with the taxi driver just got in the way with the rhythm and the pacing of the movie, It has a reason by the end but the movie would have been better if that plot line wasn't weaved in to the far more interesting plot line. The screenplay is really wonderful and real and the cinematography is cool with it all being shot on iPhones. You forget that mid way because it looks so good. Sean Baker does a really great job directing this. The movie felt very episodic especially with those taxi cab sequences in between but like I said, without those scenes the movie would have flowed a lot better. This is definitely worth seeking out either in theaters or when it comes out on DVD.",
    "rating": "40",
    "date": "August 11, 2015"
  },
  {
    "reviewer": "Thomas K",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/921416673/",
    "review": "  Ingeniously crafted and shot on an iPhone, with a truly fine cast, this is the film all you folks should have been flocking to. The full house we saw it in couldn't have possibly had a better time.",
    "rating": "40",
    "date": "July 12, 2015"
  },
  {
    "reviewer": "Duncan C",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/877944711/",
    "review": "  NZIFF #1: Fresh, funny, vibrant and so goddam alive with messy, wonderful, crazy humanity.",
    "rating": "40",
    "date": "August 26, 2015"
  },
  {
    "reviewer": "Chase L",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/908198379/",
    "review": "  so well done I kept thinking it was all real. captivating, brilliant acting, loved the whole look of the movie. I was surprised it had such a strong story. Funny too.",
    "rating": "50",
    "date": "August 23, 2015"
  },
  {
    "reviewer": "Lee M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/791471625/",
    "review": "  It's not the just technology and law-breaking that make this movie so ingeniously unique. It's the people, the place, the electric sense of movement and the biting sense of humor.",
    "rating": "40",
    "date": "July 10, 2015"
  },
  {
    "reviewer": "Harlequin68",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/900682338/",
    "review": "  In \"Tangerine,\" while celebrating Christmas Eve and her friend Sin-Dee(Kitana Kiki Rodriguez) being released from jail after a month at their favorite donut place, her friend Alexandra(Mya Taylor) accidentally lets slip that Sin-Dee's boyfriend Chester has been cheating on her. While she does have one bit of pertinent information about her, she does not have a name, leading Sin-Dee to start furiously looking for him. Alexandra agrees to help her, just as long as there is no drama. Which lasts all of five minutes, until they talk to Nash(Ian Edwards).With \"Tangerine,\" writer-director Sean Baker combines elements of neo-realism and screwball comedy with a superb use of locations for a winning combination. While the movie could be thought of as a holiday film with its focus on love, friendship and family, it does not look the other way, either, when it comes to the dangers of living and working on the streets. For Alexandra, her try at singing in a nightclub could be a sign of her reconsidering her options.",
    "rating": "40",
    "date": "August 12, 2015"
  },
  {
    "reviewer": "vh",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/900683813/",
    "review": "  Sin-Dee and Alexandra are transgender hooker pals who begin their Christmas Eve day by sharing a pastry at a Hollywood Donut shop. Sin-Dee's just been released after a month in jail and when Alexandra foolishly lets slip that her pimp/boyfriend has been busy cheating on her with some new white bitch, an enraged Sin-Dee sets out on a mission to hunt them both down. As the girls race from one seedy neighborhood haunt to the next, Alexandra alternates between trying to calm her friend down and handing out flyers promoting her one-woman show later that evening. \"Tangerine\" is in turns funny, sad, and sweet. It's more about friendship than anything else -- the friends just happen to be hilariously-profane tranny hustlers. Much of the buzz surrounding this film has to do with the fact that it was shot using a trio of iPhone 5s, but I didn't know this when I saw it and it certainly wasn't apparent. Though this feat of technology may help garner it some extra attention, \"Tangerine\" stands on its own high-heeled boots without any gimmicks.",
    "rating": "40",
    "date": "August 9, 2015"
  },
  {
    "reviewer": "Justin J",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/907943546/",
    "review": "  This film is full of life. It's cool when a film lets its characters be people, and lets its setting exist as it is. Knowing the low budget nature of the film (shot on an iphone) you'd figure they didn't have sets built or anything or the sort, but only in seeing the film do you realize how this becomes an important element to the story. Tangerine takes place in a poor community that represents all kinds of races and gender identities. The film asks us, do we really only need our resources to make a compelling film? Aren't everyday people the most intriguing of all? And of course it answers those in the affirmative. The characters are very believable and never do the filmmakers cast judgement upon their attitudes or actions. There are some messed up people in here for sure, but we're not being told of their issues and of their backgrounds, they are simply allowed to exist. They're likable and condemnable at once. They also earn our empathy, just by being the way they are. The actors all do an excellent job achieving this balancing act. Same credit goes to the writers. I commend the writing because I understood everything the characters were doing and why. It gave each character very simple goals so that we could become so easily wrapped up in their lives. The way the characters behave with those goals is where it all becomes interesting. These basic terms allow the substance of the film to unfold without feeling forced. And not substance in the form of a statement or message, but substance that is the richness of the characters' daily lives themselves, the richness found in the often unexplored areas of the world we live in. I wouldn't expect everyone to love the film because we're not conditioned to watch movies like this. Firstly, there's the style, which blurs the line between intentionality and unintentionally. This impression of unintentionally is indeed an intentional choice, but it can be hard to get past that idea. Then there's the lack of cookie-cutting for these characters' lives. They are unexplained for the most part. The film is indifferent to explanations. And finally, there's no clear message or statement.  However, I do think you'll like it. The plot lines, while wayward, are entertaining. The film has an energy that you've likely never seen before and that will likely grip you. It's also funny. And I think people are attracted to realism.  It's rare to see a film so intrigued by its own characters and setting. Seek it out.",
    "rating": "45",
    "date": "August 6, 2015"
  }
,
  {
    "reviewer": "Ryan B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/889395996/",
    "review": "  The \"transgender prostitute comedy shot on an iPhone\" is a revelation. Director Sean Baker keeps the stakes low and succeeds in presenting a dynamic and riotously funny comedy about two women roaming the streets of L.A. just trying to survive. I had low expectations for this film but found myself completely engrossed in both the humanity and tragedy of the story.",
    "rating": "40",
    "date": "August 5, 2015"
  },
  {
    "reviewer": "Sandra F",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/959056155/",
    "review": "  If you are interested in hanging out with sad down and out folks-vomit and urine, well, see Tangerine!",
    "date": "August 2, 2015"
  },
  {
    "reviewer": "Mark H",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/851835142/",
    "review": "  4 out of 5 stars. An indie classic, shot entirely on an iphone 5. That's not just a gimmick though. This is a well written, well shot & entertaining feature film, from a writer/director, Sean Baker, who's won a ton of awards for his indie film work. Shot on the streets of L.A., mostly at Santa Monica & Highland, he shines a light on two subcultures, transvestite prostitutes & Armenians, that are rarely seen in films. The two leads, Kitana Kiki Rodriguez & Mya Taylor, are hilarious as they run through their comic/tragic lives. Gritty without being gross, the film doesn't hold back from showing the dark side of their world with drugs, hustling & police. The music is excellent too, with sharp editing to keep it all moving. Funny with heart, this is a film well worth seeking out, with a unique take on a lifestyle many would find abhorrent. Original, fast and impressive, Sean Baker is a confident filmmaker to watch.",
    "rating": "40",
    "date": "August 1, 2015"
  },
  {
    "reviewer": "Kat I",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/907040148/",
    "review": "  Phenomenal. A unique and refreshing look at life and love in the world of two \"besties\" in the trans sex trade world. Full of surprises and intimate glimpses into friendship, love, and, yeah, some other elements of humanity.",
    "rating": "45",
    "date": "July 29, 2015"
  },
  {
    "reviewer": "Frank C",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/849479011/",
    "review": "  And...knocking \"Mad Max: Fury Road\" out of my Number One spot is \"Tangerine.\" I doubt that I'll see anything funnier this year. It's so beautifully shot and edited that it's hard to believe it was shot on an iPhone. I haven't seen dialogue and actors so perfectly matched since \"Female Trouble.\" Do not miss it.",
    "rating": "45",
    "date": "July 28, 2015"
  },
  {
    "reviewer": "Dean Backus",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/901284656/",
    "review": "  Like a rougher-edged Almovodar comedy (or a \"Crash\" that acknowledges LGBT people), this shot-on-a-shoestring indie has brash attitude and big laughs to spare, but also moments of exquisite tenderness, mostly courtesy of the fierce and formidable Mya Taylor, who completely owns every scene she's in (especially an almost unbearably poignant musical number). Don't miss it.",
    "rating": "40",
    "date": "July 28, 2015"
  },
  {
    "reviewer": "kerried",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/901091031/",
    "review": "  Stong 5 stars for brilliantly conceived story telling, directing, acting, and writing. Film is both comedic and poignant, and interestingly shot on Apple 5S with post production addition of orange tint, hence the name. Impressive film.",
    "rating": "50",
    "date": "July 28, 2015"
  },
  {
    "reviewer": "Susan O",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/907060789/",
    "review": "  Went to see this on the basis of the Rotten Tomato reviews. While the fact that it was shot on an iPhone is impressive, the movie itself is not. I didn't find it funny, I could barely understand much of the dialogue, and the subject matter was depressing. I think the actors were fine - but the script was non-existent.",
    "rating": "15",
    "date": "July 27, 2015"
  },
  {
    "reviewer": "Andres V",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/792120379/",
    "review": "  Incre�ble pel�cula que narra una historia de amor en el mundo de las mujeres transexuales de Los Angeles. Filmada con un iPhone 5, su director, Sean Baker, demuestra que con buenas ideas y grandiosos actores naturales, como Kiki y Mya se pueden hacer grandes cosas que en verdad reflejan nuestra humanidad.",
    "rating": "45",
    "date": "July 27, 2015"
  },
  {
    "reviewer": "kristoecheese",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/971006734/",
    "review": "  Is it just me, or did that white dude in the motel have an abnormally sized cock? Just sayin",
    "rating": "25",
    "date": "July 26, 2015"
  },
  {
    "reviewer": "Dennis H",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/920150915/",
    "review": "  Gritty cinematography follows the unpleasant quest of a bunch of very sad, unpleasant losers. Why waste your time? Zero stars (if I could).",
    "rating": "10",
    "date": "July 25, 2015"
  },
  {
    "reviewer": "Dave P",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/906336683/",
    "review": "  Just when you think you're about to watch anoher poorly executed straight to video gay cinema cliche grabs you by the cojones and drags you down Santa Monica Blvd with rat-a-tat-tat humor and a wildly unconventional yet campily conventional take on the woman scorned. An important and hilarious work of art.",
    "rating": "45",
    "date": "July 22, 2015"
  },
  {
    "reviewer": "Michael L",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/912733204/",
    "review": "  TANGERINE is one terrifically modern, gritty film. The first indie in a while that truly engaged me and made me feel the excitement of the street. Director Sean Baker perfectly captures the real LA in less than 90 minutes. And it's all in service to one terrifically wacky, funny, old fashioned, but profoundly current story. Kudos all around!",
    "rating": "40",
    "date": "July 22, 2015"
  },
  {
    "reviewer": "Juan V",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/959843392/",
    "review": "  Una pel�cula filmada solamente con tres iPhone 5s es la mejor comedia de este a�o y una belleza visualmente. Convierte lo grotesco y lo burdo en el para�so. Una historia sumamente conmovedora de amistad entre dos servidoras transexuales que recorren \"humanamente\" LA en un viaje lleno de estilo, acci�n, de fuerza emocional... Todos los personajes son entra�ables. Mi segunda pel�cula favorita de este a�o.",
    "rating": "45",
    "date": "July 20, 2015"
  },
  {
    "reviewer": "Judi L",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/917703176/",
    "review": "  Sex workers...they're just like us. Jealous, vain, sensitive, mixed up. Acting superb, great look but I dunno...just wasn't all that.",
    "rating": "30",
    "date": "July 18, 2015"
  },
  {
    "reviewer": "Anthony B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/909527703/",
    "review": "  If you?ve ever fantasized about shooting a full-length movie with your iPhone, you should check out ?Tangerine.? Director/editor/co-cinematographer/co-writer Sean Baker?s movie about transsexual working girls on the deserted sidewalks of Hollywood was considered good enough to be featured at Sundance. It?s Christmas eve at Donut Time, but for Sindee (Kitana Kiki Rodriguez) and her friend Alexandra (Myra Taylor), it?s just another night, until Alex lets slip that her pimp boyfriend cheated on her while she was briefly behind bars. But not just with anyone: with a white female sex worker. Furious to find this woman, she goes on a rampage, taking us on a tour of her marginalized world. Meanwhile we follow an Armenian cab driver as he juggles to keep his sordid secrets from his old-country family. His worst nightmare is realized in a hilarious denouement at Donut Time.",
    "rating": "30",
    "date": "July 18, 2015"
  },
  {
    "reviewer": "Craig Dylan W",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/905405838/",
    "review": "  With more realism in every second of this film than you can find in any documentary film, this way this film was made will be copied for years to come. Adult topics well written, well directed, well shot and well performed. Do yourself a favor and catch this film if you can. CDW",
    "rating": "40",
    "date": "July 18, 2015"
  },
  {
    "reviewer": "Neville K",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/783840949/",
    "review": "  It isn't for everyone but to those who are looking for something more raw and daring than this weekend (e.g., not MINIONS), check out TANGERINE. It's a beautiful (and at times, hilarious) look at the L.A. streets rarely captured on screen.",
    "rating": "40",
    "date": "July 10, 2015"
  }
,
  {
    "reviewer": "Helen T",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/970710636/",
    "review": "  This movie is the biggest pile of garbage I have seen in all my years. Bad acting, disjointed editing, incomplete storyline. I went to a free viewing and I still feel cheated.",
    "rating": "05",
    "date": "July 1, 2015"
  },
  {
    "reviewer": "Josh F",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/785431303/",
    "review": "  A fucking 47 out of 5 stars. Zero failures in 88 minutes.",
    "rating": "50",
    "date": "January 28, 2015"
  },
  {
    "reviewer": "Mauricio M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/843513217/",
    "review": "  @TangerineFilm se ha popularizado como uno de los primeros filmes en ser rodado en su totalidad a trav�s de tres I-Phones 5S. Aunque el trabajo de gui�n y edici�n del �ltimo filme de @SeanSBaker, merecen detallados an�lisis y reconocimientos, hablar� un poco sobre c�mo esta pel�cula puede lograr llegar a un p�blico independiente mas amplio, sin importar su marcado contenido LGBTI. Tangerine es una postal nocturna de Los Angeles en la v�spera de Nochebuena, cuando un par de prostitutas transg�nero recorren las calles hollywoodenses buscando apaciguar un rumor que se est� esparciendo r�pidamente y sin fundamentos por el sector. Con una electrizante banda sonora, cinematograf�a kitsch y unos humor�sticos di�logos que hacen uso de la jerga callejera de las trabajadoras sexuales del tinseltown estadounidense, la pel�cula se constituye en una propuesta \"nunca-antes-vista\" como se promociona a trav�s de su material publicitario. Baker logra con este filme, adentrar al espectador en la subcultura Trans de L.A, la discriminaci�n y la violencia que encaran en el d�a a d�a y en especial, como pueden los valores familiares y de amistad, subsistir en dicho contexto. Har� parte de del @Indiebo2015 (Secci�n Avant+Garde) y no puedo esperar a volverla a ver en pantalla grande.",
    "rating": "50",
    "date": "June 29, 2015"
  },
  {
    "reviewer": "Kelvin W",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/796833663/",
    "review": "  Hyperkinetic, experimental, and ultimately human, Tangerine takes the dirty and the beautiful and blends it into a colorful ride along the streets of L.A. The energy never stops, and all of the action is captured by an iPhone. No, seriously. It really reminds me to upgrade my S3.",
    "rating": "40",
    "date": "June 11, 2015"
  },
  {
    "reviewer": "Denny I",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/905494800/",
    "review": "  I haven't such powerful anti war movies for a while. War is ugly or that could be why there is no background music or beautiful heroines. Heard similar stories from russian co-workers. Now realizing how war affects people and their lives. Is it worth it? This movie is clearly telling lack of education is the main reason for war and other silly hostilities we harbour amongst ourselves. Don't allow anyone to separate and exploit us in the name of religion, nationality, caste, creed, sex and so on...Don't miss it if like to be educated..",
    "rating": "50",
    "date": "February 11, 2015"
  }
,]