[

  {
    "reviewer": "Alec B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/790680964/",
    "review": "  Some of it's plot is half baked, there are some really weak performances, but the utterly shocking and wonderfully gory finale makes the whole movie worth a viewing.",
    "rating": "30",
    "date": "December 19, 2015"
  },
  {
    "reviewer": "Francisco G.",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/913676958/",
    "review": "  Despite the old school feel and some great special effects towards the end, We Are Still Here is very amateurish and unpolished on plenty of occasions. Save from Barbara Crampton, the rest of the cast is just plain bad and hilariously so when they should be creepy. Plus, the movies just takes too long to get to the point, even more so since this is a very basic and predictable ghost/haunting movie. We've all seen this before, trot along will ya? And that's it. There's nothing amazing or nothing dreadful about it. It just exists and it's a fairly solid watch for horror completionists.",
    "rating": "25",
    "date": "June 12, 2015"
  },
  {
    "reviewer": "Matt H",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/897795408/",
    "review": "  Really surprised by the stellar ratings for this. As horror movies go, it's been done, quite often. Done solidly, but there's nothing new here or anything that stands out. The characters don't register at all, and the movie's horror elements aren't scary. An unmemorable, but not bad movie.",
    "rating": "25",
    "date": "October 15, 2015"
  },
  {
    "reviewer": "Jen H",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/841861035/",
    "review": "  The thing that sticks out is the husband's plastic acting which completed snaffled the final scene, as well as much of the film.It's a compact, solid film that is mostly well done and has some great jumpscares and an absorbing storyline. With all that being said, it still puzzles me, as I kept on thinking about \"potential\", this movie is largely underdeveloped, with the parts for a good movie, but not quite there.I feel with a bigger budget, I feel he can make something really great--he has a good eye and compelling style.",
    "rating": "30",
    "date": "January 2, 2016"
  },
  {
    "reviewer": "Keith B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/849036878/",
    "review": "  Felt like a 70's B movie which in time could grow a cult following, but on its own...eh..nothing new here.",
    "rating": "35",
    "date": "January 23, 2016"
  },
  {
    "reviewer": "Jak H",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/972953852/",
    "review": "  Surprised that this film has such a high rating. Old reused horror antics that have worked much better in other films. The suspense was (to put if lightly) lacking and the story just felt boring with no depth (not entirely neccesary for a good horror flick, but alas this is not a good one) and had no real entertainment value. There was some decent gore but it just felt like a failed attempt to combine creepy ghost aspects with classic slasher themes. Though some parts are done well they are too few with a lot of unmemorable bulk. Definately not one I would recommend...",
    "rating": "10",
    "date": "January 17, 2016"
  },
  {
    "reviewer": "Jeffrey D",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/877524831/",
    "review": "  It was pretty darn creepy.",
    "rating": "30",
    "date": "January 15, 2016"
  },
  {
    "reviewer": "Doyle A.",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/973023286/",
    "review": "  Despite some serious issues of continuity and fighting an overabundance (and overcrowding) of writerly ideas, 'We Are Still Here' creates a singular tone and landscape that bests any horror movie I've seen in 2015. Oddly, it benefits from unpolished acting, but/and this one had me squirming from top to bottom. A must-see for any fan of the genre.",
    "rating": "35",
    "date": "January 11, 2016"
  },
  {
    "reviewer": "Brett H",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/794472835/",
    "review": "  An awesome throwback to the old-school, slow-burn horror films of the past, We Are Still Here is unsettling, at times very violent, and has a handful of decent scares that actually work! The film is very low-budget, and therefore uses less-than stellar actors, but their campy performances add to the experience; though Lisa Marie is truly awful and her line delivery made me cringe. The plot follows grieving parents who recently lost their son in a car accident and move to a secluded home in a small town to start over, though the house and town hold a sinister secret that goes bump in the night. The atmosphere of this film is what works best with some very good uses of apparitions in the background and as said before, the violence is startling and a lot bloodier than I had anticipated with a full-on, bloodbath in the climax. There are many different ways to interpret the events and the back-story of the house and ghosts seems to have a couple key elements missing, but for a first-time director, it's a solid debut that doesn't spoon-feed all of the details. It also features a fitting pre-titlecard sequence that put a smile on my face, but blink and you'll miss it!",
    "rating": "30",
    "date": "January 11, 2016"
  },
  {
    "reviewer": "Tyler E",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/906038555/",
    "review": "  An old school approach to the genre, this low budget yarn ends up too campy to take seriously and not campy enough to laugh at. [C]",
    "rating": "25",
    "date": "July 16, 2015"
  },
  {
    "reviewer": "Peter M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/805921927/",
    "review": "  Tried to watch it last night, very poorly made. The camera moves up and down when following a character, sometimes it stops halfway into a doorway to keep the doorframe in the picture. I coudnt watch any further",
    "rating": "05",
    "date": "January 3, 2016"
  },
  {
    "reviewer": "Raphael G",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/905452675/",
    "review": "  This is awful. Bad acting, bad story, bad dialogues, just bloody awful.",
    "rating": "05",
    "date": "October 14, 2015"
  },
  {
    "reviewer": "Jake",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/901212658/",
    "review": "  A well acted horror film that starts off slow and atmospheric while the two leads deal with the untimely death of their son while moving into a new house that unknown to them has a dark and mysterious past. Might sound cliche but it really works within the 1979 setting, how well it looks and how well it is shot. Now the final act may be a bit jarring for some people but I thought the whole film was building up to a horrific act and when the past instances of the house are revealed that is wholly justified. Big surprise and I hope to see more from Ted Geoghegan.",
    "rating": "45",
    "date": "December 30, 2015"
  },
  {
    "reviewer": "Jeremy M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/972785180/",
    "review": "  I'm frankly sick of atrociously bad horror movies like this being churned out these days. The maddening thing about this one is the inexplicably high rating RT has given this sub-amateur and badly acted waste of my time - a rating that genuinely got me eager to watch as this once great genre has so few even above average films these days. Please get some better critics or I may have to turn to (god help me) the Imdb rating system. ouch.",
    "rating": "15",
    "date": "December 28, 2015"
  },
  {
    "reviewer": "Elliott C",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/972780644/",
    "review": "  Awful acting mixed with a terrible story that is given no explanation until the end credits sequence, bar the occasional monologue of expositional dialogue that felt incredibly forced, resulted in one of the most frustrating watches in a long time. The poor directing, exemplified by camera shots that take you out of the moment by following random actions rather than what matters on screen or focusing on characters to create tension, was the biggest criminal here though. I truly believe the only people who like this film will be those who think that boring and pointless camera shots of a house or car that last an inexplicably long amount of time is equivalent to art.",
    "rating": "05",
    "date": "December 27, 2015"
  },
  {
    "reviewer": "Dafna F",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/799975881/",
    "review": "  Smart? Devilishly clever? Every single move in this film was predictable.At some point, they just showed views of New England for no reason. There was a waterfall too. The only good thing about this movie is the poster.",
    "rating": "05",
    "date": "December 27, 2015"
  },
  {
    "reviewer": "Bryan B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/898278610/",
    "review": "  Absolutely Riveting!!!",
    "rating": "50",
    "date": "December 22, 2015"
  },
  {
    "reviewer": "Alec B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/790680964/",
    "review": "  Some of it's plot is half baked, there are some really weak performances, but the utterly shocking and wonderfully gory finale makes the whole movie worth a viewing.",
    "rating": "30",
    "date": "December 19, 2015"
  },
  {
    "reviewer": "Dave Oh",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/959173737/",
    "review": "  The critics might be jumping the gun on their ratings for this one. Its a solid lower budget movie, with some eerie moments and a bit of mystery. Does it feel new and fresh though? Not at all. It feels like more horror movies do....as in, I've seen this before. It rounds out nicely in the end, but I've seen it before...",
    "rating": "30",
    "date": "December 9, 2015"
  },
  {
    "reviewer": "Anthony L",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/837971859/",
    "review": "  After their teenage son is killed in a car crash, Paul (Andrew Sensenig) and Anne (Barbara Crampton) move to the quiet New York countryside to try to start a new life for themselves. But the grieving couple unknowingly becomes the prey of a family of vengeful spirits that reside in their new home, and before long they discover that the seemingly peaceful town they've moved into is hiding a terrifyingly dark secret. Now they must find a way to overcome their sorrow and fight back against both the living and dead as the malicious ghosts threaten to pull their souls - and the soul of their lost son - into hell with them. [IMDb]\"Fuck\". That was the word I muttered to myself when this movie concluded tonight. I'll tell you about my first experience trying to watch We Are Still Here and why it had taken me so long to finally get around to finishing it. When this first came out on Blu-Ray, I downloaded it and had a movie marathon of recently released horror titles. It spanned for about 6 and a half hours. From the course of 10 PM on a Friday to almost 5 AM on a Saturday morning. By the time, 4 AM rolled around, it was time to watch We Are Still Here. I was so burnt out and exhausted that I passed out almost immediately after the opening title popped up.Skip ahead to last week, I was scrolling through Amazon for Blu-Ray flicks to purchase when out of the blue, I saw that We Are Still Here dropped in price from $24.99 to $9.99. Judging from how bad I wanted to watch this and also, seeing that the score on the Tomatometer was 95% from when I last checked, I bought it. Watched it tonight with 3/5 of my housemates and the only real words I could muster afterwards were \"Fuck.\" This movie knocked my sock off. My housemates and I have not moved from where we were sitting and it ended nearly an hour and a half ago. It's safe to say that We Are Still Here.Anyways, moving on from my terrible attempt at humor, I am infatuated with 70's and 80's horror films. They're the shit. Hence why I am such a sucker for newer horror movies that are throwbacks to the classic (e.g The House Of The Devil, The Final Girls, The Innkeepers, It Follows, Berberian Sound Studio, etc). We Are Still Here is now in that list because they nailed the 70's/80's horror atmosphere perfectly. The cold surroundings give off a really isolated and eerie feeling on the viewer but its the house that takes the cake. The house is an old beast and it's truly unsettling, even if nothing is happening. All of the acting was really solid, esp. that by Barbara Crampton, who disappointed me in You're Next. Also, damn. She looks really good for her age. Another thing I admired about this film is the amateur-ish cinematography and the way Ted Geogehan handled the film. His direction was a highlight of the film, as well as the writing.Another thing I really liked was how there was always a tense anticipation in every scene and sometimes, the viewer got what they hoped for and sometimes, not. One can definitely feel the film building up to a huge payoff and I can honestly say that the climax in We Are Still Here is one of the greatest horror movie payoff's I've seen in a while. It was really gory like a classic Italian horror film directed by Lucio Fulci, where the blood and guts was pumped out like a great Italian pizza: to perfection. The burning specters who haunted the house were really cool in how they were conceptualized and the ending was rather fitting. I am content with this film and the last half is pure gold. It totally made We Are Still Here leagues above any other horror movie this year. We Are Still Here is my favorite horror film of 2015, so far. Krampus has a fighting chance but it's gonna be hard to beat, that's for sure. Highly recommended.P.S. S/O to my boy Larry Fessenden. You're always a standout. Thank you.",
    "rating": "45",
    "date": "November 30, 2015"
  }
,
  {
    "reviewer": "Jen H",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/841861035/",
    "review": "  The thing that sticks out is the husband's plastic acting which completed snaffled the final scene, as well as much of the film.It's a compact, solid film that is mostly well done and has some great jumpscares and an absorbing storyline. With all that being said, it still puzzles me, as I kept on thinking about \"potential\", this movie is largely underdeveloped, with the parts for a good movie, but not quite there.I feel with a bigger budget, I feel he can make something really great--he has a good eye and compelling style.",
    "rating": "30",
    "date": "January 2, 2016"
  },
  {
    "reviewer": "Brett B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/841042781/",
    "review": "  One of the great pleasures of watching a lot of horror movies is when you go into one knowing virtually nothing about it and then being legitimately taken aback, surprised, and entertained by what you've found. WE ARE STILL HERE is just such a film, a haunted house story with a few extra quirks and wrinkles that succeeds in doing what few movies do: it made me genuinely uneasy. The film seeks to truly frighten the audience, not merely jolt or surprise them with jump scares (although there certainly are a few of those). It's a classic sort of setup - a couple grieving the death of their son moves into an old house with a dark history; it's no spoiler to say that ghosts are involved, but they aren't only a piece of the puzzle, nor are they the only source of danger for the characters. The relationship between the leads feels realistic and emotionally honest, and occasionally even brings about some nice moments of humor. As for the ghosts, the movie contains some of the creepiest representations of them that I've seen in a long time, as they often exist as dark figures at the edges of the frame or scuttling through the background. The movie is not without its fair share of gore (some of it borderline over-the-top... but in a kind of fun way), but overall it feels much more like the classier haunted tales of old than it does some gruesome, exploitation sleazefest. It is also a movie soaked in atmosphere, something that is ramped up by its chilly, wintry setting and very fine cinematography. It's easy to shock an audience, but it's harder to unnerve them, but this film more than met that test for me. I don't want to oversell it, but WE ARE STILL HERE is a fantastic little horror movie.",
    "rating": "40",
    "date": "January 26, 2016"
  },
  {
    "reviewer": "Joshua L",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/797084410/",
    "review": "  Its A slow start full of characters you don't give a shit about but what keeps yous watching is the mystery of the story thats slowly getting pieced together and unraveling until the wickedly entertaining last act of the film. Very interesting film.",
    "rating": "30",
    "date": "January 24, 2016"
  },
  {
    "reviewer": "Keith B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/849036878/",
    "review": "  Felt like a 70's B movie which in time could grow a cult following, but on its own...eh..nothing new here.",
    "rating": "35",
    "date": "January 23, 2016"
  },
  {
    "reviewer": "Jak H",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/972953852/",
    "review": "  Surprised that this film has such a high rating. Old reused horror antics that have worked much better in other films. The suspense was (to put if lightly) lacking and the story just felt boring with no depth (not entirely neccesary for a good horror flick, but alas this is not a good one) and had no real entertainment value. There was some decent gore but it just felt like a failed attempt to combine creepy ghost aspects with classic slasher themes. Though some parts are done well they are too few with a lot of unmemorable bulk. Definately not one I would recommend...",
    "rating": "10",
    "date": "January 17, 2016"
  },
  {
    "reviewer": "Jeffrey D",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/877524831/",
    "review": "  It was pretty darn creepy.",
    "rating": "30",
    "date": "January 15, 2016"
  },
  {
    "reviewer": "Doyle A.",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/973023286/",
    "review": "  Despite some serious issues of continuity and fighting an overabundance (and overcrowding) of writerly ideas, 'We Are Still Here' creates a singular tone and landscape that bests any horror movie I've seen in 2015. Oddly, it benefits from unpolished acting, but/and this one had me squirming from top to bottom. A must-see for any fan of the genre.",
    "rating": "35",
    "date": "January 11, 2016"
  },
  {
    "reviewer": "Brett H",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/794472835/",
    "review": "  An awesome throwback to the old-school, slow-burn horror films of the past, We Are Still Here is unsettling, at times very violent, and has a handful of decent scares that actually work! The film is very low-budget, and therefore uses less-than stellar actors, but their campy performances add to the experience; though Lisa Marie is truly awful and her line delivery made me cringe. The plot follows grieving parents who recently lost their son in a car accident and move to a secluded home in a small town to start over, though the house and town hold a sinister secret that goes bump in the night. The atmosphere of this film is what works best with some very good uses of apparitions in the background and as said before, the violence is startling and a lot bloodier than I had anticipated with a full-on, bloodbath in the climax. There are many different ways to interpret the events and the back-story of the house and ghosts seems to have a couple key elements missing, but for a first-time director, it's a solid debut that doesn't spoon-feed all of the details. It also features a fitting pre-titlecard sequence that put a smile on my face, but blink and you'll miss it!",
    "rating": "30",
    "date": "January 11, 2016"
  },
  {
    "reviewer": "Tyler E",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/906038555/",
    "review": "  An old school approach to the genre, this low budget yarn ends up too campy to take seriously and not campy enough to laugh at. [C]",
    "rating": "25",
    "date": "July 16, 2015"
  },
  {
    "reviewer": "Peter M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/805921927/",
    "review": "  Tried to watch it last night, very poorly made. The camera moves up and down when following a character, sometimes it stops halfway into a doorway to keep the doorframe in the picture. I coudnt watch any further",
    "rating": "05",
    "date": "January 3, 2016"
  },
  {
    "reviewer": "Raphael G",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/905452675/",
    "review": "  This is awful. Bad acting, bad story, bad dialogues, just bloody awful.",
    "rating": "05",
    "date": "October 14, 2015"
  },
  {
    "reviewer": "Jake",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/901212658/",
    "review": "  A well acted horror film that starts off slow and atmospheric while the two leads deal with the untimely death of their son while moving into a new house that unknown to them has a dark and mysterious past. Might sound cliche but it really works within the 1979 setting, how well it looks and how well it is shot. Now the final act may be a bit jarring for some people but I thought the whole film was building up to a horrific act and when the past instances of the house are revealed that is wholly justified. Big surprise and I hope to see more from Ted Geoghegan.",
    "rating": "45",
    "date": "December 30, 2015"
  },
  {
    "reviewer": "Jeremy M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/972785180/",
    "review": "  I'm frankly sick of atrociously bad horror movies like this being churned out these days. The maddening thing about this one is the inexplicably high rating RT has given this sub-amateur and badly acted waste of my time - a rating that genuinely got me eager to watch as this once great genre has so few even above average films these days. Please get some better critics or I may have to turn to (god help me) the Imdb rating system. ouch.",
    "rating": "15",
    "date": "December 28, 2015"
  },
  {
    "reviewer": "Elliott C",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/972780644/",
    "review": "  Awful acting mixed with a terrible story that is given no explanation until the end credits sequence, bar the occasional monologue of expositional dialogue that felt incredibly forced, resulted in one of the most frustrating watches in a long time. The poor directing, exemplified by camera shots that take you out of the moment by following random actions rather than what matters on screen or focusing on characters to create tension, was the biggest criminal here though. I truly believe the only people who like this film will be those who think that boring and pointless camera shots of a house or car that last an inexplicably long amount of time is equivalent to art.",
    "rating": "05",
    "date": "December 27, 2015"
  },
  {
    "reviewer": "Dafna F",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/799975881/",
    "review": "  Smart? Devilishly clever? Every single move in this film was predictable.At some point, they just showed views of New England for no reason. There was a waterfall too. The only good thing about this movie is the poster.",
    "rating": "05",
    "date": "December 27, 2015"
  },
  {
    "reviewer": "Jesse O",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/1202249/",
    "review": "  I've been looking forward to this movie for some time now. It's actually not even that long ago now, I'd say around a month, and I can say that I definitely wasn't disappointed by this movie. As far as haunted house horror movies go, and describing this movie as just a haunted house flick is vastly underselling it, but I think this might be the best I've seen since The Conjuring. Though, honestly, I think The Conjuring does a better job at getting conventional scares out of the concept, whereas this one tries to do something different with it. Visually, the film reminds me very much of The House of the Devil, it almost feels like both films could actually exist in the same universe. Though, to be fair, House of the Devil does, for most of its running length, deal with something that's more 'realistic', per se, than this one, where it's clearly all supernatural. But I thought the movie was really well-paced and it built well. The story, or what's going on in the house, is established fairly quickly and it's just a point of giving you little bits and pieces of information until you get to the last act, where it goes all out. That's not to say that there is a lack of horror until that point, because there isn't. Actually, this might be one of the more balanced horror movies I've seen this year in terms of balancing horror and exposition. It's not a slow-paced movie at all. I wouldn't say it's fast paced either, it's just perfect as far as pacing goes honestly. There's a lot of tension here that keeps building and building up until its insane climax. I know I'm sort of raving about the movie, but it's definitely not without its issues. They never make it exactly clear what's going on here in the house, whether it's the house that demands the sacrifice or it's the Dagmars. And it's not like they were trying to be subtle about it, this was a big reveal at the end of the film, where, the patriarch of the Dagmar family, states that his family wasn't run out of town, but were in fact sacrificed to the house. And that brings up more questions than it does answers. Why does the house require a sacrifice? And how did the house go about sacrificing the families that have the unfortunate 'honor' of living in this house. It sort of makes sense when the Dagmar family does it, within its context of course, but it brings up questions that need explaining when you say that it's just the house that demands it and not the vengeful family. And, another thing, if the Dagmar could just come out and murder people, as they did with Bobby's friend and his girlfriend, then why did they not immediately murder Anne and Paul upon moving into the house? Were they not a 'family'? And there's also the fact that Anne and Paul were allowed to live. Though I can tolerate the latter more, because it opens things up to debate. The other ones bother me because it changes on something the film already stated as fact without giving you so much of an explanation as to why that was. So it's just strange to me that movie so well-crafted, so taut and intelligent could have those types of flaws. The acting is also really quite strong, it helps that they have a really good script to work with, outside of the aforementioned issues. This might not be my favorite horror movie of the year, that honor would go to It Follows, but it's still a really damn good horror film. It's smart and it builds tension really well and the climax is pretty damn crazy. This may have its flaws, but I'd still recommend this wholeheartedly. Horror nerds will love this.",
    "rating": "35",
    "date": "December 23, 2015"
  },
  {
    "reviewer": "Bryan B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/898278610/",
    "review": "  Absolutely Riveting!!!",
    "rating": "50",
    "date": "December 22, 2015"
  },
  {
    "reviewer": "Alec B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/790680964/",
    "review": "  Some of it's plot is half baked, there are some really weak performances, but the utterly shocking and wonderfully gory finale makes the whole movie worth a viewing.",
    "rating": "30",
    "date": "December 19, 2015"
  },
  {
    "reviewer": "heartbeat87",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/911524264/",
    "review": "  Not horrible, but lacks anything to pull you in, including characters to care about. Some, in fact, are just extremely annoying. The plot may have been original but the story felt uneventful and dragged out. On top of that the 'monster' was mediocre, with no buildup and no visual terror.",
    "rating": "20",
    "date": "December 15, 2015"
  },
  {
    "reviewer": "Dave Oh",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/959173737/",
    "review": "  The critics might be jumping the gun on their ratings for this one. Its a solid lower budget movie, with some eerie moments and a bit of mystery. Does it feel new and fresh though? Not at all. It feels like more horror movies do....as in, I've seen this before. It rounds out nicely in the end, but I've seen it before...",
    "rating": "30",
    "date": "December 9, 2015"
  }
,
  {
    "reviewer": "Anthony L",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/837971859/",
    "review": "  After their teenage son is killed in a car crash, Paul (Andrew Sensenig) and Anne (Barbara Crampton) move to the quiet New York countryside to try to start a new life for themselves. But the grieving couple unknowingly becomes the prey of a family of vengeful spirits that reside in their new home, and before long they discover that the seemingly peaceful town they've moved into is hiding a terrifyingly dark secret. Now they must find a way to overcome their sorrow and fight back against both the living and dead as the malicious ghosts threaten to pull their souls - and the soul of their lost son - into hell with them. [IMDb]\"Fuck\". That was the word I muttered to myself when this movie concluded tonight. I'll tell you about my first experience trying to watch We Are Still Here and why it had taken me so long to finally get around to finishing it. When this first came out on Blu-Ray, I downloaded it and had a movie marathon of recently released horror titles. It spanned for about 6 and a half hours. From the course of 10 PM on a Friday to almost 5 AM on a Saturday morning. By the time, 4 AM rolled around, it was time to watch We Are Still Here. I was so burnt out and exhausted that I passed out almost immediately after the opening title popped up.Skip ahead to last week, I was scrolling through Amazon for Blu-Ray flicks to purchase when out of the blue, I saw that We Are Still Here dropped in price from $24.99 to $9.99. Judging from how bad I wanted to watch this and also, seeing that the score on the Tomatometer was 95% from when I last checked, I bought it. Watched it tonight with 3/5 of my housemates and the only real words I could muster afterwards were \"Fuck.\" This movie knocked my sock off. My housemates and I have not moved from where we were sitting and it ended nearly an hour and a half ago. It's safe to say that We Are Still Here.Anyways, moving on from my terrible attempt at humor, I am infatuated with 70's and 80's horror films. They're the shit. Hence why I am such a sucker for newer horror movies that are throwbacks to the classic (e.g The House Of The Devil, The Final Girls, The Innkeepers, It Follows, Berberian Sound Studio, etc). We Are Still Here is now in that list because they nailed the 70's/80's horror atmosphere perfectly. The cold surroundings give off a really isolated and eerie feeling on the viewer but its the house that takes the cake. The house is an old beast and it's truly unsettling, even if nothing is happening. All of the acting was really solid, esp. that by Barbara Crampton, who disappointed me in You're Next. Also, damn. She looks really good for her age. Another thing I admired about this film is the amateur-ish cinematography and the way Ted Geogehan handled the film. His direction was a highlight of the film, as well as the writing.Another thing I really liked was how there was always a tense anticipation in every scene and sometimes, the viewer got what they hoped for and sometimes, not. One can definitely feel the film building up to a huge payoff and I can honestly say that the climax in We Are Still Here is one of the greatest horror movie payoff's I've seen in a while. It was really gory like a classic Italian horror film directed by Lucio Fulci, where the blood and guts was pumped out like a great Italian pizza: to perfection. The burning specters who haunted the house were really cool in how they were conceptualized and the ending was rather fitting. I am content with this film and the last half is pure gold. It totally made We Are Still Here leagues above any other horror movie this year. We Are Still Here is my favorite horror film of 2015, so far. Krampus has a fighting chance but it's gonna be hard to beat, that's for sure. Highly recommended.P.S. S/O to my boy Larry Fessenden. You're always a standout. Thank you.",
    "rating": "45",
    "date": "November 30, 2015"
  },
  {
    "reviewer": "Alan P",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/784745051/",
    "review": "  How on earth did this get such a high score?! It starts good and creepy, but then gets balls out crazy. Don't get me wrong, I enjoyed it for how stupid it was, but I wouldn't expect it to be so highly rated critically. \"Powerfully acted\"??! Really, it was bad soap opera acting with the exception Barbara Crampton who was very real.",
    "rating": "20",
    "date": "November 22, 2015"
  },
  {
    "reviewer": "Ivy M.",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/972267988/",
    "review": "  the plot has several inconsistencies and provides irrelevant characters who are only introduced to die and add screen time. Barbara Crampton only has one emotion of confused sadness throughout the whole thing and characters make really stupid decisions. Halfway through this boring movie all you're waiting for is for the characters to die and this movie does not deliver much great death scenes but hey, at least we get a lot of scenery shots that last for an embarrassingly long time.",
    "rating": "05",
    "date": "November 17, 2015"
  },
  {
    "reviewer": "Ieva S",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/972256526/",
    "review": "  Surprised that rotten tomatoes showed 95%. Gave it a try. It was a really lame didnt feel any connection with caracters.",
    "rating": "05",
    "date": "November 15, 2015"
  },
  {
    "reviewer": "muveeKween",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/904476741/",
    "review": "  Great for a low budget horror film.",
    "rating": "30",
    "date": "November 10, 2015"
  },
  {
    "reviewer": "David K",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/900451477/",
    "review": "  Creepy, clever and sublimely shot and acted. This a�s a throwback to times were horror movies were more than just BOO! scares",
    "rating": "40",
    "date": "October 30, 2015"
  },
  {
    "reviewer": "Lee M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/791471625/",
    "review": "  Geoghegan manages to craft a film that works both as a modern horror film and as a love letter to the kinds of films he grew up with.",
    "rating": "35",
    "date": "August 26, 2015"
  },
  {
    "reviewer": "Randall S",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/952630281/",
    "review": "  In the style of a 80s 90s horror film. Creepy haunted house story with slightly over the top performances. Worth seeing, especially at Halloween.",
    "rating": "30",
    "date": "November 3, 2015"
  },
  {
    "reviewer": "Pablo G",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/962828500/",
    "review": "  A very basic, akward, and very poorly thought out joke of a horror film, that decides to be pretty and to grab some fanatics with its abundance of gore, instead of well acted or well explained or well anything whatsoever.",
    "rating": "20",
    "date": "November 3, 2015"
  },
  {
    "reviewer": "Matthew B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/812835171/",
    "review": "  Amazing and spooky and really ramps up at the end.",
    "rating": "40",
    "date": "November 2, 2015"
  },
  {
    "reviewer": "Jussi M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/831833426/",
    "review": "  Hidas ja viipyilev� kuvaustyyli toimii t�ss�. Kiva pieni pelottelupl�j�ys mik� loppua kohti muuttuu yll�tt�v�n hurmeiseksi.",
    "rating": "30",
    "date": "October 31, 2015"
  },
  {
    "reviewer": "Drago? C",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/832651162/",
    "review": "  One of the weirdest horror movies that I've seen in a while We Are still here starts very, very slow, with melodramatic establishing shots and soap-opera esque soft lit close-up shot-reverse setups. it builds shlock stock characters out of memorably engaged and talented actors and turns into a strange haunted house horror a la 70s. Then the gore starts and the movie goes full off the rails splatterhouse mindfuck, building a hilariously, explosively schlocky finale that seems right out of one of Lucio Fulci's wetdreams. Highly recommended.",
    "rating": "45",
    "date": "October 30, 2015"
  },
  {
    "reviewer": "Ian B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/781960658/",
    "review": "  We Are Still Here is another in the new wave of horror films heavily influenced by those of the 70's and 80's. Everything from the pace, the camera framing, the music...just has that old school vibe. First time director Ted Geoghegan is clearly a fan of some of the genre's finest like Lucio Fulci and John Carpenter. Their influence on the movie is easy to see, but Geoghegan brings and fresh and fun approach to the familiar subject matter. This is also another great example of the 'slow burn' horror flick, wisely choosing to set up the mood and mythology before the sh*t hits the fan in a gore-filled third act. Casual viewers might be confused by the films sudden change in tone, but horror fans will be appreciative of the way this flick goes about setting up the payoff. The performances are strong (especially from Barbra Crampton), there's a good mix of humour and horror, and the gore / practical effects work on display here is terrific. Those who grew up with 70's and 80's horror will find a lot to like.",
    "rating": "40",
    "date": "October 28, 2015"
  },
  {
    "reviewer": "Erik H",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/786783439/",
    "review": "  great throwback horror entry. plenty of quirk and grit and violence. i actually really enjoyed the final act, despite some folks complaining that it's just a bloodfest. i like that kind of build, whether it's original/cheap or not. regardless, the ending was a little unsatisfying, and there were some small things that bugged me. great flick otherwise.",
    "rating": "40",
    "date": "October 27, 2015"
  },
  {
    "reviewer": "Chris C",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/782174996/",
    "review": "  Exceptional old-school ghost story with a Lucio Fulci gore bent with horror icons like Larry Fesseden and Barbara Crampton dealing with some seriously angry ghosts. Among the coolest and creepiest of ghost films to come down the pike in some time with a wonderfully nasty and bloodbath of an ending. Highly recommended.",
    "rating": "50",
    "date": "October 26, 2015"
  },
  {
    "reviewer": "Noah D",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/905636309/",
    "review": "  Right next to \"It Follows\", We Are Still Here is one of the best indie horror films of the year and offers some extremely haunting thrills!",
    "rating": "40",
    "date": "October 23, 2015"
  },
  {
    "reviewer": "Craig F",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/907233324/",
    "review": "  Employing genuine scares over cheap jumps, enjoyable camerawork, and an empathetic story, 'We Are Still Here' proves to be a nice surprise for the horror genre. Comparable to 'The Conjuring' in terms of quality, the biggest difference here is the blood, and there's a lot of it. To this films credit the gore never feels excessive or out of place, due to its supporting role in the story.",
    "rating": "40",
    "date": "September 20, 2015"
  },
  {
    "reviewer": "Ezra M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/915287992/",
    "review": "  Con un inicio poco prometedor pero gracias a su correcto desarrollo y su gran guion esta pelicula te atrapa por completo. Su actuaciones sin ser excelentes, son muy correctas. El director sabe que el susto facil ya no sirve y se las ingenia para entregarnos una pelicula de suspenso muy correcta.Al final podemos encontrarnos con peque�os detalles en la historia y cosas que podrian sobrar. En si una gran pelicula de la que no esperabamos nada.",
    "rating": "40",
    "date": "October 21, 2015"
  },
  {
    "reviewer": "Mark H",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/907683059/",
    "review": "  Terrible movie... Insidious was much better... I do not understand how this movie has such a high rating... Terrible and incomplete ending.",
    "rating": "05",
    "date": "October 20, 2015"
  },
  {
    "reviewer": "Kamal L",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/926435927/",
    "review": "  It would appear that were this film released thirty years ago, the reviews would be reversed: audiences in favor and critics against. Recycling tried-an-true (dare I say classic) themes and techniques of the horror genre, We Are Still Here at first blush appears clumsy and derivative. However, a more critical eye sees that the camp is intentional, and intentionally infuriating, all the while playing masterfully on our modern, urban sensibilities around small-town intolerance and lynch-mob morality. A critic might read this film as a high-brow allegory about the soul of New England and its fearful history, as an indictment of bigotry and provincialism, as well as a valuable contribution to the discourse around diversity in America. Tempting as it is, I wouldn't go so far as to say that the demons in the basement represent black folk and the grieving couple are Jews, but I would submit that the townsfolk are a clear representation of the trembling soul of this country's Anglo-Saxon settlers.",
    "rating": "50",
    "date": "October 19, 2015"
  }
,
  {
    "reviewer": "caravellos",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/661697966/",
    "review": "  BEWARE: The acting in this film. Interesting directing style, and the story ideas merit some credit, but terrible execution. Left me shaking my head as to how this has such high ratings.",
    "rating": "20",
    "date": "October 17, 2015"
  },
  {
    "reviewer": "John K",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/905617862/",
    "review": "  This film follows every possible trope and cliche of your typical ghost story. I've never been a huge fan of ghost stories, but the ones that work need to follow a certain logic and stick to the rules they've created. This film fails woefully in that endeavor, instead creating a plot and background that is riddled with plot holes. Moreover, the characters are stereotypes and the dialogue is consistently expository, as much of the film is simply characters sharing their feelings. The actors try to do the best with what they've been given, but only Larry Fessenden escapes without looking completely awful by playing to the ridiculousness.",
    "rating": "15",
    "date": "October 17, 2015"
  },
  {
    "reviewer": "Adrian S",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/792478225/",
    "review": "  A spooky and atmospheric throwback to the old B-grade haunted house flicks. Although the story has been done till death (pun intended), it's the nostalgic horror tropes and sometimes hammy dialogue that provide an entertaining diversion from the somewhat mild suspense and glacial pace.",
    "rating": "35",
    "date": "October 12, 2015"
  },
  {
    "reviewer": "Matt H",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/897795408/",
    "review": "  Really surprised by the stellar ratings for this. As horror movies go, it's been done, quite often. Done solidly, but there's nothing new here or anything that stands out. The characters don't register at all, and the movie's horror elements aren't scary. An unmemorable, but not bad movie.",
    "rating": "25",
    "date": "October 15, 2015"
  },
  {
    "reviewer": "Marty E",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/842411646/",
    "review": "  better than most horror stories",
    "rating": "40",
    "date": "October 14, 2015"
  },
  {
    "reviewer": "Mique W",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/910187806/",
    "review": "  This indie chiller boasts fine performances across the board,=, and delivers some cleverly-written scared while taking its time to build some palpable menace, but it's slightly dragged down by amateurish CGI and a truncated runing time.",
    "rating": "35",
    "date": "October 12, 2015"
  },
  {
    "reviewer": "Olivier B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/906837687/",
    "review": "  Buckle your seatbelt, prepare your popcorn for this relentless, non-stop, terryfing movie. With its short 84 minutes running time, the movie doesn't leave the table to breath, and the jump scares are outstanding!",
    "rating": "45",
    "date": "October 12, 2015"
  },
  {
    "reviewer": "Elliott C",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/909543677/",
    "review": "  Ghost story done totally right. These specters will mess you up, unlike most ghosts who just kind of stare at you menacingly. This makes them exponentially more terrifying. Four burn victims out of five.",
    "rating": "40",
    "date": "October 10, 2015"
  },
  {
    "reviewer": "Ron T B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/884346274/",
    "review": "  4.25 stars. I really enjoyed this movie. I usually don't care much for supernatural/haunted stories, but I went into this one with an open mind. Barbara Crampton did a superb job in the lead role. The cinematography was great. Really good use of practical makeup effects. I highly recommend this one.",
    "rating": "40",
    "date": "September 24, 2015"
  },
  {
    "reviewer": "Marco D.",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/971731936/",
    "review": "  'We Are Still Here' is a classic horror movie with all the ingredients needed for the sub-genre haunted house. Despite a slow first part the movie grows in suspense and gives an unexpected 'gorish' ending. The story is not always very clear but with a little bit of attention and imagination it is possible to catch it. Not too bad for a sub-genre already exhausted.",
    "rating": "30",
    "date": "October 6, 2015"
  },
  {
    "reviewer": "Simon C",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/802388020/",
    "review": "  At last! Not found footage, a spooky, poo-your-pants* horror treat.* Spontaneous bowel movements not guaranteed. If you still experience difficulty, consult your physician for appropriate interventions.",
    "rating": "30",
    "date": "October 3, 2015"
  },
  {
    "reviewer": "John T",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/824606125/",
    "review": "  The second installment in our Halloween scary-a-thon was betetr than the first. Yes, this move was made for about $7. Still very good and creepy in parts, with some non-standard twists.",
    "rating": "30",
    "date": "October 2, 2015"
  },
  {
    "reviewer": "Laurent B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/932945945/",
    "review": "  Could be a Ti West movie, cinematography is so good. Nice horrific atmosphere. A very good horror flick.",
    "rating": "40",
    "date": "September 30, 2015"
  },
  {
    "reviewer": "John C",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/905394603/",
    "review": "  A riot of paranormal splatterpunk storytelling that spits in the face of the traditional ghost story, \"We Are Still Here\" is dark, fast, eerie and leaves a lingering thought long after the credits roll. (similar to \"The Loved Ones\").",
    "rating": "35",
    "date": "September 28, 2015"
  },
  {
    "reviewer": "Felix N",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/842903977/",
    "review": "  It is barely \"ok\". Classic problem: ghost too powerful, people too dumb. too little explanation.",
    "rating": "25",
    "date": "September 27, 2015"
  },
  {
    "reviewer": "Gael B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/971682614/",
    "review": "  The first fifteen minutes are genuinely scary. The rest of the movie is just gore, ridiculous and unoriginal.",
    "rating": "10",
    "date": "September 23, 2015"
  },
  {
    "reviewer": "Marcos P",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/956199737/",
    "review": "  Buen despliegue visual con la nieve, buenos sustos y entretenida",
    "rating": "wts",
    "date": "September 22, 2015"
  },
  {
    "reviewer": "incz",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/898064669/",
    "review": "  ok.. nothing special",
    "rating": "20",
    "date": "September 21, 2015"
  },
  {
    "reviewer": "Davi M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/785328603/",
    "review": "  If you like blowing peoples heads off with a shotgun. Blood and more blood independent horror.",
    "rating": "20",
    "date": "September 21, 2015"
  },
  {
    "reviewer": "Madmartigan",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/901333002/",
    "review": "  Not bad. Plenty of chilling atmosphere, but a bit light on scares. Interesting characters; it has an 80s feel. Pretty forgettable.",
    "rating": "25",
    "date": "September 12, 2015"
  }
,
  {
    "reviewer": "Stephen D",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/812356858/",
    "review": "  **1/2'We Are Still Here' tries very hard to give a new spin on the tried and true haunted house formula. And while that's always a noble thing, it just makes the fact that it doesn't work all the more disappointing.There's never really a sense of dread and the attempts at creating a creepy atmosphere throughout the slow burn opening aren't that effective.It's only in the crazy final act that 'We Are Still Here' picks a strong identity - but it's such a different animal by then that it's hard to swallow the genre change.If you're looking for goosebumps, you won't find them here. If you're willing to bide your time and wait for the splatter fest, you'll find some solace in the balls-out finale.",
    "rating": "25",
    "date": "September 20, 2015"
  },
  {
    "reviewer": "Jocelyn B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/876269469/",
    "review": "  If you like horror movies, you better see We Are Still Here.",
    "rating": "45",
    "date": "September 20, 2015"
  },
  {
    "reviewer": "Doug R",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/971650296/",
    "review": "  Not sure why the great reviews. The movie was nothing but stolen scenes from other movies. If you've seen a lot of horror movies you will recognize most of them. The end made little sense and the storyline was absurd. Incidentally I'm a big fan of horror movies. this was silly.",
    "rating": "10",
    "date": "September 19, 2015"
  },
  {
    "reviewer": "Wraith Ape",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/971631566/",
    "review": "  Very stylish - packed full of references to 70s and 80s Euro Horror.",
    "rating": "35",
    "date": "September 18, 2015"
  },
  {
    "reviewer": "Laurent P",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/801036205/",
    "review": "  Petite maison hantee facon fin des 70's avec ses bons moments mais sans la maitrise d'un John Carpenter.",
    "rating": "25",
    "date": "September 18, 2015"
  },
  {
    "reviewer": "Jo&#xFFFD;o Miguel R",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/969287392/",
    "review": "  We Are Still Here is a surprise in almost every aspect. The haunted-house-with-a-creepy-past genre is polluted and there are to much movies like this. We all seen one at least. But this one manages to be genuinely terrifying, incredibly gory (yes very gory indeed.. I did not expect that!) and surprisingly with elements of a class-b movie. Nice to see some old school actors here instead of the YA. By the way, the young ones are the least consistent, not a good cast here.The Good: a low budget movie with nice use of the special effects. the familiar closed setting. Nice plot and never predictable... nevertheless.The Bad: the young actors.. especially Lisa Marie.The Ugly: class-b gory!!!!",
    "rating": "35",
    "date": "June 19, 2015"
  },
  {
    "reviewer": "Edward D",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/868802288/",
    "review": "  I'm only writing this review in hopes that no poor soul is ever duped into wasting their precious time with this heap of trash. I'm only to assume the bizarre positive review rating is a result of some critics being paid off. There is no saving grace within this movie. Acting is terrible, plot makes no sense, monster/zombie/demons are cgi crap, the kills aren't even fun.",
    "rating": "05",
    "date": "September 14, 2015"
  },
  {
    "reviewer": "Guilherme N",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/966377052/",
    "review": "  Beautiful movie with very good actors",
    "rating": "20",
    "date": "September 11, 2015"
  },
  {
    "reviewer": "Bill M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/904702059/",
    "review": "  I really enjoyed it. It's a fairly traditional haunted house story with an interesting twist. It has some issues with pacing early on, and the script has some moments of pretty wooden dialog and some questionable plot items. Once it got going, though, I found myself interested the rest of the way through. Barbara Crampton is her usual excellent self, Monte Markham is suitably creepy. The rest of the cast does their best. The locations we striking, and the visual effects were as good as could be expected given the budget.",
    "rating": "45",
    "date": "September 10, 2015"
  },
  {
    "reviewer": "Zeppo1",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/900948227/",
    "review": "  A throwback to the way horror films used to be made. It creates a world where sounds and uneasiness becomes tense suspense. It does fall apart a bit towards the end, but still manages to be better than most horror films out there.",
    "rating": "35",
    "date": "September 2, 2015"
  },
  {
    "reviewer": "Katie B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/892889554/",
    "review": "  The writing and acting felt a bit cheesy, and it's your typical haunted house type stuff. Nothing groundbreaking.",
    "rating": "25",
    "date": "August 4, 2015"
  },
  {
    "reviewer": "Carlos D",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/882724280/",
    "review": "  Too many haunted house clich�s, with too little new or fresh ideas.",
    "rating": "20",
    "date": "March 23, 2015"
  },
  {
    "reviewer": "Charles B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/804405132/",
    "review": "  Poorly paced and scripted, this sophomore effort boasts a few recognizable faces but lacks any real atmosphere or tension. The photography is cramped and banal, the performances seem like third rate impersonations of other, better ones (there's a faux-Nicholson and a Burstyn knock-off,) and the ghosts are dull, scorched, black-eyed zombie specters that jump out in the first ten minutes and then never stop leaping out to grab people's faces with their smoking fingers. The location is a dull one and the house has no particular geography or presence. Haunted houses don't have to be shadowy mansions: think the little suburban dwelling in 'The Grudge'. It's not funny enough to be a camp pastiche and its high rating on RT mystifies me. I can only imagine the reviews were written by the director's friends. A very inauspicious debut. Come back Ty West: all is forgiven.",
    "rating": "10",
    "date": "August 17, 2015"
  },
  {
    "reviewer": "??????? ?",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/911836346/",
    "review": "  This is absolute waste of time. I don't know why eminent critics gave such a high score for this movie. Honestly, I don't know what to say except: Disaster!",
    "date": "August 2, 2015"
  },
  {
    "reviewer": "Jimmi S",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/915527019/",
    "review": "  Interesting and original idea but it seems to be missing something, The film seems like it wants to be The Cojuring meets The Lottery but ends up borrowing a little from the Evil Dead. Somewhat incomplete.",
    "rating": "30",
    "date": "August 2, 2015"
  },
  {
    "reviewer": "Hayden G",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/878116499/",
    "review": "  Enjoyably old-school, it is occasionally able to work past its meager budget's limitations.",
    "rating": "30",
    "date": "July 30, 2015"
  },
  {
    "reviewer": "Billy T",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/969094085/",
    "review": "  How the hell this got 92% is beyond me. There are a couple of good jump scares and thats about as far as the scares go. Bad acting, bad dialogue, lame nonsensical storyline. Laughable.",
    "rating": "10",
    "date": "July 19, 2015"
  },
  {
    "reviewer": "Andrey B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/945282167/",
    "review": "  Well executed ghost story.",
    "rating": "35",
    "date": "July 17, 2015"
  },
  {
    "reviewer": "Devon W",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/782988240/",
    "review": "  One part low-fi indie movie, one part gore-fx masterpiece. It's a story we've seen before, but the campy look makes it feel different.",
    "rating": "35",
    "date": "July 16, 2015"
  }
,
  {
    "reviewer": "Bob R",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/784154919/",
    "review": "  Retro 80's Italian style horror.",
    "rating": "35",
    "date": "July 15, 2015"
  },
  {
    "reviewer": "Matthew S",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/906665945/",
    "review": "  I guess I was expecting a tired story that might be creepy and well made. But Ted Geoghegan's film far exceeds that expectation. There is a very clever twist to the genre --- maybe a haunted house is the least of your fears. Barbara Crampton and Larry Fessenden are particularly effective. Karim Hussain's cinematography is also a major contributor. What really elevates this movie is that it never quite seems to take itself too seriously. There is a certain demented glee when a gore-fest of chaos and mayhem begins. It is graphic, but Geoghegan wisely never pushes it too an extreme and rarely as a form of shock. Expect the unexpected. And an enjoy this creepy little ride!",
    "rating": "40",
    "date": "July 7, 2015"
  },
  {
    "reviewer": "Richard L",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/950284239/",
    "review": "  Not quite the slow burn followed by abject madness of a Ti West horror flick, but close. A couple mourning the recent death of their son move into a new house. The creepy camera angles viewing them around corners doesn't convince them to get back in their car and leave immediately, so of course they stick around for the strange noises, horrible basement, and weird neighbors.The movie benefits from a few unexpected elements, including confusion about the forces at work and a rather quick progression once those forces are unleashed. The final scenes become almost ridiculously gory and the final scene itself is a keeper.The acting is slightly uneven, but Barbara Crampton is great as Anne Satchetti, convinced that the spirit of her dead son has somehow followed them to their new home, despite rapidly accruing evidence otherwise.",
    "rating": "40",
    "date": "July 2, 2015"
  },
  {
    "reviewer": "Mario F",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/966141760/",
    "review": "  the scariest thing about this movie was the husband's gold turtleneck. the rest was some decent technique smothered in same old tricks",
    "rating": "20",
    "date": "June 29, 2015"
  },
  {
    "reviewer": "Greg T",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/970665541/",
    "review": "  A new haunted house film that's worth the watch.",
    "rating": "40",
    "date": "June 27, 2015"
  },
  {
    "reviewer": "Benjamin Tyler B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/933056399/",
    "review": "  Please, do not waste you time with this critical farce. Clearly, there were massive expectations for this low budget indie as an apparent Hollywood PR maestro was making his directorial debut and the cast is very impressive for a low budget feature. Crampton is the darling of the coveted Re-animator. Markham is 79 and does a solid job in a terribly confusing, poorly conceived role. Fessenden is a veteran of these types of movies. Sensenig is working a ton and did very interesting work recently in Upstream Colors. Marie has an interesting face, which many will still remember from Mars Attacks. However, the lies being told by everyone from Roger Ebert on down the line about how amazing this film is begs the question of how far the truth can be stretch when a project that should work doesn't. The script badly needed a rewrite or three. The camera work was shoddy. The supposedly amazing special effects were laughable sprays of fake blood and black charred body suits. The huge massacre at in the third act was comprised of hilariously repetitive blood sprays of several people walking up some stairs. The supposedly amazing possession scene was just stupidly simple, replete with simpleton nonsense like slowly eating part of a sock. And, the plot did not make a lick of sense. Why would a house come back to life every 30 years? Why would the city father almost scare off the people he wanted in the house? Why was the electrician only burnt while everyone else got completely toasted? Why were the Dagmars sometimes invisible and sometimes charred, ashy, murderous zombies? Why did Dave McCabe blow two people away within mili-seconds then hold the shot gun on the Sacchettis and explain the whole plot to them, when he needed them dead? Why on Earth did the charred ember oozing zombies have a change of heart? And where did the Sacchetti's son come from? Why was he in the basement? Why could they only see him at the end but not throughout the movie? Look, this was as poorly written as it gets folks. Don't believe the cover up coming from these critiques on this bomb. Obviously, everyone is scared to be at the brunt of a PR machine. This does not deserve a 92% on Rotten Tomatoes, it deserves a 2%. Just because it would nice to find someone to fill Lucio Fulci's shoes and just because Geoghegan named his villains Dagmar and Dagmar Lassander acted in \"The House by the Cemetery\" does not mean this movie has any semblance in style whatsoever to the ultra cheesy \"The House by the Cemetery\"",
    "rating": "10",
    "date": "June 27, 2015"
  },
  {
    "reviewer": "Troy K",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/898358222/",
    "review": "  Scary and different, but bad acting and a weird ending.",
    "rating": "35",
    "date": "June 27, 2015"
  },
  {
    "reviewer": "Luciano G",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/894774639/",
    "review": "  \"We Are Still Here\" isn't original, but it's effective genre picture..... it has great chilling \"hounted house\" setting, intriguing cinematography, good acting, nice pacing (although movie is kinda short), and some genuinely good scares..... all in all i can recommend to see this horror flick. the ending is a bit off, nevertheless the whole ride is pretty good....",
    "rating": "25",
    "date": "June 21, 2015"
  },
  {
    "reviewer": "Scott J",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/816764622/",
    "review": "  Imagine a dopey hipster trying to make a Lucio Fulci film",
    "rating": "20",
    "date": "June 20, 2015"
  },
  {
    "reviewer": "J T.",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/970535022/",
    "review": "  A good 70's inspired horror flick with the fluff removed that manages to pull off setting itself apart from the crowd. I went in to this one a little annoyed at the obvious nods to horror movies past, but it didnt take long to force me to change my mind. Sets the scene by starting about half an hour to an hour in to the typical 70's era horror film, and quickly sets itself apart wkile maintaining strong homage to some of the greats, even the gore (remniscent of an Argento) was done without making it campy. The story isn't \"Amazing\" but it was well worth my time watching. Acting is great, writing is near flawless and just about every other aspect combined make it an easily recommendation to anyone fond of, but not wanting to re-watch, an old classic.",
    "rating": "45",
    "date": "June 17, 2015"
  },
  {
    "reviewer": "Michael S",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/960867211/",
    "review": "  A top-notch haunted house flick with a killer third act. This is the kind of movie you watch and then actively seek out all your friends and MAKE them watch it with you and wait to see their reactions. Good, gory times.",
    "rating": "35",
    "date": "June 14, 2015"
  },
  {
    "reviewer": "Desmond R",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/885301371/",
    "review": "  this was so FUN and SO scary. I was very VERY pleasantly surprised. The ending sequences are such a treat and a true GIFT to horror fans! THESE filmmakers \"get\" true horror. Thank You!",
    "rating": "50",
    "date": "June 14, 2015"
  },
  {
    "reviewer": "The Film Splice",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/970496104/",
    "review": "  We Are Still Here, directed by Ted Geoghegan (writer of Don't Wake The Dead), is being billed as the first \"truly scary\" movie of 2015, and it easily lives up to that marketing. As Geoghegan's first film as director, We Are Still Here is a dark, heavy, slow-burn of a horror film that has a graphic, brutal crescendo that will leave you speechless.The film follows parents Anne and Paul Sacchetti (Barbara Crampton, Re-Animator, You're Next and Andrew Sensening, I Love You Phillip Morris) who recently lost their son in a car accident. The couple move to a small New England town into a home that was once the local mortuary. Anne immediately senses a presence in the home, and holds onto the hope that it's their son, Bobby. Skeptic Paul is less assured that there is anything amiss in the house.When friends May and Jacob Lewis (Lisa Marie, Sleepy Hollow, Ed Wood and Larry Fessenden, I Sell The Dead, Stakeland) come to stay for the weekend, both also immediately feel something lurking in the house, and warn Anne and Paul that the spirit in the home isn't Bobby, and is much, much more malevolent. After a s�ance brings forward an evil entity, Paul becomes a believer, and a literal hell is brought upon them.The casting in this movie is amazing. Everyone in the film, especially the four main characters, are all extremely talented actors, several of whom are no stranger to the horror genre. Director Geoghegan takes his time developing the story, using the bleak, wintry landscape of his New England setting (actually filmed in New York, so - close enough, anyway) to build a deliberate sense of quiet, calm, and a biting dread. Long establishing shots at desperate angles are used multiple times, and bring a harsh look at the snow-covered fields and trees surrounding the house.The story, which borrows several concepts from the Lucio Fulci film House By The Cemetery, is about a house that 'awakens' to feed on sacrificed souls every 30 years. Despite its roots, We Are Still Here still feels fresh and new. This new film is a welcome addition to the haunted house genre of horror films; the kind of movie that the Insidious: Chapter 3s of the world wish they could be. Featuring a perfect mix of CGI and graphic, gory, practical FX, We Are Still Here is a beautifully shot, brutally violent movie that truly is frightening and definitely unforgettable.",
    "rating": "50",
    "date": "June 14, 2015"
  },
  {
    "reviewer": "?????? ?",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/923134787/",
    "review": "  The Pact + The House of the Devil.",
    "rating": "45",
    "date": "June 14, 2015"
  },
  {
    "reviewer": "Peter C",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/545822697/",
    "review": "  Delicia de filme, horror total 'old school'... uma mistura de \"N�o Adorme�a\" com \"O Homem de palha\"... e ainda homenageia \"O Iluminado\" e a cl�ssica cena da bola caindo da escada de \"O Intermedi�rio do Diabo\"...por�m filmes para poucos...Adorei!",
    "rating": "40",
    "date": "June 12, 2015"
  },
  {
    "reviewer": "Francisco G.",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/913676958/",
    "review": "  Despite the old school feel and some great special effects towards the end, We Are Still Here is very amateurish and unpolished on plenty of occasions. Save from Barbara Crampton, the rest of the cast is just plain bad and hilariously so when they should be creepy. Plus, the movies just takes too long to get to the point, even more so since this is a very basic and predictable ghost/haunting movie. We've all seen this before, trot along will ya? And that's it. There's nothing amazing or nothing dreadful about it. It just exists and it's a fairly solid watch for horror completionists.",
    "rating": "25",
    "date": "June 12, 2015"
  },
  {
    "reviewer": "Ky K.",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/904749596/",
    "review": "  A horror movie that has good atmosphere and plot but poor acting in general.",
    "rating": "25",
    "date": "June 11, 2015"
  },
  {
    "reviewer": "Marco S.",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/970454512/",
    "review": "  Great cinematography. Original concept. Poor acting. Predictable writing.",
    "rating": "30",
    "date": "June 10, 2015"
  },
  {
    "reviewer": "johnnytangster",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/790416373/",
    "review": "  A new horror flick called We Are Still Here is written and directed by a top movie PR man, Ted Geoghegan, who learned his craft the hard way-on the job-and knows where to move a camera. After penning several thrillers in the past, this is his directorial debut. Of course, you can't really make a movie that combines elements of the metaphysical, zombie and haunted-house genres without a few splatter-movie clich�s, but Mr. Geoghegan makes them creepier and more unpredictable than I thought possible. We Are Still Here will make you scream and make you laugh, and possibly leave you speechlessly gesticulating at a charred zombielike ghost in the background. But the peak moments are too few. The lumbering ghouls are a bit too hokey to be taken seriously as objects of terror. But they fit into a general thematic and design scheme that faithfully echoes a seminal era's often garish horror convention. We Are Still Here is more or less a 90-minute tribute to the superior haunted house features that came before. Great poster, though. The haunted house genre has been done to death (pardon the pun) but this one has some genuine chills. The plotting is aggressive. The actors are uniformly believable even in the most incredulous circumstances.VERDICT: \"Rent Worthy\" - [Mixed to Negative Reaction] These films are only worth renting because of certain good things that are worth seeing, but are not worth paying at a theatre or the DVD to see due to bad things that overcome anything good. (Films that are rated 2.5 stars)",
    "rating": "25",
    "date": "June 10, 2015"
  }
,
  {
    "reviewer": "Quincy T",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/883219230/",
    "review": "  Stiff predictable horror antics, but decently creepy practical effect and ironic humor. There's not much variation of gimmicks on We Are Still Here, it focuses on simple haunting with a bit of twist near the end. The narrative plays out slowly and there's barely any thrill aside for a couple of scenes on latter half. Acting and visual are proficient enough, but the film's better aspect is its over the top make-up and effect. In this case the excess of gore does present better and more eerie spectacle than any psychological angle it barely able to capitalize on.A middle age husband and wife move to an isolated house on cold rural landscape. They have just lost their son, so the mourning hasn't passed yet. After a few days they sense something reside on the house, wishful thinking dictate that it's their son trying to comfort them. Unsurprisingly, turns out the house itself prays for victim. The premise is as formulaic as they come, using typical possession or haunting development seen in other horror movies. Cinematography isn't half bad, for first half it creates multiple shots of the house and the natural surroundings. They are showcased with wide points of view which are considerably effective in setting the atmosphere. Acting from the leads are good, although there's a bit of shaky performance by the supporting cast as they tend to be overly dramatic or speaking with drab unemotional lines, which to its defense is partially for irony purpose. The film's strong suit isn't on building mental tension, it's the shock value from the effects.Honestly, from the slow first act it doesn't fascinate much. The usual blare or jump scare aren't potent, they are not even that many of them. A few sequences are laughably comedic, they can only be intentionally and actually nicely done. It does ramp up significantly with tons of bloody scorched practical effect later on. This may not be a refined psychological terror and a clever way to wrap things up, but the overabundance of the gore surprisingly works. It gets the job done in appropriately ugly manner.Since the film isn't that lengthy and the build-up is timid, its only saving grace are the startling dead, which might please some fans but probably not everyone, and timely comedic value of the old genre.",
    "rating": "30",
    "date": "June 8, 2015"
  },
  {
    "reviewer": "Eric H",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/906385384/",
    "review": "  This movie grows on you.. At first I was wondering what the director was doing and really wondered if I was going to be able to sit through it. It seemed like a B movie to me. It still is a B movie, but it's really cool. I am not a B movie fan. I take my movies too seriously. But this one pulled it off and managed to really creep me out. I loved the acting. It's subtle, but intentional. See with movies, if an actor is doing too realistic a job, it's going to seem off. This movie appears like the actors are off, yet I had the distinct feeling it was intentional. The caliber of the actors is too good and you see that in moments.. Not through out the whole film.. It's almost seems as if the kinda dullness of the actors at first is only to add to the crescendo at it's peak. This is a good movie. I want to call it great but I don't want people to get the wrong idea.. I actually loved this movie and have no idea why. It was just really cool man.. Like in a so hip it looks like sh** kinda way. Some people though will not understand this. Also it mixes a ton of genres , I think it's more a slasher flick than anything , although there are paranormal, haunted house and horror aspects to it. I think my only complaint is that this could have been one of the greatest horror movies to date with a bigger budget and work on the script, more character and theme developments , better special effects, possibly different effects - the zombie demon - it could have been a blockbuster if they didn't make it so camp. But it still is a great movie and I love it just the way it is. I will be surprised if it doesn't become a classic.",
    "rating": "40",
    "date": "June 2, 2015"
  },
  {
    "reviewer": "John S",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/912018065/",
    "review": "  We Are Still Here is in many ways a horror fan's dream, and I've been following its high praise for some time. Are the glowing reviews accurate or just hype? Apart from one critique, I'd have to agree that WASH was beautifully filmed, poignantly acted, oddly humorous, and fairly horrific. It struck just the right note, that balance of art house and classic haunted house genre styling. All four leads were pitch perfect, especially Crampton. The cinematography was poetic. The dread palpable. The atmosphere claustrophobic. The tension slow to build until exploding into a frenzy of unthinkable gore. Every piece fit, even the rather beautiful, totally surprising, emotional ending. There is real heart here, and horror.I keep reading the phrase \"Fulci homage\", and I can see that. Personally, I was reminded of Lovecraftian lore...that small town with a big, supernatural secret they will do anything to protect. Rarely is blame placed in Lovecraft's stories, or in WASH. All motivations are understandable, even when their consequences are dire. I truly love this element. But it does connect to my one critique of the film. Though I don't want everything spelled out for me, the film could have used perhaps 10 more minutes to really explore the townsfolk and the unique mythos they've created. Without spoiling anything, two fringe characters are murdered to no real purpose, there is a violent mob whose motivations could have been touched upon better, and all-in-all the side characters could have used a bit more life. Well-acted, yes, but they felt a bit like shells of characters. Not asking for Cthulhu here, but WASH's mythos deserved more screen time.Otherwise, I'd consider this a perfect horror film, and one I look forward to watching again.",
    "rating": "45",
    "date": "June 8, 2015"
  },
  {
    "reviewer": "Alfin N",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/881538577/",
    "review": "  They are still there.",
    "rating": "35",
    "date": "June 8, 2015"
  },
  {
    "reviewer": "Matt L",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/782459588/",
    "review": "  A spooky and bloody throwback to 80's horror films.",
    "rating": "40",
    "date": "June 7, 2015"
  },
  {
    "reviewer": "Ryan J",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/797139540/",
    "review": "  A grieving couple move to a small town in New England, they just lost their son in a car accident, and find their new house has a few heating issues. Anne feels that their son's presence is what is causing these issues as well as the bumps on the night but she is very wrong. The house is full of evil and every 30yrs the towns folk get people to move into the house as a sacrifice to the darkness that abounds. This is a nice indie horror film with a couple of horror mainstays like Barbara Crampton and Larry Fessenden to give it a little more street cred, I highly recommend watching it. There are some nice scares, at only about 80 minutes it does not outstay its welcome, it is paced well, it leads to a rollicking final 20 minutes and the use of limited CGI effects is always good, love the practical effects, some brutal gore. Horror fans should check this out!",
    "rating": "35",
    "date": "June 7, 2015"
  },
  {
    "reviewer": "Chris V",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/790030695/",
    "review": "  The tone is uneven and the intention is unclear, leaving the whole film feeling like a huge missed opportunity for campy, meta Horror gold. The burning question is, is We Are Still Here SUPPOSED to be funny? I wish I could answer it, but based on the dreadful acting and painful-to-listen-to dialogue, I really hope so. Still, despite the thematic murkiness, it does feel like a future cult classic.",
    "rating": "25",
    "date": "June 7, 2015"
  },
  {
    "reviewer": "Cameron L",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/819540133/",
    "review": "  Not unlike The House Of The Devil, it's a hollow celebration of classic horror films from the 70s. The poster is the best thing about it.",
    "rating": "10",
    "date": "April 29, 2015"
  }
,]