[

  {
    "reviewer": "KJ P",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/896976177/",
    "review": "  \"What We Do int he Shadows\" puts a huge spin on it's genre, creating a documentary style film about a fictional world of vampires as they travel the streets at night and sleep in their home together during the day. This plays out almost like a wholly dialogue driven feature, with just one difference, everything. This is a very clever (albeit oversaturated) story that i really enjoyed. About halfway through the film you get the sense that they have nowhere else to go with the story and that definitely shows in it's mere 20-minute running time. Well scripted and plotted out well enough, this film has a little something for everyone to \"sink their teeth into.\" To mockumentary fans, this film could be their dream. To myself, \"What We Do in the Shadows\" works very well at what it sets out to do, but ultimately falls a little flat in some aspects. A very fun and slightly original film that I can recommend watching around Halloween.",
    "rating": "35",
    "date": "August 4, 2015"
  },
  {
    "reviewer": "Kevin M. W",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/787154086/",
    "review": "  Not as good as advertised. Silly and sophomoric, which is too bad.",
    "rating": "25",
    "date": "November 1, 2015"
  },
  {
    "reviewer": "Christian C",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/926317724/",
    "review": "  A supremely funny reawakening of the mockumentary genre -- with teeth. This sanguinary tale is very clever and surprising. Highly recommended.",
    "rating": "50",
    "date": "July 25, 2015"
  },
  {
    "reviewer": "Pierluigi P",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/336592762/",
    "review": "  Ingenious faux documentary that plays with the myths and cliches of the vampire lore with hilarious results.",
    "rating": "40",
    "date": "July 13, 2015"
  },
  {
    "reviewer": "Jens S",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/209816720/",
    "review": "  Hilarious mockumentary about a couple of vampires of all eras living together in modern New Zealand. Full of really funny stabs at the genre conventions of Vampire and found footage films. Thankfully, the humor, much like the characters, has a lot of heart underneath a couple of pretty bloody throat bites. One of the funniest films of recent years.",
    "rating": "40",
    "date": "July 12, 2015"
  },
  {
    "reviewer": "Mark W",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/899273376/",
    "review": "  \"Yeah some of our clothes are from victims. You might bite someone and then, you think, 'Oooh, those are some nice pants'\".Anyone familiar with the little independent Antipodean comedy Eagle vs Shark or the cult TV series Flight of the Conchords will happen to find themselves on comfortable ground with What We Do In the Shadows as the co-creators of these works, Taiki Waititi and Jermaine Clement collaborate again to deliver one the most genuinely funny comedies for some time.There's a big event for the undead in Wellington, New Zealand called 'The Unholy Masquerade' and upon the day, a documentary film crew are allowed access to film a bunch of vampires as they share their experiences and what everyday life is like for these creatures of the night.Fly on the wall mockumentaries is a format that been done many times before. The TV series The Office has had great success in recent times and the likes of Rob Reiner's This is Spinal Tap has made a lasting impression on people since it's release in 1984. However, Waititi and Clement have came up with a new (and strangely obvious) idea on how to gain more mileage from this particular style of filmmaking. Why has no one tapped into the lore and dark myths of vampires and used it for laughs? Granted, some films like Vampire's Kiss in 1989 had an outrageous Nicolas Cage using his couch as a coffin and (famously) eating live cockroaches and Roman Polanski's 1967 The Fearless Vampire Killers had found a cult status but vampire's, probably now more than ever, are in very hot demand what with the Twilight movies and HBO's True Blood. We can't seem to get enough of them but we are still taking them all very seriously. As a result, this film comes at a perfect time.For a project of this nature to work, though, you have to be up on your vampire knowledge and the pop-culture surrounding them. By this, I mean from Bram Stoker to Anne Rice; Blade to The Lost Boys and not forgetting Nosferatu along the way. You also have to open to the ways and needs of a vampire's existence. If you are all of the above, then sit back and allow this film to sink it's teeth in and deliver it hilariously satirical comedy. First and foremost, the characters are brilliantly written and every one of the actors deliver brilliant performances. Each of our vampires have their own style (or lack of, as the case may be); we have the 379 year old Viago (Taika Waititi), the dandy gent of Anne Rice.183 year old Deacon (Jonathan Brugh), the cool rock star type al la The Lost Boys.862 year old Vladislav (Jermaine Clement) who riffs on Bram Stoker's work and 8,000 year old Petyr (Ben Fransham), hiding in his darkened room and resembling the Max Schreck of Nosferatu! As they co-habit and flat share, they argue about domestic duties and who's turn it is to do the dishes. Deacon hasn't done them in five years and anal-retentive Viago would like his flatmates to give some consideration for the decor and furnishings by putting newspapers down before feasting on their victims as the arterial spray can cause quite a mess. They even knit a scarf for their human friend who they all agree not to feed on. It's these exchanges with each other that provide genuine laughs and as they scour the New Zealand night scene for \"food\" they must rely on doormen to invite them into nightclubs as they can't enter on their own accord and have run-in's with the local Werewolves who are so gentlemanly and well mannered that they don't want to be known as Swearwolves.Admittedly, there are periodic lulls but, thankfully, they're brief and when the laughs are delivered they can be genuinely side splitting. I can often be very critical of both horror and comedy as I often find that they either try too hard or simply don't have the material but What We Do In the Shadows really hits the spot with sharp and observant humour, A hugely successful medley of of a filmmaking style and pop-culture sub-genre that is, without a doubt, one of the silliest and funniest films of 2014.Mark Walker",
    "rating": "40",
    "date": "January 26, 2015"
  },
  {
    "reviewer": "Phil H",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/789814099/",
    "review": "  When you think of New Zealand there are certain things that spring to mind, unfortunately most of those things now tend revolve around Hobbits. Despite New Zealand being used as the backdrop for Tolkien's fantasy world its still not really the first place you'd associate with vampires, especially vampires living in the suburbs of Wellington. So it was admittedly kinda surprising to see a vampire movie emerge from the island of Kiwis, but not just a vampire movie...a vampire comedy mockumentary.Put basically this film takes the popular reality TV concept and blends it with the popular slightly romantic vision of vampires (Anne Rice type vampires) whilst also adding other ghouls and mythical creatures in a bare bones hyperbole of blood. A camera crew stays in a decrepit house with four vampires and follows their daily routines trying to exist in the present day. The film crew have been given special permission to film these ancient creatures of the night as they prepare for a special event, a special ball...the crew were also given assurance they wouldn't be eaten.The four vampires are a mixed bunch from the distant pages of time. Viago (379 years old) is the main vampire who talks to us most of the time, he was an 18th century dandy, a wealthy man who is prim proper and pedantic and likes the house clean and tidy (the Lestat de Lioncourt of the bunch). Deacon is the bad boy of the group...or so he likes to think (183 years old). He's the young rebellious rock n roll leather pant wearing vampire who thinks he's hot stuff, the irony being he clearly isn't. 'If you were a Nazi after the war...uh-uh''If you were a vampire'...*shakes head*'If you were a Nazi vampire! no way!! I was outta there!'Vladislav is the second eldest vampire (862 years old) who grew up during the medieval ages and was a tyrant. He's the most dated and out of touch vampire, HE is the sexual deviant of the bunch, the ladies man. His appearance is more in line with the traditional romantic vampiric appearance (the Gary Oldman/Coppola vampire of the bunch). Then lastly there is Petyr who is the eldest vampire at 8000 years of age. This guy is obviously a homage to the Count Orlok character in the F.W. Murnau film 'Nosferatu'. He doesn't say anything but merely nods or hisses and is virtually more animalistic or creature-like than the others.So apart from the usual vampire-esque things you'd expect to see what is different about this movie? Well for one its all filmed with hand held cameras because its a reality show, not exactly a new idea but it makes the whole film look very realistic in terms of a reality show that is. They have clearly gone out and about in Wellington and filmed on the fly with real unknowing people which makes things more intriguing and fun. In fact its hard to tell at times if the people we see are in the movie or simply real folk unaware they are being filmed.Some of the main things that really stand out are the extremely humorous little chats the vamps have with the cam crew (ala Big Brother) as they bicker about each other and whine about life in general. It is absolutely hilarious to watch these guys moan and take the piss out of traditional vampire lore turning it into annoying everyday situations. A really clever aspect is the fact vampires don't cast a reflection...so how do they know what they look like? This is clever simply because you've probably never even thought about that. Vampires tend to look very glamorous in certain movies yet how do they know they look glamorous, they might look like shit. So we are presented with a brilliantly funny sequence where these vamps must draw each other in certain attire and make dummies to put the clothes on, so they have an idea of how they will look when they cruise the town at night.'I think we drink virgin blood because...it sounds cool''I think of it like this...if you're going to eat a sandwich...you would just enjoy it more if you knew no one had fucked it'Then there is the issue of how to kill and drain a victim without making a mess on the carpet and furniture. How do they get all their clothes cleaned, washing up all the blood stained cutlery and dishes, how to find victims/virgins, keeping their vampire skills honed, general entertainment, coping with modern technology, flying through windows, trying to hypnotise victims when they're glued to the TV or a laptop and getting to grips with a new vampire and his human friend. The answer to many of these things being a female human slave who acts like a personal secretary with a shopping list of victims which is a fantastic twist. You wouldn't think a film like this would have many special effects and if they did they'd be crappy, but you'd be wrong. OK there aren't lots of effects everywhere, they are sparse, but what we do see is cleverly done and highly effective in a tacky kind of way. We see the vamps flying around and hovering, Viago rises from his bed in that classic vertical manner, the guys change into bats, there are of course classic practical blood effects and most impressively we see the guys able to walk (and fight) up the walls and across the ceiling. One scene in particular shows two of the guys fighting up the walls and across the ceiling in one shot and it really does look fab (a rotating set I'm guessing). I must also add that the sets are really atmospheric too, again clearly basic but they work so well.The only thing I didn't quite like about this movie was the adding of other creatures of the night such as werewolves and zombies especially. I guess the werewolves I can accept but the way they are presented and acted out by the cast just doesn't quite work as well I think. The vampires have a clear distinction between themselves, you can send up different variations of vampires and there is so much you can do. With the werewolves its not really the same, one werewolf doesn't really differ from another, the jokes tend to be childish toilet/animal gags and they don't have any kind of distinctive look, they just look like regular boring humans. Of course once they turn things get a bit more exciting but then you lose the comedy aspect and it obviously becomes more of a genuine horror which you don't really want here. As for other monsters such as zombies that was a step too far for me, that felt like they were pushing it too much. I loved the cast in this film I really did, each of the three main vampires are really well portrayed and highly amusing throughout. In fact I can't even say which vampire was my favourite because they were all tops. Each actor had some very funny dialog and they are all gifted with amusing rubbery faces which helps. I won't lie and say its a perfect film that is full of laugh out loud moments from start to finish...but its damn close. Considering this came out of nowhere, the cast is unknown (to me), its a New Zealand made film (no disrespect) and the budget appears to be small...its a fine comedy that deserves much kudos. Its like...'Spinal Tap' but with vampires.'When you get four vampires in a flat obviously there's going to be a lot of tension, there's tension in any flatting situation'",
    "rating": "40",
    "date": "December 19, 2014"
  },
  {
    "reviewer": "Carlos M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/891372896/",
    "review": "  This original one-joke comedy is more impressive for its fantastic special effects than for its plot, which begins belly-achingly hilarious but then starts to slowly wear off as the novelty gives place to familiarity, proving that some ideas work better when made into short movies.",
    "rating": "35",
    "date": "November 10, 2014"
  },
  {
    "reviewer": "vieras e",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/154679237/",
    "review": "  Near perfection!",
    "rating": "45",
    "date": "November 2, 2014"
  },
  {
    "reviewer": "Gimly M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/861960467/",
    "review": "  Not the first horror-comedy mockumentary I've ever seen, but hey, if they keep makin' them at least this good, they can bring out as many as they want.",
    "rating": "30",
    "date": "January 21, 2015"
  },
  {
    "reviewer": "Shawn M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/902245252/",
    "review": "  Hilarious",
    "rating": "40",
    "date": "August 19, 2014"
  },
  {
    "reviewer": "Alec B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/790680964/",
    "review": "  Uses it's simple concept to great comedic effect and material alternates between a slacker roommate comedy and a spoof of the vampire genre quite easily.",
    "rating": "40",
    "date": "July 21, 2015"
  },
  {
    "reviewer": "Lane Z",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/906836279/",
    "review": "  From one half of the guys who brought you Flight of the Concords, Jermaine Clement and Taika Waititi wrote and directed this wonderfully campy, and for the most part hilarious, take on vampires. In an age where vampire stories like Twilight and True Blood have overrun television and movies with terrible stories about love and betrayal and death compounded by bad acting, \"What We Do in the Shadows\" thankfully strays very far in the opposite direction with comedy. It's a simple day in the life kind of mockumentary for these small group in a flat in New Zealand.While the takes on vampires isn't necessarily fresh...I'm talking about partying at night and avoiding the cliches we've come to know...everything comes out as a joke. The closest film I can relate this to is Four Brothers. Flight of the Concords worked so well on a platform of music and sketches, so this comes off as a drawn out television show with a bunch of different events that would have worked well in short spurts. At only 80 minutes long, this offers every cheap and hearty laugh you'd expect from a group of guys who do well at their craft.",
    "rating": "40",
    "date": "December 31, 2014"
  },
  {
    "reviewer": "Francisco G.",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/913676958/",
    "review": "  The vampire comedy no one was expecting, What We Do In The Shadows is constantly hilarious and not only respects the vampire mythos but makes the greatest use of it to tell amazing jokes everyone can appreciate. The low-budget is worn with pride, like one of the vampire's beloved silk dresses, creating even more fun where it shouldn't be. Sure, half-way through it gets a lil' stale, some jokes repeat themselves a bit often but since it worked so well from the start, they have all the right to thread over these issues, because it's clear everyone involved is having a blast and that comes across to us, the viewer.",
    "rating": "40",
    "date": "March 4, 2015"
  },
  {
    "reviewer": "Matthew C",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/783749723/",
    "review": "  One of the most fun and clever movies of the year!What at first seems like a one-note, SNL-type vampire trope parody/mockumentary, actually digs deeper and deeper into the horror/vampire mythos and creates a brilliant, often hilarious satire of the genre and modern society in general. Playing like a day-in-the-life snapshot of these goofy, out-of-touch creatures of the night, the comedy is structured with a loose plot connecting a series of clever bits and sketches. While many of these humorous observations of vampire lore have been made before, the script and cast are so funny and likable -- and the punchlines have the benefit and freedom of going balls-to-the-wall, crazy over-the-top -- that this movie ends up being one of the most original comedies in recent memory. Its often intense gore may turn some off to the film (even I think it goes overboard in places), but so many of the laughs are dependent on the violence as a means to mock it's use in the films it lampoons. It's a great watch -- offering many interesting, modern-world scenarios in which to place the centuries-old protagonists. It also features the same kind of refreshingly-awkward humor you'd expect from Flight of the Conchords (that series' creators wrote and directed this gem). The first few minutes may seem a bit obvious in the joke setup, but be sure to stick around for some hilarious vampire shenanigans.",
    "rating": "35",
    "date": "September 21, 2015"
  },
  {
    "reviewer": "kenscheck",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/890863156/",
    "review": "  Mockumentary that pokes fun at Vampire movies and tropes, following 4 Vampire roommates in New Zealand in the lead up to the Unholy Masquerade. The movie is quite funny, with a good cast. I'm a fan of the Flight of the Conchords, so it was nice to something new from people who came from that. If you want a good horror comedy for Halloween, you can't go wrong with this one.",
    "rating": "35",
    "date": "May 27, 2015"
  },
  {
    "reviewer": "Lauren S",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/788689639/",
    "review": "  This was everything I was hoping it would be! Fantastic performances from all of the actors and so many laugh out loud moments. There needs to be more horror/comedy films out there like this one!",
    "rating": "50",
    "date": "August 11, 2015"
  },
  {
    "reviewer": "Anatoly S",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/784238567/",
    "review": "  A New Zealand mockumentary about vampires who share an apartment and also ONE OF THE FUNNIEST THINGS I'VE SEEN IN RECENT YEARS. Seriously, if you don't mind a bit of dark humor & blood in your comedy, SEE THIS IMMEDIATELY.",
    "rating": "50",
    "date": "May 28, 2015"
  }
,
  {
    "reviewer": "Angel V",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/971319041/",
    "review": "  What a great movie.. Great actors and A LOT OF FUNNY MOMENTS.. It's a must watch for anybody who hasn't seen it yet!",
    "rating": "45",
    "date": "January 25, 2016"
  },
  {
    "reviewer": "Anders A",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/782589780/",
    "review": "  Absurd crazy Vampyric humor. Smart and funny, with a great piece of New Zealanders obviously great humor.",
    "rating": "45",
    "date": "January 24, 2016"
  },
  {
    "reviewer": "Jeffrey D",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/877524831/",
    "review": "  There were some really funny parts. It started to drag a little near the end. The movie was pretty short, so the fact that it felt like it was dragging at any point probably isn't good.",
    "rating": "30",
    "date": "January 23, 2016"
  },
  {
    "reviewer": "Jose O.",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/973017872/",
    "review": "  I trusted what people said on RT, I guess it was a prank, the worst comedy on earth.",
    "rating": "05",
    "date": "January 19, 2016"
  },
  {
    "reviewer": "Diana S",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/837122801/",
    "review": "  Expected more. Found it pretty boring.",
    "rating": "25",
    "date": "January 21, 2016"
  },
  {
    "reviewer": "Markus M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/887669231/",
    "review": "  A constantly amusing and entertaining film, although at no point is it outright hilarious. That and I do wish they had done more with Petyr. Still, the film is constantly funny, and I'd gladly watch it again anytime.7,5/10",
    "rating": "40",
    "date": "January 20, 2016"
  },
  {
    "reviewer": "Ben H",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/785201585/",
    "review": "  4 and a half out of 5VERY INNOVATIVE!!",
    "rating": "45",
    "date": "January 18, 2016"
  },
  {
    "reviewer": "Brett H",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/794472835/",
    "review": "  What We Do In The Shadows is a mockumentary vampire comedy about three generations of vampires living under one roof who hire a film crew to document their day-to-day lives and this is bar none, one of the funniest comedies I've seen in years! Helmed by the warped minds of Jemaine Clement and Taika Waititi, who also star as two of the vampires, their brand of absurdist black comedy and sight gags had me absolutely dying and it's a shame this film is so underrated. There isn't exactly a plot per se, more like a string of hilarious vignettes as we follow the vampires' attempts to go clubbing (which they can't do unless they are invited inside), their rivalry with a gang of werewolves (which are easily the funniest scenes), and of course, feeding on human blood. The improv skills and chemistry the cast has with one another comes across so genuine you'll swear they really are these characters and their deadpan delivery had me in stitches. There really isn't too much more to say as it's impossible to describe just how funny and in-the-pocket this film was without seeing it for yourself, but you will need to have a pretty twisted/dark sense of humour; we are dealing with vampires here after all!",
    "rating": "45",
    "date": "January 18, 2016"
  },
  {
    "reviewer": "Scott P",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/816770648/",
    "review": "  With long-simmering anticipation from first hearing about it & the first ten minutes available as a teaser, I was actually quite disappointed with what we got. There were parts I liked, but it felt like an extended Flight of the Conchords episode mixed with awkwardness from The Office. It just got weaker as it went on. Except for Stu. Stu was amazing.",
    "rating": "20",
    "date": "January 17, 2016"
  },
  {
    "reviewer": "Mike M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/928726191/",
    "review": "  Really really hysterical.",
    "rating": "45",
    "date": "January 16, 2016"
  },
  {
    "reviewer": "Anthony K",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/878570537/",
    "review": "  Why this movie was denied a Golden Globe nomination in favor of other \"comedies\" like \"The Martian\" is beyond me. It plays on classic vampire tropes far better than low-ball farces like \"Vampires Suck\" and the ensemble cast keep it rye and funny throughout. It's also one of the rare movies to use slapstick effectively. Very funny and highly entertaining. 8.5/10",
    "rating": "45",
    "date": "February 6, 2015"
  },
  {
    "reviewer": "Matthew R.",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/972502159/",
    "review": "  The best NZ film in recent memory. Dark, morbid but so witty and intelligently written. A must watch!",
    "rating": "40",
    "date": "January 12, 2016"
  },
  {
    "reviewer": "Fritz L",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/973016422/",
    "review": "  I failed to see why this movie reviewed well. Aside from being not-funny and not-interesting, it was also gory and gross.",
    "rating": "20",
    "date": "January 11, 2016"
  },
  {
    "reviewer": "Rachelle T",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/783131061/",
    "review": "  Different and funny -- a refreshing take on the world of vampires, and what it means to try to be a person when you're an immortal with an unfortunate appetite.",
    "rating": "40",
    "date": "March 20, 2015"
  },
  {
    "reviewer": "Oj H",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/905537159/",
    "review": "  The best mocumentary since Spinal Tapp... hilarious!! I can't say enough, so I'll just stop and say... watch it!!",
    "rating": "40",
    "date": "February 3, 2015"
  },
  {
    "reviewer": "Ailsa H",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/895586960/",
    "review": "  refreshing, quirky, am sure Ive had flatmates that were very similar.",
    "rating": "50",
    "date": "January 8, 2016"
  },
  {
    "reviewer": "Drew B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/945880064/",
    "review": "  saw it last night was good time it was funny and had a nice twist on vampire and got to tell my friends it's worth watching.",
    "rating": "45",
    "date": "January 7, 2016"
  },
  {
    "reviewer": "Alex S",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/928639325/",
    "review": "  Some kind of mix between Man Bites Dog, Blair Witch Project, and Only Lovers Left Alive (except better than all of them), What We Do in the Shadows is a clever take on an overused genre with consistent laughs throughout.",
    "rating": "40",
    "date": "January 6, 2016"
  },
  {
    "reviewer": "Hardik R",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/807015555/",
    "review": "  Hilarious but too short. Worth the recommendation for sure!",
    "rating": "wts",
    "date": "January 6, 2016"
  },
  {
    "reviewer": "closedmouth",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/820123502/",
    "review": "  A lot of clever ideas that kind of make you smile and nod, but the improv never really felt like it created any great jokes, just some low-key silliness that didn't make me laugh out loud in the same way Flight of the Conchords can seemingly through the same low-key vibe. Amusing, clever, enjoyable, but lacking in jokes.",
    "rating": "35",
    "date": "January 4, 2016"
  }
,
  {
    "reviewer": "Scott W",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/841539183/",
    "review": "  I don't get the praise for this movie but I will say that vampires do nothing for me. This has some funny and amusing bits here and there but most of it just wasn't funny to me.",
    "rating": "20",
    "date": "January 4, 2016"
  },
  {
    "reviewer": "Brian C",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/857053172/",
    "review": "  Definitely a fun and clever vampire movie!",
    "rating": "40",
    "date": "January 2, 2016"
  },
  {
    "reviewer": "Victor R.",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/972896778/",
    "review": "  One of the main complaints nowadays with movies in general, is their lack of originality, but I can say that this is not the case. This is a very clever, original and hilarious movie filled with black humor, emotional themes such as friendship and self consciousness.",
    "rating": "45",
    "date": "January 2, 2016"
  },
  {
    "reviewer": "Danielle P",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/890903884/",
    "review": "  Funniest movie I've seen this year! Loaded with twisted humor and charm, it's one of those rare movies that gets better every time you watch it.",
    "rating": "50",
    "date": "January 2, 2016"
  },
  {
    "reviewer": "Armand P",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/788909448/",
    "review": "  The jokes and gags flow as freely as the cartoonish blood in this smart and fun portrayal of everyday life for the modern vampire.",
    "rating": "50",
    "date": "January 2, 2016"
  },
  {
    "reviewer": "MovieReviewer1",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/901228504/",
    "review": "  What We Do in the Shadows is one of the funniest, smartest, and most original mockumentary films to come out in recent years, a must see.",
    "rating": "45",
    "date": "August 2, 2015"
  },
  {
    "reviewer": "Jeran P",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/863682683/",
    "review": "  Takes a bit to get going, but super solid comedy",
    "rating": "40",
    "date": "February 9, 2015"
  },
  {
    "reviewer": "Bram C",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/803460412/",
    "review": "  Funniest film I've seen in a long time.",
    "rating": "50",
    "date": "February 9, 2015"
  },
  {
    "reviewer": "tyron r",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/401397227/",
    "review": "  this is how you do a mock-u-mentory",
    "rating": "45",
    "date": "December 30, 2015"
  },
  {
    "reviewer": "Laurel S",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/948672848/",
    "review": "  Refreshing , original and sometimes funny . I have to say that this movie surprised me with it's ability to take something I never would have thought funny and make it funny .Not downright hilarious but still an amusing film none-the-less . The backstories of all the characters made the characters relatable and will have you rooting for them until the very end . Definitely entertaining and worth a second and/or third viewing .",
    "rating": "35",
    "date": "December 29, 2015"
  },
  {
    "reviewer": "Richard V",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/786261976/",
    "review": "  What We Do In The Shadows is a clever mockumentary about a group of vampires living in a New Zealand flat. It has a smart plot, fascinating world-building (as we later learn, this is a world where werewolves, zombies, and hunters all coexist in a fragile ecosystem, and while humans are aware of their existence, not much has been done to essentially conflict with them, despite the fact that all of them do feed on humans, which was a major plot hole), and interesting characters. I can see why director Taika Waititi won the director's chair for Thor based on this film. I would enjoy seeing a sequel to this film, but it's in no means the best film I've seen. I would have enjoyed more humor, more world-building, and more conflict. Often times, the film felt like it held back from going somewhere each time to just play it safe, but it is an otherwise fun and clever spoof.",
    "rating": "35",
    "date": "December 28, 2015"
  },
  {
    "reviewer": "Roxanne C",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/914191169/",
    "review": "  Funny and very entertaining !",
    "rating": "45",
    "date": "August 8, 2015"
  },
  {
    "reviewer": "Alex F",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/918207330/",
    "review": "  Insanely funny, I found myself laughing more than I thought I would. Likeable characters, and very clever. Watch it.",
    "rating": "35",
    "date": "December 25, 2015"
  },
  {
    "reviewer": "John L.",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/971454325/",
    "review": "  WHAT WE DO IN THE SHADOWS is supposed to be a comedy. I watched it to the very end, waiting for the first hit of humor. It never came. The film was a total waist of time.",
    "rating": "05",
    "date": "December 21, 2015"
  },
  {
    "reviewer": "Colin H",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/804891708/",
    "review": "  Brilliantly combines the vampire genre with flat-share sitcom, in mockumentary style. Viago complains about his flatmates failing to spread towels on the couch while they are eating their victims, and clubbing outfits are somewhat eccentric, not least because they can't see themselves in the mirror, as they are, after all, vampires. Hugely inventive and extremely funny.",
    "rating": "50",
    "date": "December 23, 2015"
  },
  {
    "reviewer": "Akiko A",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/945943314/",
    "review": "  A truly funny documentary style comedy that pokes fun at vampires and other paranormal personalities. An eccentric group of vampires live together in a house having nothing in common. One of them makes a new vampire who has no respect for the lifestyle & secrecy of being a vamp causing drama for all of them. The movie follows the vampires in their daily lives adapting to the world they live in, while feeding & still trying to fit in. The part where they must pick an outfit for the night was a very funny moment as some of the most inappropriate over the top outfits show how out of touch these guys are. It makes fun of the whole paranormal genre with a twisted sense of humor that works brilliantly.",
    "rating": "40",
    "date": "December 22, 2015"
  },
  {
    "reviewer": "Chris G",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/895611648/",
    "review": "  While the comedy takes a couple of scenes to get going, it is hysterical once it starts. It is more clever than the seemingly dumb portrayals make it seem and, MAN, the gore is good.",
    "rating": "40",
    "date": "December 21, 2015"
  },
  {
    "reviewer": "David M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/907282584/",
    "review": "  I am so sick of vampire movies, but this mockumentary is hilarious. I highly recommend it.",
    "rating": "45",
    "date": "December 20, 2015"
  },
  {
    "reviewer": "Tim R",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/771255002/",
    "review": "  Hilarious mockumentary about a group of vampires living together. While there are some misses in the various skits that make up the movie most provide plenty of laughs along with knowing nods to vampires and horror films of yore.",
    "rating": "40",
    "date": "November 24, 2015"
  },
  {
    "reviewer": "Kim L",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/972610227/",
    "review": "  I would love WWDITS to be turned into a series. As a lifelong fan of the vampire genre, I thought this was more than a brilliant twist.",
    "rating": "50",
    "date": "December 16, 2015"
  }
,
  {
    "reviewer": "Jonathan B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/781872470/",
    "review": "  The funniest vampire movie you will ever see and a brilliant use of the mockumentary format. Has me very interested in Thor 3 now.",
    "rating": "40",
    "date": "December 16, 2015"
  },
  {
    "reviewer": "Cheryl F",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/917537742/",
    "review": "  \"a fatal sunlight accident\"",
    "rating": "50",
    "date": "December 12, 2015"
  },
  {
    "reviewer": "Heather D",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/795503976/",
    "review": "  Really enjoyed this! Mockumentary + Kiwis + vampires + roommate situations + Deacon's erotic dance.",
    "rating": "45",
    "date": "March 1, 2015"
  },
  {
    "reviewer": "Jamie F",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/602386691/",
    "review": "  This is a VERY funny movie. Highly recommended.",
    "rating": "30",
    "date": "December 7, 2015"
  },
  {
    "reviewer": "Alejandro C",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/835503547/",
    "review": "  Me ha aburrido much�simo. La idea era curiosa, pero no me ha hecho gracia alguna.",
    "rating": "10",
    "date": "October 31, 2015"
  },
  {
    "reviewer": "Cheryl W",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/912484347/",
    "review": "  This movie is so funny, I watched the whole thing twice!",
    "rating": "50",
    "date": "August 16, 2015"
  },
  {
    "reviewer": "Glenn D",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/972439467/",
    "review": "  What a load of rubbish. The novelty wore off ten minutes in and then it was just lame gag after lame gag for the rest of the movie. Stunningly overrated.",
    "rating": "05",
    "date": "December 5, 2015"
  },
  {
    "reviewer": "Romina R.",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/906815129/",
    "review": "  It'0s really hilarious, but it gets a bit boring by the middle. The plot gets tiring and there's not much more to look forward to.Still very funny and great moments.",
    "rating": "30",
    "date": "November 22, 2015"
  },
  {
    "reviewer": "Brad S",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/783623907/",
    "review": "  This Vampire Mockumentary is pretty funny. Features several of the \"Flight of the Concords\" team. Not for everyone, but I laughed.",
    "rating": "35",
    "date": "November 21, 2015"
  },
  {
    "reviewer": "Armando G",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/784622113/",
    "review": "  I've always been suspicious of the easy, instant, and unquestioned coolness and sexiness of vampires. Every screen representation of vampires portrays them as outsiders, but as cool outsiders. What We Do In the Shadows is about a group of undead, uncool outsiders, which makes them the most relatable vampires I've ever seen. This is the most delightful and hilarious comedy I've seen in years. Have I laughed as hard at other recent comedies? Yes, but none have had such a lasting effect on me. I saw this movie in theaters back in February of this year, and I still smile whenever I think about it.What We Do in the Shadows was co-written and co-directed by Jemaine Clement and Taika Waititi, who also play two of the lead characters. Clement is best known for being part of the funny folk music duo Flight of the Conchords. He starred in the HBO series named after the duo. Taika Waititi wrote and directed some Flight of the Conchords episodes. The movie is shot as a documentary that follows four vampire friends and roommates in New Zealand as they prepare to attend the Unholy Masquerade, the biggest social event of the underworld.This movie has an incredibly lovable band of misfits for its main characters. Each character portrays a different style of vampire. Viago (Waititi) is a foppish 18th century vampire, like Anne Rice's characters in Interview with the Vampire. Vladislav (Clement) is a medieval, feudal tyrant, like Vlad the Impaler (if he really was a vampire). Deacon (played by Jonathan Brugh) is a 19th century Romantic era vampire, like Dracula, and Petyr (played by Ben Fransham) is a monstrous Nosferatu style vampire. Their dynamic is thrown for a loop for when Petyr turns one of their intended victims into a vampire. This new vampire is Nick (played by Cori Gonzalez-Macuer). He is young and hip and trendy and takes to being vampire very well. He walks down a busy sidewalk shouting, \"I'm Twilight! That's me!\"This is a horror comedy that is heavy on comedy and light on horror. There is not much gore but there are some bloody scenes played for laughs (Viago bites someone then can't control the wild spurts of blood). The gags are very funny and clever. The vampires love going out but can't tell if their outfits work because they don't have reflections. Once they go out, they have to get the bouncer of a club to invite them in since vampires can't enter any place they're not invited. Viago, Vladislav, and Deacon all become obsessed with Nick's blandly average human friend, Stu, who shows them how to use the internet, which leads to many laughs. One of the funniest scenes in the movie is when the vampires run into their natural rivals, a pack of werewolves led by Rhys Darby, who also had a part in the Flight of the Conchords series.All of the vampires have backstories, hopes, and regrets that feel real and make them fully developed characters. The scenes of them having arguments about whose turn it is to do the dishes help, too. What We Do in the Shadows has loads of charm and delight but is also sincere without being overly dramatic. This film loves its characters and never makes fun of them. The pathos is genuine and well earned. This isn't disposable comedy; jokes are great, but jokes with memorable characters are better. Whether you like horror or comedy, or both, or like vampires or are indifferent towards them, like me, What We Do in the Shadows will deliver on every front. When I make Best of 2015 list, I know this movie will be included, and I wouldn't be surprised if I watch it next Shocktober, too.",
    "rating": "50",
    "date": "July 25, 2015"
  },
  {
    "reviewer": "Bj A",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/914644853/",
    "review": "  The funniest movie I have seen a quite a while....Absolutely Hilarious. Awesome flic..!! Best mockumentary since Spinal Tap and Best in Show...Seriously can not say enough about this movie...!!",
    "rating": "50",
    "date": "November 19, 2015"
  },
  {
    "reviewer": "Harley M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/864382320/",
    "review": "  funny and clever and weirdly emotionally resonant in places.",
    "rating": "40",
    "date": "August 27, 2015"
  },
  {
    "reviewer": "Kristi M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/956100698/",
    "review": "  I kept putting off watching this because I wasn't exactly sure what I would be in for and this exceeded what I expected. It's a mashup of Being Human and Real World that takes vampire lore and spins it into routines that normal humans might do but with vampire flair. If you haven't seen Bram Stoker's Dracula you'll miss some of the funniest jokes but since I have it I rolled at some of the unexpected references I also read that the youngest vampire got mad that he didn't sparkle and they cut it, which I would have loved to see. This could have really gone overboard but they managed to keep it just clever and silly enough to make me laugh out loud without it feeling forced. It's also insanely quote-able. \"Don't eat the Biscetti!\"",
    "rating": "50",
    "date": "July 27, 2015"
  },
  {
    "reviewer": "Jussi M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/831833426/",
    "review": "  T�t�kin kehuttiin jossain. Ei oikein iskenyt.",
    "rating": "25",
    "date": "November 10, 2015"
  },
  {
    "reviewer": "Emod L.",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/966559778/",
    "review": "  91%Subtle and fast-paced, What We Do In The Shadows is a rare and unique vampire film that pits its anti-heroes against the issues of daily modern day life, and to riotously funny results.V: 86%",
    "rating": "45",
    "date": "February 9, 2015"
  },
  {
    "reviewer": "Stewart W",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/784411711/",
    "review": "  While it's easy to describe conceptually as equal parts Being Human and This is Spinal Tap that doesn't begin to convey the level of polish in the execution. Deliberately low key and , at times, gory, but consistently laugh out loud funny.",
    "rating": "40",
    "date": "November 9, 2015"
  },
  {
    "reviewer": "Nicholas R",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/794436204/",
    "review": "  Great indie movie. Funny, original, and great characters. A must see.",
    "rating": "50",
    "date": "April 22, 2015"
  },
  {
    "reviewer": "Anthony K",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/907023216/",
    "review": "  Unbelievably funny, especially for a movie that seemingly came out of absolutely nowhere. You'd think the movie could not sustain any sense of momentum or humor for its runtime, given the absurdity of its premise. It ends up playing out, though, like an hour and a half, even-higher-concept Flight of the Conchords arc (which I consider a compliment of the highest order for any comedy). You'll enjoy it even more if you 'get' the classic vampire references - Lost Boys, Nosferatu, and Bram Stoker's Dracula in particular get a lot of nods.",
    "rating": "45",
    "date": "March 23, 2015"
  },
  {
    "reviewer": "Virgilio L",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/836337051/",
    "review": "  This was rather entertaining and witty",
    "rating": "40",
    "date": "November 7, 2015"
  },
  {
    "reviewer": "KJ P",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/896976177/",
    "review": "  \"What We Do int he Shadows\" puts a huge spin on it's genre, creating a documentary style film about a fictional world of vampires as they travel the streets at night and sleep in their home together during the day. This plays out almost like a wholly dialogue driven feature, with just one difference, everything. This is a very clever (albeit oversaturated) story that i really enjoyed. About halfway through the film you get the sense that they have nowhere else to go with the story and that definitely shows in it's mere 20-minute running time. Well scripted and plotted out well enough, this film has a little something for everyone to \"sink their teeth into.\" To mockumentary fans, this film could be their dream. To myself, \"What We Do in the Shadows\" works very well at what it sets out to do, but ultimately falls a little flat in some aspects. A very fun and slightly original film that I can recommend watching around Halloween.",
    "rating": "35",
    "date": "August 4, 2015"
  }
,
  {
    "reviewer": "Abdulmalik A",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/906510306/",
    "review": "  What We Do in the Shadows is both a refreshingly different take on vampire conventions and one of the funniest comedies of the year.",
    "rating": "40",
    "date": "November 4, 2015"
  },
  {
    "reviewer": "Owen M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/713742914/",
    "review": "  Very clever mockumentary. Just goes to show that the undead have their hopes and dreams, the same as us. Must make a note to get garlic tomorrow.",
    "rating": "50",
    "date": "November 3, 2015"
  },
  {
    "reviewer": "R. Ward",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/972126462/",
    "review": "  Original, very funny and touching. Intelligent, humorous take on an exhausted genre.",
    "rating": "40",
    "date": "November 2, 2015"
  },
  {
    "reviewer": "Kevin M. W",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/787154086/",
    "review": "  Not as good as advertised. Silly and sophomoric, which is too bad.",
    "rating": "25",
    "date": "November 1, 2015"
  },
  {
    "reviewer": "Jo&#xFFFD;o P",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/905545293/",
    "review": "  What We Do In The Shadows is one of the most hilarious movies about vampires that you will watch this year and maybe the best comedy of the 2015 so far. (4.5/5)",
    "rating": "45",
    "date": "November 1, 2015"
  },
  {
    "reviewer": "Ryan S",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/885068431/",
    "review": "  Absolutely hysterical. A must-watch comedy",
    "rating": "50",
    "date": "October 31, 2015"
  },
  {
    "reviewer": "ElmosLively",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/901062789/",
    "review": "  At times very clever and at times outrageously stupid, this film is well acted and has some pretty good visual and make-up effects but, unfortunately really bogs down into its own Idiosyncrasy.",
    "rating": "35",
    "date": "October 30, 2015"
  },
  {
    "reviewer": "W James S",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/905840384/",
    "review": "  At times very clever and at times outrageously stupid, this film is well acted and has some pretty good visual and make-up effects but, unfortunately really bogs down into its own Idiosyncrasy.",
    "rating": "35",
    "date": "October 30, 2015"
  },
  {
    "reviewer": "Ian H",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/927279268/",
    "review": "  Best mockumentary about vampires to ever come out of New Zealand. Highly recommend for a hilarious, unpredictable, and fresh unconventional take on vampire lore and movie tropes. If you've ever stopped to wonder who does the dishes in a vampire brood, then look no further.",
    "rating": "35",
    "date": "October 30, 2015"
  },
  {
    "reviewer": "James H",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/782947624/",
    "review": "  It's good fun, and I think I might have laughed once or twice but, as somebody who loved Flight of the Conchords, I expected something cleverer.",
    "rating": "25",
    "date": "October 29, 2015"
  },
  {
    "reviewer": "ryan y.",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/972059830/",
    "review": "  A vampire comedy beyond imagination. Very innovative, very different from those young-teen romantic love stories with the vampire on TV. Those \"boring\" but cute flatmates represent a image of the normal people like us. I think it's a funny comedy about boring normal life, just with a vampire coating. Great work!",
    "rating": "45",
    "date": "October 27, 2015"
  },
  {
    "reviewer": "Helena K",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/795847518/",
    "review": "  Just absolutely silly and delightful.",
    "rating": "45",
    "date": "December 30, 2014"
  },
  {
    "reviewer": "Lilwookiee",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/901390149/",
    "review": "  You probably haven't even heard of this one, but if you haven't seen it... well, you need to.�� ESPECIALLY if you were/are a fan of Flight of the Conchords.� It's written by the same guys, and you can really tell, it's that same type of humor: silly, but still smart.�� This is a supremely clever genre-mashup of documentary, comedy, and horror.� It's a \"mockumentary\" at heart, about a group of vampires of varying ages and their day-to-day life in the modern world... it's \"The Real World\", but with vampires.� And it's hilarious.� I laughed out loud the whole way through, and I have a feeling it will get funnier upon repeat viewings.� It's more than just a spoof, it's really creative with how it satirizes modern culture, specifically our current obsessions with televised voyeurism and all things undead.� The introduction is about 15 minutes long and tells you all you need to know about the kind of movie this is going to be, and I was hooked from the start.� It does get a little slow in the middle, but it picks up again in the third act with both the pace and the laughs.� This film is a brilliant spin on both the vampire genre and reality TV, and it exceeded all my expectations.� Unless you have Netflix, you may have a hard time finding this one, but make the effort to seek it out.� You'll be glad that you did, it's a scream.",
    "rating": "45",
    "date": "October 27, 2015"
  },
  {
    "reviewer": "Douglas L",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/785887987/",
    "review": "  What We Do in the Shadows, is one of the funniest movies I have seen in a long time. It is hilariously explores the life of a group of vampire in the real world living in their suite as we see their routine night to night. The different personalities of the vampires and their backgrounds make a fantastic cast. The film works because it thoughtfully touches on vampire tradition while keeping the modern day in mind.",
    "rating": "40",
    "date": "October 26, 2015"
  },
  {
    "reviewer": "Andr&#xFFFD; D",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/799569684/",
    "review": "  \"What We Do In The Shadows\" es un maravilloso e hilarante documental falso realizado en NUeva Zelanda, en el que las c�maras registran la vida de cuatro vampiros que viven juntos: Deacon (interpretado por Jonathon Brugh), un vampiro enamorado y recatado tipo \"Twilight\"; Vladislav (una genial interpretaci�n del co-director Jemaine Clement), un vampiro s�dico y pervertido tipo \"Dracula\" de Francis Ford Coppola; Viago (interpretado por el co-director Taika Waititi), un vampiro malvado y moderno tipo \"Interview With The Vampire\" y Petyr (un Ben Fransham que se roba el show) como un atemorizante \"Nosferatu\" de m�s de 8000 a�os de edad. La pel�cula est� llena de referentes vamp�ricos (con hombres lobo y zombies incluidos) y har� relucir sus colmillos gracias a su humor inteligente.",
    "rating": "45",
    "date": "October 26, 2015"
  },
  {
    "reviewer": "Graham W",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/821319347/",
    "review": "  Takes the mockumentary format and injects something new and fresh into it (see, no puns about 'blood' necessary). Great fang, I mean fun.",
    "rating": "30",
    "date": "October 24, 2015"
  },
  {
    "reviewer": "Kirsty P",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/971998499/",
    "review": "  Really silly, fun, and very enjoyable. Viago is an impossibly sweet, blood-thirsty monster.",
    "rating": "50",
    "date": "October 23, 2015"
  },
  {
    "reviewer": "Del H",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/927145622/",
    "review": "  Incessantly creative with what was once a completely dead (haha) genre and always incredibly hilarious. This is an out of the box film that deserves several viewings.",
    "rating": "45",
    "date": "October 21, 2015"
  },
  {
    "reviewer": "Aquilino S",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/818815527/",
    "review": "  great movie, you have to see it.",
    "rating": "50",
    "date": "October 19, 2015"
  },
  {
    "reviewer": "Sel C",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/971825733/",
    "review": "  best comedy horror ever",
    "rating": "50",
    "date": "October 17, 2015"
  }
,
  {
    "reviewer": "Tim S",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/856047778/",
    "review": "  One of favorite movies of 2015, this is also one of the funniest and most charming horror comedies to come along in a long time.",
    "rating": "50",
    "date": "August 18, 2015"
  },
  {
    "reviewer": "Henry E.",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/967848068/",
    "review": "  Funny and very clever. Anyone with a love for Flight of the Conchords will fall in love with this.",
    "rating": "40",
    "date": "October 17, 2015"
  },
  {
    "reviewer": "bill s.",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/911733308/",
    "review": "  Satires/parodies are as tired as the material they're mocking but every now and then a movie finds it's sweet spot and this is one those times.",
    "rating": "40",
    "date": "July 21, 2015"
  },
  {
    "reviewer": "Jason C",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/811862469/",
    "review": "  Many mockumentaries have a great premise but fail to execute with enough actual content and jokes throughout the length of the film. WWDITS is a notable exception - the documentary crew are largely irrelevant to the action and humour, so the story of four vampires 'flatting' can play out with plenty of gags, the vast majority of which hit home.",
    "rating": "40",
    "date": "October 16, 2015"
  },
  {
    "reviewer": "Lucie H",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/919564082/",
    "review": "  Funniest, cleverest film I've seen in a very long time. Waititi, Brugh, and Clement have impeccable comedic timing: they blurt out line after line of hilarity. And while it's perfectly crafted, it also has heart.",
    "rating": "wts",
    "date": "September 24, 2014"
  },
  {
    "reviewer": "Jeffrey T",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/832632227/",
    "review": "  One of the funniest movies I've seen in a long time. If you like \"mockumentaries\" and/or vampire satire (new category), this is for you!",
    "rating": "45",
    "date": "October 11, 2015"
  },
  {
    "reviewer": "Kirby P",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/933137789/",
    "review": "  Kinda sucked, actually (!) Good premise, but the premise wore out in the first ten minutes. It had its moments, but not enough of them.",
    "rating": "20",
    "date": "October 3, 2015"
  },
  {
    "reviewer": "Brad C",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/971765357/",
    "review": "  A very refreshing, creative, fun look into our classic Stoker-esque vampire stereotypes from a modern and relatable perspective. Made great by the hilarious cast with delightful chemistry.",
    "rating": "50",
    "date": "October 1, 2015"
  },
  {
    "reviewer": "Crow F",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/950491446/",
    "review": "  One of my new all time favs -mixes old school vampire classics with new ideas and great humor.",
    "rating": "50",
    "date": "September 27, 2015"
  },
  {
    "reviewer": "James C",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/872669410/",
    "review": "  Very very funny. Takes a concept that starts off somewhat overly predictable and ends somewhere completely different and altogether wonderful.",
    "rating": "40",
    "date": "September 24, 2015"
  },
  {
    "reviewer": "In 3 lines or less",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/971384179/",
    "review": "  Vampires united to pay the rent, feed, and otherwise ruminate on their long past with a not so original, faux-documentary lifestyle; can be funny mainly because these vampires are vamps (not teens) with a bad secret. They like to waste time on macabre humor and genuine weirdness.",
    "rating": "30",
    "date": "September 19, 2015"
  },
  {
    "reviewer": "Greg N",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/907111989/",
    "review": "  The mockumentary genre definitely has room to welcome in a vampire movie from a Flight of the Concords alum. Very funny.",
    "rating": "40",
    "date": "September 22, 2015"
  },
  {
    "reviewer": "Szymon N",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/868488066/",
    "review": "  Great comedy! I really enjoyed watching this movie once alone, then with some friends, again with other friends and another time... I can watch it all the time.",
    "rating": "50",
    "date": "March 31, 2015"
  },
  {
    "reviewer": "Matthew C",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/783749723/",
    "review": "  One of the most fun and clever movies of the year!What at first seems like a one-note, SNL-type vampire trope parody/mockumentary, actually digs deeper and deeper into the horror/vampire mythos and creates a brilliant, often hilarious satire of the genre and modern society in general. Playing like a day-in-the-life snapshot of these goofy, out-of-touch creatures of the night, the comedy is structured with a loose plot connecting a series of clever bits and sketches. While many of these humorous observations of vampire lore have been made before, the script and cast are so funny and likable -- and the punchlines have the benefit and freedom of going balls-to-the-wall, crazy over-the-top -- that this movie ends up being one of the most original comedies in recent memory. Its often intense gore may turn some off to the film (even I think it goes overboard in places), but so many of the laughs are dependent on the violence as a means to mock it's use in the films it lampoons. It's a great watch -- offering many interesting, modern-world scenarios in which to place the centuries-old protagonists. It also features the same kind of refreshingly-awkward humor you'd expect from Flight of the Conchords (that series' creators wrote and directed this gem). The first few minutes may seem a bit obvious in the joke setup, but be sure to stick around for some hilarious vampire shenanigans.",
    "rating": "35",
    "date": "September 21, 2015"
  },
  {
    "reviewer": "Vulcan S",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/783264703/",
    "review": "  shines a fresh, enthusiastic light into the traditional vampire as well as mockumentary genre with brilliant comedic rhythm, loveable, lively vampires and other classic victorian gothic creatures.",
    "rating": "45",
    "date": "September 21, 2015"
  },
  {
    "reviewer": "kenscheck",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/890863156/",
    "review": "  Mockumentary that pokes fun at Vampire movies and tropes, following 4 Vampire roommates in New Zealand in the lead up to the Unholy Masquerade. The movie is quite funny, with a good cast. I'm a fan of the Flight of the Conchords, so it was nice to something new from people who came from that. If you want a good horror comedy for Halloween, you can't go wrong with this one.",
    "rating": "35",
    "date": "May 27, 2015"
  },
  {
    "reviewer": "Brian N",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/806693106/",
    "review": "  It was a fun movie. It had a good concept. I laughed out loud a few times. Definitely worth a watch.",
    "rating": "30",
    "date": "September 18, 2015"
  },
  {
    "reviewer": "Kyal B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/794578611/",
    "review": "  One of the funniest films in recent memory",
    "rating": "45",
    "date": "September 17, 2015"
  },
  {
    "reviewer": "peanutdonut",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/900842936/",
    "review": "  It liked it and it was clever, not quite as consistently funny as I had hoped though.",
    "rating": "30",
    "date": "September 17, 2015"
  }
,
  {
    "reviewer": "Hassam A.",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/959744615/",
    "review": "  Hilarious and fun mockumentary which provides great laughs, characters and endless quotability.",
    "rating": "50",
    "date": "September 17, 2015"
  },
  {
    "reviewer": "Miriam L",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/793646945/",
    "review": "  It was amusing and definitely had its moments. I probably wouldn't watch it again, but it was a fun mockumentary.",
    "rating": "30",
    "date": "September 16, 2015"
  },
  {
    "reviewer": "Jo&#xFFFD;o Miguel R",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/969287392/",
    "review": "  What We Do in the Shadows was a fun surprise. A big LOL. The movie tells the daily routine, via documentary style, of 4/5 vampires in the modern day New Zealand... but tells it in a \"honest\" way. A very honest way. The movie is very original and because of that it's super smart funny.The Good: super original with very clever jokes. I've never seen anything like it.The Bad: because of the \"doc style\" it can be a little dragged sometimes, albeit boring for some viewers.The Ugly: how the hell the camera man survived the werewolves attack?! big lol",
    "rating": "35",
    "date": "July 20, 2015"
  },
  {
    "reviewer": "Julia J",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/936139602/",
    "review": "  Surprisingly clever and funny. I thought I would never want to see another vampire movie but this was an excellent exception.",
    "rating": "50",
    "date": "September 14, 2015"
  },
  {
    "reviewer": "Julius Grusas",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/968762959/",
    "review": "  What We Do in the Shadows starts Jemaine Clement Taika Waititi Jonathan Brugh Rhys Darby and Ben Fransham and is directed by Jemaine Clement and Taika Waititi. What We Do in the Shadows so far since 2015-07-25 My absolutely favorite movie of 2015. I love comedy movies and what good comedy movies do they make you laugh oh boy What We Do in the Shadows MADE ME LAUGH. My stomach hurt so bad after i watched this movie there were parts where i cried laughing. The best part of this movie is that laughter is consistent there never any slow parts and no draggy parts. this movie is comedy gold everyone who hates twilight and loves comedy should absolutely see this movie.Because it has so much hart and realism.",
    "rating": "50",
    "date": "July 27, 2015"
  },
  {
    "reviewer": "Mark D",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/880738336/",
    "review": "  This was fun. A vampire documentary. Who knew something like this could be so funny? Funny in a disturbing kind of way, sometimes, considering we're dealing with blood-sucking vampires. It's basically a classic \"fish out of water\" scenario, but with vampires. If you're any kind of horror movie fan, you'd probably like this.",
    "rating": "35",
    "date": "September 14, 2015"
  },
  {
    "reviewer": "Private U",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/801367462/",
    "review": "  Like \"Only Lovers Left Alive\", but in a totally different mood - the comedy - this movie is a new look at the mythology of the vampires . The idea of monsters as flatmate was already well pictured in the british tv series \"Being Human\", but the similarites end here: indeed, \"What we do in the shadows\" put together the typical clich�es of vampires and set them on a flat with all the classic issues of a cohabitation, those for daily management of an apartment - washing the dishing, cleaning the house, take the garbage outside - but also the fights which come from the union of people that actually comes from different historical ages, not to mention all the problems related to a vampire status in the contemporary age. I found it lovely directed and acted, a very nice story, for vampire lovers and not.",
    "rating": "40",
    "date": "September 13, 2015"
  },
  {
    "reviewer": "Jamie C.",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/971575739/",
    "review": "  What can I say, it made me laugh! They did a fabulous job of poking fun at literally every Dracula movie ever made. It was hokey, fresh and absolutely hilarious.",
    "rating": "40",
    "date": "September 12, 2015"
  },
  {
    "reviewer": "Eli G",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/971536622/",
    "review": "  Weak characters, clich� without real substance, laugh 3-4 time in the whole movie, lost my time",
    "rating": "10",
    "date": "September 8, 2015"
  },
  {
    "reviewer": "Ian H",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/782451172/",
    "review": "  A bit of a mess storytelling and structure wise, but that's not the point. The point is that this is a laugh until you are crying, laugh until you have injured your knee from slapping it so hard, laugh so hard you have to pause the movie so you don't miss the next brilliant send up to Vampirism kind of movie.",
    "rating": "40",
    "date": "September 8, 2015"
  },
  {
    "reviewer": "Ted W",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/836006933/",
    "review": "  Wonderful \"Real World\" style faux doc about vampires in new Zealand. The opening house meeting sets the tone for very funny goings on.",
    "rating": "40",
    "date": "September 8, 2015"
  },
  {
    "reviewer": "Andrew Z",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/314182855/",
    "review": "  I didn't think it was possible, but there is a funnier vampire movie than Twilight.",
    "rating": "45",
    "date": "September 7, 2015"
  },
  {
    "reviewer": "Vitor S",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/952306217/",
    "review": "  Que isso, muito engra�ado!!",
    "rating": "50",
    "date": "September 5, 2015"
  },
  {
    "reviewer": "Deborah M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/879266432/",
    "review": "  Exceptional paranormal comedy! Hilarity, with bursts of drama and pathos. Solid performances by all and pleasing enough to watch again.",
    "rating": "40",
    "date": "September 4, 2015"
  },
  {
    "reviewer": "Riley A",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/844566243/",
    "review": "  This film is one of the most clever comedy's i've ever seen. There is so many different play on stereotypical vampire jokes that are used, but are used so well..its just uh..it's just great. If this film does not become a cult classic..i have lost faith in film 8.5/10..Update 9.5/10 I can't help it.. i watched it again...i can't stop quoting the damn film..3rd favorite film this year",
    "rating": "50",
    "date": "February 22, 2015"
  },
  {
    "reviewer": "Greg D",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/784304046/",
    "review": "  The mockumentary style fits perfectly here as the vampire has become somewhat of a monster to mock in modern times.",
    "rating": "40",
    "date": "September 3, 2015"
  },
  {
    "reviewer": "Andy C",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/783048841/",
    "review": "  Always nice when a good idea isn't wasted.",
    "rating": "35",
    "date": "September 2, 2015"
  },
  {
    "reviewer": "Alyssa A",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/784417835/",
    "review": "  One of my absolute favorite movies now. You'll be laughing the whole way through. I really hope they continue this series with a spinoff on some of the other characters you meet throughout it.",
    "rating": "50",
    "date": "September 2, 2015"
  },
  {
    "reviewer": "Dany L",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/908062309/",
    "review": "  One of the funniest movies Ive seen this year. Take Best in Show and shake with Flight of the Conchords and youve got a very clever conceit.",
    "rating": "40",
    "date": "September 1, 2015"
  },
  {
    "reviewer": "Dominik A",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/927355907/",
    "review": "  I apologise for the following pun: This film is absolutely fang-tastic! (Again I'm very sorry for this)",
    "rating": "45",
    "date": "August 31, 2015"
  }
,
  {
    "reviewer": "Andrew K",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/879975293/",
    "review": "  One of the funniest movies I've seen in years, What We Do in the Shadows is a clever take on the much recently maligned vampire genre.",
    "rating": "45",
    "date": "August 30, 2015"
  },
  {
    "reviewer": "Leigh T.",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/971432556/",
    "review": "  I watched it, talked about how good it was for a few hour, then watched it again. Perfect. Amazing soundtrack also. And costume design... and casting...",
    "rating": "50",
    "date": "August 30, 2015"
  },
  {
    "reviewer": "Kate W",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/938447680/",
    "review": "  I thought this was incredibly boring. The acting was horrible, the direction was horrible, the script was horrible. Can't for the life of me figure out what was supposed to be so hilarious.",
    "rating": "10",
    "date": "August 29, 2015"
  },
  {
    "reviewer": "Matthew Francis L",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/913783412/",
    "review": "  funny, clever and about twenty minutes too long.",
    "rating": "40",
    "date": "August 29, 2015"
  },
  {
    "reviewer": "Audie E",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/916888550/",
    "review": "  Taika Waititi & Jemaine Clement wrote and star in a mockumentary about vampires...need I say more?! This is one of the best comedies I have seen in a long time - such a refreshing departure from the usual junk (seriously w/ movies like Paul Blart, it's slim pickings out there). What We Do In The Shadows is smart, clever, and a surprisingly graphic monster flick without a dull moment. This one is not to be missed!",
    "rating": "45",
    "date": "August 28, 2015"
  },
  {
    "reviewer": "Sebastien D",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/909777793/",
    "review": "  C'est bon. Mais pas un film pour tout le monde",
    "rating": "35",
    "date": "August 25, 2015"
  },
  {
    "reviewer": "Siddharth B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/902699841/",
    "review": "  A smart and hilarious mockumentary, Highly recommended for people enjoying this genre",
    "rating": "45",
    "date": "August 25, 2015"
  },
  {
    "reviewer": "Maarten D",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/929076131/",
    "review": "  Nepdocumentaire (een \"mockumentary\") over vier vampieren die een huis delen. 't Is een beetje een gimmick, maar de film duurt niet te lang en ik heb meerdere keren luidop gelachen. Heel leuk.",
    "rating": "35",
    "date": "August 24, 2015"
  },
  {
    "reviewer": "Josh A",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/781792242/",
    "review": "  Let's just say it's the best vampire mockumentary ever",
    "rating": "40",
    "date": "August 23, 2015"
  },
  {
    "reviewer": "Donata K",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/877994400/",
    "review": "  Just one word - hilarious!!!",
    "rating": "50",
    "date": "August 21, 2015"
  },
  {
    "reviewer": "slyhuckster",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/971211506/",
    "review": "  Very funny and so clever!",
    "rating": "35",
    "date": "August 21, 2015"
  },
  {
    "reviewer": "Oren A",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/813870760/",
    "review": "  Vampires and werewolves meet \"the office\" ;)",
    "rating": "40",
    "date": "August 21, 2015"
  },
  {
    "reviewer": "JV T",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/792727162/",
    "review": "  This is the funniest comedy I've watched in 2015 so far! The creators of Flight of the Conchords brilliantly mine the vampire genre and come up with some truly hilarious scenes. The script is ably supported by good comedic acting and decent special effects (considering this is a fairly low budget, that's impressive).",
    "rating": "45",
    "date": "August 20, 2015"
  },
  {
    "reviewer": "Mark V",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/927934200/",
    "review": "  What the hell is with these reviews? You would think this is the funniest movie ever made... yet aside from the merest of smiles, perhaps two or three, it's one of the blandest and desperate attempts at comedy I have ever witnessed.",
    "rating": "10",
    "date": "August 20, 2015"
  },
  {
    "reviewer": "Natalie D",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/971113329/",
    "review": "  Stop reading reviews and go watch this immediately! Literally the number 1 funniest movie I have ever seen. I have seen it five times in the past month, and I never repeat watch movies. It is the only movie I have bothered recommending to people in years. It is so good that I paused mid-movie to text my friends to watch it asap. Seriously, watch it right now!",
    "rating": "50",
    "date": "August 19, 2015"
  },
  {
    "reviewer": "Daniel C",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/792413711/",
    "review": "  A story looking at vampires trying to live in the modern world.Taking place in New Zealand, this film follows Viago, Deacon and Vladislav - three vampires trying to live normal lives, aside from their immortality and thirst for human blood. Their lives change when a young man named Nick is turned in to a vampire by their 8000 year old housemate.This is a hilarious story which should be expected considering Jemaine Clement is involved. The day-to-day struggles of the three main vampires is covered here from sourcing 'food' for themselves, their living arrangements, night life antics and run-ins with werewolves and amongst themselves make for interesting and funny moments and situations. Recommended for the laughs :)",
    "rating": "35",
    "date": "August 19, 2015"
  },
  {
    "reviewer": "Rob W",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/798894014/",
    "review": "  Knew in the first 5 minutes that I was watching a movie that would be an instant favorite and by the time it was over I'd already texted many friends to tell them they needed to watch it. I've watched it again with friends and we laughed the whole way through. This one is an instant classic.",
    "rating": "50",
    "date": "August 19, 2015"
  },
  {
    "reviewer": "Peter E",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/909821717/",
    "review": "  One part Only Lovers Left Alive, one part Flight of the Conchords...\"We are the bait, but we are also the trap.\"",
    "rating": "45",
    "date": "August 18, 2015"
  },
  {
    "reviewer": "Kirill K",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/785875346/",
    "review": "  Really is a special movie, very much in the same vein, and I expect to also become, a cult classic like This is Spinal Tap.",
    "rating": "50",
    "date": "August 18, 2015"
  }
,
  {
    "reviewer": "nipp str",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/970785880/",
    "review": "  Was it great? No. Was it good? Yeah, man it was good. It was like watching an episode of Big Brother with vampires, So I simultaneously wanted to laugh my ass off and shoot myself. MAYBE if they hadn't been roommates it would have felt more like a mockumentary than b-roll from a discarded reality show. The movie itself is funny, charming, witty, & smart so it has three things going for it my last girlfriend didn't and serial killers can be charming so kudos to that bitch. Back to my point then, good movie, not great, but definitely good!",
    "rating": "30",
    "date": "August 17, 2015"
  },
  {
    "reviewer": "RetroVold",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/971166574/",
    "review": "  I don't quite understand the rating. I love the idea and characters but I completely miss dynamic in this movie and to in half of it I was quite bored.",
    "rating": "25",
    "date": "August 17, 2015"
  },
  {
    "reviewer": "Theresa B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/971281659/",
    "review": "  If Drop Dead Gorgeous or Best In Show was about vampires, it would be this film. Hilarious!",
    "rating": "45",
    "date": "August 16, 2015"
  },
  {
    "reviewer": "Joe M.",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/970322186/",
    "review": "  Humorous, but not hilarious. I wouldn't run out to pay money for it - wait for it to come out on Netflix or elsewhere.",
    "rating": "25",
    "date": "August 16, 2015"
  },
  {
    "reviewer": "Hamee",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/788251317/",
    "review": "  I will not be watching this one.",
    "rating": "ni",
    "date": "August 16, 2015"
  },
  {
    "reviewer": "Lee M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/791471625/",
    "review": "  The New Zealand-made art comedy What We Do in the Shadows is a bracing reminder of how the right burst of energy and style breathes fresh ideas into a genre threatened with creative exhaustion.",
    "rating": "40",
    "date": "October 5, 2014"
  },
  {
    "reviewer": "Jason C",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/915936926/",
    "review": "  It is pretty damn funny, from the subtle little lines and scenery to the out right in your face shtick. It all works really well as the whole cast is perfectly deadpan and dry. It also has very well done effects that aren't overused and will take you by surprise. Kinda like \"Spinal Tap\" for the undead. Ha!",
    "rating": "35",
    "date": "August 15, 2015"
  },
  {
    "reviewer": "Alex W",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/886931965/",
    "review": "  A great example of using a concept to its full potential. Its got a good amount of British humor unsurprisingly similar to \"flight of the Concords\" tv show. This small comedy seems to have come out of nowhere and be the best of the year so far.",
    "rating": "40",
    "date": "August 14, 2015"
  },
  {
    "reviewer": "Andrew E",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/871060658/",
    "review": "  Going through the indies at the local Redbox, 'What We Do In The Shadows' is one of the best films of the year. Funny with a well-thought out story and the right kind of vampires, the film is just what this Twilight-era (Yuck!) needs.",
    "rating": "50",
    "date": "August 13, 2015"
  },
  {
    "reviewer": "Alberto R",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/814248966/",
    "review": "  A super witty, smart, satirical comedy about Vampire Life, generation gaps and coexistence. A very fun watch.",
    "rating": "35",
    "date": "August 13, 2015"
  },
  {
    "reviewer": "Lauren S",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/788689639/",
    "review": "  This was everything I was hoping it would be! Fantastic performances from all of the actors and so many laugh out loud moments. There needs to be more horror/comedy films out there like this one!",
    "rating": "50",
    "date": "August 11, 2015"
  },
  {
    "reviewer": "Tibor P",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/915878878/",
    "review": "  Szerintem egykoron a brit birodalom �sszes h�ly�j�t �sszefogdost�k �s Ausztr�li�ba vitt�k, akiket az ausztr�l h�ly�k sem b�rtak c�rn�val, azokat �j-Z�landra k�lt�ztett�k. Ez a fekete kom�dia onnan �rkezett. Dokumentum val�s�gshow, n�gy, k�z�s lak�sban �l? v�mp�r h�tk�znapjair�l. M�r az alap�tlet is pazar, de ahogy a v�mp�rkultusz minden dogm�j�t kiparodiz�lj�k az zseni�lis. Amikor a szombatesti bevet�sre k�sz�lnek, �s nem tudj�k mit vegyenek fel, mert nem tudj�k megn�zni a t�k�rben, �s v�g�l amikor nagy nehezen elk�sz�lnek nem tudnak bemenni a diszk�ba, mert a beenged? ember nem hajland� beh�vni ?ket, konkr�tan vis�tva r�h�gtem. Mindenkinek aj�nlom, aki szereti az elvetem�lt humort.",
    "rating": "45",
    "date": "August 11, 2015"
  },
  {
    "reviewer": "Cade H",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/783012928/",
    "review": "  What We Do In The Shadows is an excellent comedic take on the vampire genre. It focuses on (documentary style) a group of vampires living in a house together in modern times. It was hilarious to see their normal interactions while out at night and how they would go about getting people to bring home and \"suck their blood\". It pretty much took regular situations that a group of guys living together would be in but put a vampire spin on it. There were some great moments that had me rolling over laughing and also many missed laughs that didn't quiet hit the mark. All of the characters were charming and fun to watch on screen and they each had their own personality that stood out. This one won't appeal to everyone as the comedy presented can be a bit dry and the documentary style might not suit everyones liking. I thoroughly enjoyed this film and would have really enjoyed if it were an hour or so longer.",
    "rating": "40",
    "date": "August 10, 2015"
  },
  {
    "reviewer": "Richard S",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/789641593/",
    "review": "  \"Remember guys, we're werewolves, not swear wolves!\". This wasn't quite as funny as I was expecting but it did have some great one liners in it! Brilliant set up for a movie as a documentary crew follow a flatshare of vampires through such testing times as enforcing a dish washing rota and not staining the sofa while drinking human blood. The stand off with the werewolves was one of the highlights. I felt it lost something midway through but still worth sticking around until the end.",
    "rating": "30",
    "date": "August 9, 2015"
  },
  {
    "reviewer": "Aman A",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/784404466/",
    "review": "  Refreshingly different to an \"age-old\" genre, it was a concept that was unmissable. Enjoyed the movie, laughed out loud at times, but also got bored. Got tired of the concept. Humor could have been kept up, but it was a great effort nonetheless. The problem is that it is a concept that cannot be repeated so we might never see a better version of this movie. :(",
    "rating": "35",
    "date": "August 8, 2015"
  },
  {
    "reviewer": "Joshua L",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/797084410/",
    "review": "  The last bit of the movie kinda drags the rest of the movie down but everything before that point is a lot of fun. Funny movie!",
    "rating": "30",
    "date": "August 8, 2015"
  },
  {
    "reviewer": "Nathan C",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/850866162/",
    "review": "  I was reluctant to watch this movie but I always check reviews on Rotten and IMDB (Personally I think IMDB takes kickbacks) and when I saw 5 starts on Rotten I knew it had to be good. Ive since watched this flick 4 times since monday and its now Friday. Plain and simple review ITS HILARIOUS and I hate stupid funny movies. This is a stupid funny movie and I was rolling. Watch it. Watch it now. You will remember it on your death bed",
    "rating": "50",
    "date": "August 7, 2015"
  },
  {
    "reviewer": "hollyeustice",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/967640460/",
    "review": "  Very funny movie. Loved the different characters because they were so different. Good story line as well. A must see!",
    "rating": "45",
    "date": "July 5, 2015"
  },
  {
    "reviewer": "Ignasi M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/837141747/",
    "review": "  Hilariously fun and charming from start to finish. Also, Stu.",
    "rating": "50",
    "date": "February 10, 2015"
  }
,
  {
    "reviewer": "Jack P",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/953302071/",
    "review": "  Crying with laughter. My perfect style of comedy.",
    "rating": "45",
    "date": "August 6, 2015"
  },
  {
    "reviewer": "Michael M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/781717778/",
    "review": "  A darkly funny mockumentary.",
    "rating": "40",
    "date": "August 5, 2015"
  },
  {
    "reviewer": "Brandon O",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/906900252/",
    "review": "  This was just to darn funny. A Mocumentary for all who enjoy a good Vampire tale. From the creators of Flight of the Concords, come \"What We Do In The Shadows\" Worth a million laughs this one is. 5stars!!!",
    "rating": "50",
    "date": "August 5, 2015"
  },
  {
    "reviewer": "Ben P",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/848647329/",
    "review": "  One of the funniest movies I have seen in a very, very long time.",
    "rating": "50",
    "date": "April 2, 2015"
  },
  {
    "reviewer": "Katie B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/892889554/",
    "review": "  i saw the preview and knew there wasn't any way i would not like this movie.",
    "rating": "40",
    "date": "August 4, 2015"
  },
  {
    "reviewer": "Pierre K",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/785433019/",
    "review": "  If you need to watch a mockumentary this is the one. It is funny, at time hilarious and enjoyable!What We do In The Shadows is the best vampire movie in a long time and a great slice of film making.You should watch it!",
    "rating": "40",
    "date": "May 12, 2015"
  },
  {
    "reviewer": "mikemouse004",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/965476218/",
    "review": "  Funny Movie with Jemaine Clement and VampiresI'm Gonna Give What we Do In The Shadows a C",
    "rating": "40",
    "date": "August 3, 2015"
  },
  {
    "reviewer": "Mayukh B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/922487331/",
    "review": "  The best vampire film ever.",
    "rating": "50",
    "date": "August 3, 2015"
  },
  {
    "reviewer": "Joe W",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/899290153/",
    "review": "  More comedy then horror but it's still a great and pretty hilarious movie.",
    "rating": "40",
    "date": "August 2, 2015"
  },
  {
    "reviewer": "Georgi Kalenderov",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/970804428/",
    "review": "  Just great and really funny!",
    "rating": "50",
    "date": "August 2, 2015"
  },
  {
    "reviewer": "Kyle B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/891925965/",
    "review": "  This movie is 3 years too late to the party and a lot of the jokes are tired and overdone from other vampire movies but there is enough original content that is quirky fun and the overall mood of the film is amusing. The second half of the movie is stronger than the first and I'm sure if you are a Flight of the Conchords fan you'll enjoy these guys' humor but it isn't for everyone.",
    "rating": "40",
    "date": "August 2, 2015"
  },
  {
    "reviewer": "Connor B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/918548599/",
    "review": "  Who knew that \"New Zealand Fake Vampire Documentary\" would be an actual movie, much less one that would become one of the funniest comedies I've seen this year? The entire cast is a blast playing these goofy vampire roles, the fake documentary format works perfectly for the clever and bizarre jokes, and the movie goes along at a fast enough pace that it's an extremely easy and fun thing to watch.",
    "rating": "50",
    "date": "August 1, 2015"
  },
  {
    "reviewer": "Juliano K",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/835390259/",
    "review": "  I love vampires even more now!! a must see movie",
    "rating": "50",
    "date": "August 1, 2015"
  },
  {
    "reviewer": "Mike L",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/872529159/",
    "review": "  Funniest movie I've seen in a while.",
    "rating": "50",
    "date": "March 2, 2015"
  },
  {
    "reviewer": "Rodney B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/841869492/",
    "review": "  This movie is horrible! The only people who may find this movie a lil entertaining would be the British and they're not popular their sense of humor. The only funny British film ever was Shaun of the Dead. If you want to throw your $ away go buy a Kenny G cd you'll get more enjoyment from it.",
    "rating": "05",
    "date": "August 1, 2015"
  },
  {
    "reviewer": "John Serrano",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/906694391/",
    "review": "  An absolutely pure blend of comedy and horror, What We Do in the Shadows is a unique gem that finds comedy in the reality of a fantastical underworld hidden under the noses of unknowing New Zealand. The result is an endlessly entertaining band of characters getting into deliciously absurd situations and a good dirty ol' time that you hope never ends.",
    "rating": "50",
    "date": "July 31, 2015"
  },
  {
    "reviewer": "Bevan C",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/796216015/",
    "review": "  Pretty much one of the funniest movies I've seen in a long time, What We Do In The Shadows is a hilarious mockumentary (think The Office meets The Lost Boys) that touches on the lives of four vampires living in modern New Zealand as a camera crew follows them around the city.There is a lot to enjoy about this film: the practical monster effects, the special effects, the fight scenes (especially a clever one involving a rotating room), the actors in their parts as the vampires, and the whole over-played vampire genre being skewered with great success (Nick eating a chip has to be one of the funniest gags in the film).HOWEVER, THERE IS A WORD OF WARNING: this movie has some dark humor in it with a tinge of violence and quite a few death scenes. If blood and (some) gore are not your thing, then I'd warn you to stay away. The rest of you will have a bloody (pun intended) good time.PROS: The dark humor and characters; Cool practical effects mixed with some good cgi; Great nods to some of the old-school vampire films and supernatural lore; WWDITS was great in length, dialogue, plot, pacing, and acting. CONS: Seriously, I can't readily think of one.",
    "rating": "50",
    "date": "July 31, 2015"
  },
  {
    "reviewer": "Margriet S",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/911514845/",
    "review": "  All those raving critics. Bah, humbug! Did all those doting scribents forget 'Fearless Vampire Killers' (1967) ? Or even see it ? (nor did probably the Waititis and the Clementses among us...)",
    "date": "July 30, 2015"
  },
  {
    "reviewer": "Hiang M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/826116549/",
    "review": "  Excelente. Una s�tira al mundo de los chupasangre mezclado con los docureality, una muestra que no se necesita tanto presupuesto para hacer algo bueno",
    "rating": "40",
    "date": "July 27, 2015"
  }
,
  {
    "reviewer": "Jayden R",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/906514709/",
    "review": "  hilarious and unique",
    "rating": "45",
    "date": "July 26, 2015"
  },
  {
    "reviewer": "Ramiro G",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/962205959/",
    "review": "  This hilarious mockumentary is probably the best vampire movie to come out in years. Full of likable characters, great gags and homages to the genre.",
    "rating": "40",
    "date": "July 25, 2015"
  },
  {
    "reviewer": "Fred B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/899036280/",
    "review": "  I saw it months ago and am still giggling.",
    "rating": "40",
    "date": "March 22, 2015"
  },
  {
    "reviewer": "Grant S",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/793894576/",
    "review": "  Brilliant, hilarious, original comedy.A documentary team films the lives of a group of vampires for a few months. The vampires share a house in Wellington, New Zealand. Turns out vampires have their own domestic problems too...Incredibly original, and very funny. Co-written and co-directed by Jemaine Clement of Flight of the Concords fame, it features understated humour, sharp dialogue and clever skits, similar to Flight of the Concords.While the budget was obviously fairly low, the cheapish production values don't detract from the quality of the movie. If anything, they enhance the movie, as the directors can't rely on fancy CGI but instead have to rely on clever plot and dialogue. It also makes the movie feel much more \"real\".Solid performances all round from a cast whose only known names are Jemaine Clement and Rhys Darby (also of Flight of the Concords fame. Where was Bret McKenzie?).Probably the best vampire movie you'll ever see.",
    "rating": "45",
    "date": "July 25, 2015"
  },
  {
    "reviewer": "Kirk A",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/907199576/",
    "review": "  Just saw this. Actually quite funny and refreshing!",
    "rating": "40",
    "date": "July 25, 2015"
  },
  {
    "reviewer": "Christian C",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/926317724/",
    "review": "  A supremely funny reawakening of the mockumentary genre -- with teeth. This sanguinary tale is very clever and surprising. Highly recommended.",
    "rating": "50",
    "date": "July 25, 2015"
  },
  {
    "reviewer": "2natures",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/185227722/",
    "review": "  Maybe I expected too much from all the ranting and raving.",
    "rating": "25",
    "date": "July 24, 2015"
  },
  {
    "reviewer": "Carl T",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/960639767/",
    "review": "  Brilliant and funny, this is my second favorite Vampire story and my new Halloween movie!",
    "rating": "50",
    "date": "July 24, 2015"
  },
  {
    "reviewer": "Ken L",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/885114423/",
    "review": "  Started out great, but then kinda fizzled. would have been better as a 30-minute episode.",
    "rating": "35",
    "date": "July 24, 2015"
  },
  {
    "reviewer": "Miku P",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/794955891/",
    "review": "  Paras vampyyrielokuva ikin�!",
    "rating": "50",
    "date": "July 24, 2015"
  },
  {
    "reviewer": "Edmund P",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/788502108/",
    "review": "  Deacon: \"I think we drink virgin blood because it sounds cool.\"Vladislav: \"I think of it like this. If you are going to eat a sandwich, you would just enjoy it more if you knew no one had fucked it.\"LOVED THIS MOVIE.",
    "rating": "45",
    "date": "July 24, 2015"
  },
  {
    "reviewer": "Craig G.",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/921476279/",
    "review": "  Straight into the waste basket. Complete waste of time. Not funny, crappy acting, crappy cinematography, not funny 90% of the time. I simply do not understand and do not agree with the high ratings.",
    "rating": "15",
    "date": "July 24, 2015"
  },
  {
    "reviewer": "Peter C",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/545822697/",
    "review": "  Um filme de vampiros pra quem n�o gosta de filmes de vampiros... divertido e cheio de refer�ncias, j� virou cult!",
    "rating": "45",
    "date": "July 23, 2015"
  },
  {
    "reviewer": "Jesse O",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/1202249/",
    "review": "  I don't really expect that I'd have much to say about this film other than it is pretty damn excellent. The thing is that I wouldn't actually know how to go into an in-depth review without spoiling some of the best bits in the entire movie. I'd most definitely make a shitty professional movie critic, as I'd have to review all types of films even if I cannot accurately describe the film without giving some of the best bits away. It's almost like the blurbs that appear in the poster, they all say the same thing. And that's really all you need, honestly, when it comes to this film. It lampoons, yet also pays great respect to, the vampire genre and all its tropes and silliness. I think the closest we can compare it to is, honestly, Young Frankenstein. Though I think the latter was definitely more a loving tribute to not just Frankenstein films but the entire Universal horror films from the 20s and 30s. Young Frankenstein is one of my favorite comedies of all time, so I don't make this comparison lightly. Stylistically, of course, they are two different films, but that's what I can compare it to if I had to. The film takes a look at these 4 roommates, vampires of course, and their difficulties in adjusting to the modern world and all its differences from the world they knew. One of the roommates accidentally, Petyr (or Nosferatu) turns a guy, Nick, into a vampire and so the roommates have to guide Nick through this transition whereas Nick helps them adjust to modern life. It sounds simple, but it definitely gets results. There's a lot of really funny visual gags, lines and exchanges that are simply too many to mention. It's a smartly written film on top of that and the cast is pretty damn great, top to bottom. With that said, I do think that the film, near its climax, just before the Unholy Masquerade, slows down a little bit. I don't wanna say that the film ran out of material, but it just slows down. It doesn't last long, of course, and it gets right back on track, but it is something that is definitely a negative in the film. Perhaps the only negative of the entire film to be honest. I'm trying to find out if there's anything else about the film that I disliked and I'm having a hard time coming up with one. I think that, unless I missed some other film, this might be the best comedy I've seen in 2015. It's really that great of a comedy. Very little to complain about and I highly recommend it.",
    "rating": "40",
    "date": "July 23, 2015"
  },
  {
    "reviewer": "Hannah R",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/885124378/",
    "review": "  Feels like it's adapted for international audiences, toning down the awkwardness. Not awkward enough to be truly funny for me",
    "rating": "20",
    "date": "March 21, 2015"
  },
  {
    "reviewer": "Wayne I",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/905473139/",
    "review": "  Fucking hilarious! :'D",
    "rating": "50",
    "date": "July 22, 2015"
  },
  {
    "reviewer": "Nathan M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/964164998/",
    "review": "  \"This is Spinal Tap\" but with vampires. Somehow it works, and works brilliantly.",
    "rating": "40",
    "date": "July 22, 2015"
  },
  {
    "reviewer": "John T",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/905367738/",
    "review": "  Greatest Vampire Documentary Ever!",
    "rating": "50",
    "date": "January 10, 2015"
  },
  {
    "reviewer": "Alec B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/790680964/",
    "review": "  Uses it's simple concept to great comedic effect and material alternates between a slacker roommate comedy and a spoof of the vampire genre quite easily.",
    "rating": "40",
    "date": "July 21, 2015"
  },
  {
    "reviewer": "Dylan K",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/907373094/",
    "review": "  this movie is pure brilliance i laughed so hard throughout the whole thing",
    "rating": "45",
    "date": "July 21, 2015"
  }
,
  {
    "reviewer": "ken karlson",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/901181363/",
    "review": "  Spinal Tap meets Dracula and the concoction is sheer delight. From the very first scene I knew I was in for some bloody good laughs. Great script, I don't know how they got through this with a straight face acting, and interspersed with understated special effects this mockumentary is a classic I will see again and again.",
    "rating": "50",
    "date": "July 21, 2015"
  },
  {
    "reviewer": "Carter Lee C",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/914628179/",
    "review": "  I couldn't breathe I was laughing so hard. I had to take a break.",
    "rating": "50",
    "date": "July 20, 2015"
  },
  {
    "reviewer": "Jimmy H",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/905408626/",
    "review": "  I liked this movie. It combines just the right amount of vampire stuff with some fun tongue-in-cheek humor. Or should I say teeth-in-neck. It's fun to watch, but not enough to buy. Rent, unless you have a vampire section in your home video library.",
    "rating": "40",
    "date": "July 20, 2015"
  },
  {
    "reviewer": "Dave A",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/794939567/",
    "review": "  While not what you would consider gutbustingly funny, this movie is DAMN good at accomplishing what it set out to do, and I laughed out loud a few good times. Everyone was cast for the right part as well, which you don't see so often these days.",
    "rating": "40",
    "date": "July 20, 2015"
  },
  {
    "reviewer": "LauraLives",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/964907389/",
    "review": "  Absolutely blood-suckingly hilarious, with fantastic New Zealand comedy and charm to boot - I developed abs whilst watching this!",
    "rating": "50",
    "date": "June 14, 2014"
  },
  {
    "reviewer": "Jamal F",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/951428872/",
    "review": "  It easy to make a found-footage film, easier to make a documentary, and even easier to make a mockumentary. On the other hand, it's extremely difficult to make a GOOD film, especially one like this. However, even with their low budget, the creators of this film combined every one of these categories, plus the additional comedy to make it fun. I'd say this movie has earned a seat in some top 10 found-footage lists. Bravo!",
    "rating": "50",
    "date": "March 8, 2015"
  },
  {
    "reviewer": "Marisha R",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/961824631/",
    "review": "  funny in a different way not over the top corny like i thought it was going to be i liked it lol",
    "rating": "40",
    "date": "July 16, 2015"
  },
  {
    "reviewer": "Carlos D",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/882724280/",
    "review": "  Creatively funny, this hilarious documentary is so well thought in his mythology that laughs simply burst out of every corner.",
    "rating": "30",
    "date": "July 15, 2015"
  },
  {
    "reviewer": "Pierluigi P",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/336592762/",
    "review": "  Ingenious faux documentary that plays with the myths and cliches of the vampire lore with hilarious results.",
    "rating": "40",
    "date": "July 13, 2015"
  },
  {
    "reviewer": "Blake P",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/909783806/",
    "review": "  I tend to gravitate toward the Zucker/Zucker mindset when it comes to comedy - as a kid raised on \"Airplane!\" and \"The Naked Gun\", there's nothing better than a series of sight and sound gags that have more to do with a randomly placed guffaw than sly plot pushing. So the dry comedy subgenre doesn't usually do it for me, unless we're talking \"Arrested Development\" or anything Christopher Guest related - then I'll completely zone out and bathe in the wonder of the straight-faced one-liner delivery. Because in some ways, a well-crafted, deliciously complicated scenario akin to something you'd find in a particularly good episode of \"The Office\" can be just as potent as a quick belly laugh a la \"Scary Movie\". Mockumentary \"What We Do in the Shadows\" has much more in common with \"Best in Show\" than it does with \"Young Frankenstein\", its lightly sarcastic demeanor interlacing with the fixtures of the macabre with comedic radiance. Such results would hardly be a possibility without Taika Waititi and Jemaine Clement (of \"Flight of the Conchords\" fame), who co-direct and co-write with such witty adeptness that the broad premise of the film never feels broad because the tones and textures of the movie itself convince and thoroughly delight. The \"We\" in the title refers to a group of vampires being followed around by a camera crew. Occupying the same bungalow (or to be more scientific, den) for years, we are introduced to Viago (Waititi), Vladislav (Clement), Deacon (Jonathan Brugh), and Petyr (Ben Fransham). Viago, aged 379, is the \"father\" of the house, demanding his roommates attend group meetings to discuss things like the kitchen sink problem (no one has washed the dishes for five years), while he, in the meantime, mopes around about his long-lost love; Vladislav, at 800, used to be a hypnotic sexual demon in the same vein as Dracula, but has since lost his magic touch; Deacon is the young, wild one of the group (he's a spry 183) who first got his immortal kicks as a Nazi vampire, while the ancient Petyr (8,000) intimidates everyone as the household's Nosferatu. We also meet Jackie (Jackie Van Beek), the group's human servant who hopes her handiwork will lead to her turning, and Nick (Cori Gonzalez-Macuer), a twenty-something who was supposed to be a meal but ends up becoming a member of the household after Petyr inadvertently transforms him. I can write as much as I want about \"What We Do in the Shadows\", but never will I be able to capture the rhythm, the attitude, the genius of its humor. The ensemble is made up of skilled comedic performers, and the writing is endlessly clever (we can start with the vampirical hatred of the local werewolf pack or the annual get-together the undead throw to celebrate their undeadness, for starters). I found myself as quick to laugh as I was ready to sit in awe regarding the successful audacity of everyone involved. No one, no one, would decide that the best subjects of a mockumentary would be a group of self-serious vampires, and yet here we have one, a hilarious gem, no less, as sharp as the wooden stakes the focuses of the film so greatly fear. Clement and Waititi have outdone themselves. A find.",
    "rating": "40",
    "date": "July 13, 2015"
  },
  {
    "reviewer": "John K",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/905617862/",
    "review": "  As a parody on vampire (and other fantasy tropes) this film is effective and quite funny, using situational humor to allow us to laugh at the ridiculousness. The movie is ultimately a bit flighty and directionless, but a relatively short run-time keeps things from going too off-track.",
    "rating": "35",
    "date": "July 12, 2015"
  },
  {
    "reviewer": "Jens S",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/209816720/",
    "review": "  Hilarious mockumentary about a couple of vampires of all eras living together in modern New Zealand. Full of really funny stabs at the genre conventions of Vampire and found footage films. Thankfully, the humor, much like the characters, has a lot of heart underneath a couple of pretty bloody throat bites. One of the funniest films of recent years.",
    "rating": "40",
    "date": "July 12, 2015"
  },
  {
    "reviewer": "Jin Pin J",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/906678935/",
    "review": "  So creative and lots of fun in What We Do In The Shadows!I'm a vampire fan. When I watched this New Zealand comedy, I was so entertained that I could not help myself but only laugh out loud.Very loudly!!!!!This brilliant comedy contains a lot of surprise and humor. I'm very sure that it is the best comedy this year.",
    "rating": "50",
    "date": "December 31, 2014"
  },
  {
    "reviewer": "Chris H",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/872494051/",
    "review": "  I finally saw this movie and it is a funny bloody laugh out loud film. Probably the best horror comedy since Zombieland and the best vampire flick since Let The Right One In. This is a mockumentary film on how vampires live there life. I definitely recommend this film who love horror movies or just vampires.",
    "rating": "40",
    "date": "July 9, 2015"
  },
  {
    "reviewer": "Patrick H",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/970776918/",
    "review": "  One of the funniest and original movies I have seen in years.",
    "rating": "50",
    "date": "July 7, 2015"
  },
  {
    "reviewer": "Kate H",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/66605826/",
    "review": "  From the creators of 'Flight of the Conchords' comes a 'documentary' about a group of vampire housemates living in a suburb of Wellington New Zealand. You've got standard housemate problems while at the same time more practical problems like getting victims, staying unnoticed, and other stuff. A special bit of trouble happens when a human victim ends up being turned into a vampire by the house's oldest resident.It's an offbeat type of humour (if you loved Flight of the Conchords you'll love this) and there even are a few moments that are even a little bit scary, but overall this is much more of a comedy than a horror film.",
    "rating": "35",
    "date": "July 5, 2015"
  },
  {
    "reviewer": "Freddie K",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/927118589/",
    "review": "  Nothing about this film feels wasted or lost. It feels like a realistic documentary, but the comedy is so well thought out, that it gives that slight awkwardness that makes it laugh out loud hilarious. Every character has a gimmick or trait that makes them likeable and it is a unique approach to horror comedies itself without poor puns and jump scares",
    "rating": "50",
    "date": "July 5, 2015"
  },
  {
    "reviewer": "Kara P",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/934342088/",
    "review": "  Loved every minute of it, so camp, so fresh, so humourous!! A GREAT accompaniment when faced with loads of ironing!",
    "date": "July 3, 2015"
  },
  {
    "reviewer": "Eduardo S",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/802158520/",
    "review": "  muy muy buena! original y ocurrente. Una gran sorpresa",
    "rating": "45",
    "date": "July 2, 2015"
  },
  {
    "reviewer": "Dane M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/791223426/",
    "review": "  I watched a lot of this film with an open mouth - gaping and afraid to laugh for fear of missing something. Really very funny in parts. Unusual and quirky this is the antidote for bad horror spoofs. One of the best films of this year, it's a documentary with a bloody sick heart.",
    "rating": "40",
    "date": "July 1, 2015"
  }
,
  {
    "reviewer": "Matt H",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/897795408/",
    "review": "  Pretty hilarious, some great sequences and ideas. Great low budget filmmaking.",
    "rating": "35",
    "date": "July 1, 2015"
  },
  {
    "reviewer": "Jean Paul L",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/908374189/",
    "review": "  Very funny movie. A totally fresh spin on vampire movies!",
    "rating": "35",
    "date": "March 22, 2015"
  },
  {
    "reviewer": "Mike L",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/808220488/",
    "review": "  It's crazy that movies like Paul Blart continue to get wide release (which apparently nobody on the planet actually liked) when such a well-loved little gem can't get a release beyond indy-friendly cinemas. Funny stuff; you'll smile for about 90 minutes straight. Watch out for \"The Beast.\" ;)",
    "rating": "40",
    "date": "June 28, 2015"
  },
  {
    "reviewer": "Jesse K",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/903568670/",
    "review": "  Pushing a brilliant concept to its full potential, What We Do In The Shadows utilizes all documentary/vampire cliches and creates something absolutely hilarious.",
    "rating": "45",
    "date": "June 27, 2015"
  },
  {
    "reviewer": "Elizabeth H",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/782403467/",
    "review": "  Vampires are boring, unless they're these ones.",
    "rating": "40",
    "date": "June 24, 2015"
  },
  {
    "reviewer": "Mikey S.",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/970621380/",
    "review": "  I've never seen a movie that made me laugh more than What We Do in the Shadows. Anyone who is a fan of Clement's show, Flight of the Conchords, will not be let down as his weird and silly humor shows in this mockumentary. Can't wait to watch this movie in the near future as I'll definitely recommend it to all friends and family!",
    "rating": "50",
    "date": "June 24, 2015"
  },
  {
    "reviewer": "David R",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/875990010/",
    "review": "  completely and utterly silly. very funny.",
    "rating": "40",
    "date": "December 6, 2014"
  },
  {
    "reviewer": "Graham M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/863939794/",
    "review": "  Not especially funny but light-hearted and enjoyable undead shenanigans.",
    "rating": "30",
    "date": "June 22, 2015"
  },
  {
    "reviewer": "Logan D. M.",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/970115043/",
    "review": "  The most original and funny mockumentary made in years, it's an instantly memorable comedy treat.",
    "rating": "45",
    "date": "June 20, 2015"
  },
  {
    "reviewer": "Megan M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/910015493/",
    "review": "  We have loved almost everyone in this cast for years and they did not disappoint. Witty and snarky . . . . more like a mockumentary about roommates that happen to be vampires.",
    "rating": "50",
    "date": "June 17, 2015"
  },
  {
    "reviewer": "Vanda K",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/832330490/",
    "review": "  Too absurd to not find it absolutely hilarious :D",
    "rating": "50",
    "date": "April 20, 2015"
  },
  {
    "reviewer": "Lance F",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/911042460/",
    "review": "  Wish I could somehow convince everyone to see this movie. A hilarious parody of modern society told by vampires ostensibly through an episode of 'Intervention' or 'The Real World' complete with camera men following them around who are promised not to be eaten, until they end up at a party, and then, well, perhaps one could be eaten. Takes jabs at everything from twenty-something slackers to the gay community. Brilliant writing and comedic delivery.",
    "rating": "45",
    "date": "March 7, 2015"
  },
  {
    "reviewer": "Sam P",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/920113850/",
    "review": "  Funny and intelligent comedy with silly characters....",
    "rating": "50",
    "date": "June 15, 2015"
  },
  {
    "reviewer": "Linus M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/911305726/",
    "review": "  Watch it. You will not regret it",
    "rating": "45",
    "date": "April 8, 2015"
  },
  {
    "reviewer": "Volare T",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/918224991/",
    "review": "  Full of dry humor and wit. Very worthy!",
    "rating": "40",
    "date": "June 13, 2015"
  },
  {
    "reviewer": "Evan K",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/870932310/",
    "review": "  I was almost clapping at the end, even though I was watching at home in my laptop. Hilarious from start to end. An absolute blast i its own silly way.",
    "rating": "50",
    "date": "June 12, 2015"
  },
  {
    "reviewer": "Michael H",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/800097310/",
    "review": "  Very enjoyable indie comedy that constantly throws up in spurts nice little effects and cgi touches that belie its low budget direct camera approach. The film is a perfect blend of wry and knowing silliness. Recommended.",
    "rating": "35",
    "date": "June 11, 2015"
  },
  {
    "reviewer": "Hendrick M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/790925959/",
    "review": "  A great farce on 'life as a vampire'. Great movie.",
    "rating": "40",
    "date": "June 3, 2015"
  },
  {
    "reviewer": "Matt G",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/906794753/",
    "review": "  Werewolves, vampires, zombies, and Conchord-style comedy? Yes, please. Strong, improv-heavy humor boosts this super-fun mockumentary send-up of horror mythos and tropes. Beautifully balancing both dry and broad humor side-by-side, WWDITS is extremely clever and lovingly-made.",
    "rating": "40",
    "date": "June 2, 2015"
  },
  {
    "reviewer": "Paul O",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/908723276/",
    "review": "  This is one of the most boring movies ive ever tried to watch",
    "rating": "05",
    "date": "June 1, 2015"
  }
,
  {
    "reviewer": "Tony C",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/787479563/",
    "review": "  Was hoping for a good movie, was treated to a great movie. Very clever and well crafted \"spoof\" or documentary.Loved this fillm.Loved it!",
    "rating": "50",
    "date": "May 30, 2015"
  },
  {
    "reviewer": "Paul O",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/804035476/",
    "review": "  Hilarious kiwi film genre-spoof mockumentary which is well cast and well written.",
    "rating": "40",
    "date": "May 29, 2014"
  },
  {
    "reviewer": "Anatoly S",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/784238567/",
    "review": "  A New Zealand mockumentary about vampires who share an apartment and also ONE OF THE FUNNIEST THINGS I'VE SEEN IN RECENT YEARS. Seriously, if you don't mind a bit of dark humor & blood in your comedy, SEE THIS IMMEDIATELY.",
    "rating": "50",
    "date": "May 28, 2015"
  },
  {
    "reviewer": "Eric L",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/785511798/",
    "review": "  Some brilliantly dumb bits of humor here.",
    "rating": "40",
    "date": "May 26, 2015"
  },
  {
    "reviewer": "Dov D",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/808011041/",
    "review": "  New Zealand comedy legends Taika Waititi and Jemaine Clement write, direct, and star What We Do In The Shadows, a mockumentary on par with something from legendary filmmaker Christopher Guest. Absolutely brilliant pacing paired with unrelentingly subtle comedic gold create a cult classic destined to go down as one of the best.",
    "rating": "45",
    "date": "May 24, 2015"
  },
  {
    "reviewer": "John C",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/905394603/",
    "review": "  A masterpiece simply doesn't do justice to this timeless, gut-bustingly funny mockumentary on modern vampires that blends the best elements of films like \"I Sell the Dead\", \"In The Loop\" and \"Alan Partridge\", Jemaine Clement has simply outdone himself.",
    "rating": "50",
    "date": "May 24, 2015"
  },
  {
    "reviewer": "Jamie I",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/875481026/",
    "review": "  A real human look at the lives of vampires. Loved it! Definitely recommended!",
    "rating": "50",
    "date": "January 28, 2015"
  },
  {
    "reviewer": "Cesar G",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/905602078/",
    "review": "  Funniest movie I have seen this year. Why cant every American film be this funny.",
    "rating": "50",
    "date": "May 21, 2015"
  },
  {
    "reviewer": "Russell C.",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/940747241/",
    "review": "  Exactly what I'd expect a reality show written by Christopher Guest and directed by Neill Blomkamp to be like. They even made their main vampire character exactly like Sharlto Copley in District 9. I'm sure White suburbanites find it as funny as the people who made it... but it lacks it's own style and delivery.",
    "rating": "05",
    "date": "May 19, 2015"
  },
  {
    "reviewer": "David H",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/887625043/",
    "review": "  You know, I enjoyed it.",
    "rating": "40",
    "date": "May 18, 2015"
  },
  {
    "reviewer": "Joan-of A",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/871834035/",
    "review": "  I was looking for a feel good film to watch before hitting the sack yesterday - so I decided to see this. Surprisingly good. XD You have a heart of stone if you didn't laugh all throughout the film :DHilarious indeed. :-)",
    "rating": "50",
    "date": "May 18, 2015"
  },
  {
    "reviewer": "ed m.",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/970163909/",
    "review": "  It's not often that critics and audiences agree, but it's hard not to with this one. Absolutely effing hilarious, just watch it. Maybe being a vampire isn't so cool after all?",
    "rating": "45",
    "date": "May 18, 2015"
  },
  {
    "reviewer": "Jordan J",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/852140613/",
    "review": "  Funniest movie I have seen in a long time.",
    "rating": "50",
    "date": "March 29, 2015"
  },
  {
    "reviewer": "Ben B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/884035366/",
    "review": "  For far too long has the vampire subgenre been given the darkly romantic treatment complete with questionable dialogue, gratuitous sex scenes, and bloodsuckers who all look a bit too similar to each other. Vampire spoofs have also been made a number of times, but none of them have sunk their teeth deep enough into the source material in order to turn these dark creatures into hilarious characters. Enter New Zealand's greatest talents since Peter Jackson: Taika Waititi and Jemaine Clement. The duo behind the comedy band Flight of the Conchords have created a genre masterpiece that puts the efforts of most professional filmmakers to shame. 'What We Do in the Shadows' is simultaneously one of the funniest genre spoofs in a long time, and one of the greatest vampire films to have graced the screen in years. Waititi and Clement, who also star as two of the mockumentary's bloodthirsty flatmates, waste not one second of their audience's time in delivering comedic gold. Unlike most genre spoofs, jokes and gags aren't enough for Waititi and Clement. Their clever ideas and neat spins on horror tropes give each laugh a sense of true originality. The best jokes happen throughout the film's first half, which brilliantly introduces the characters, sets up the world in which they live, and hilariously explains why vampires prefer virgin blood. As with most comedies, however, the film's narrative is a bit shaky. It falters just a bit towards the end, causing the jokes to become less frequent, but never unfunny. Beneath all the blood-drenched mischief, Waititi and Clement are sure to keep in touch with the emotional context of the characters. The joys of living forever and drinking human blood are explored in hilarious detail, but the sadness behind it all is never ignored, giving the film a fair and surprising amount of sentimentality. If the film's humor is icing on the cake, then its emotional heft is what Waititi and Clement sprinkle on top of it to make it look all the more delicious. The result is an unmissable feat in comedic filmmaking, uncommonly fun genre fare, and quite possibly the best horror comedy since 'Shaun of the Dead'.",
    "rating": "40",
    "date": "May 12, 2015"
  },
  {
    "reviewer": "Hiran C",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/970107091/",
    "review": "  Brilliant!!! I want to know more about this characters... this needs to be a series. Its a Must Watch!",
    "rating": "50",
    "date": "May 13, 2015"
  },
  {
    "reviewer": "Chris W",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/877628646/",
    "review": "  Easily the worst comedy ive seen all year... The critics were WAY off on this one. Didnt laugh a single time in the entire film. Simply put it's basically a series of awkward pauses and winks at the camera either because they intended to add a laugh track to the film or they just forgot to add a punchline.",
    "rating": "10",
    "date": "May 13, 2015"
  },
  {
    "reviewer": "Abdullah Y",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/807043860/",
    "review": "  What a funny wonderful film! Just hilarious with great jokes and wonderful acting. Not everyone will get The Office style humor, but it is really sweet, bloody, and smart. It is an instant classic!!",
    "rating": "45",
    "date": "May 13, 2015"
  },
  {
    "reviewer": "Phil S",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/783587151/",
    "review": "  One of the best films I've seen in a good while, do it :) Flippin hilarious!",
    "rating": "50",
    "date": "May 12, 2015"
  },
  {
    "reviewer": "Alan M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/906914280/",
    "review": "  What We Do in the Shadows is great if you love vampire films and even better if you don't. The mocumentary style reminded me of another of my recent favorites, Troll Hunter.",
    "rating": "50",
    "date": "May 12, 2015"
  },
  {
    "reviewer": "Matthew S",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/906665945/",
    "review": "  This is a truly funny spoof of both reality TV and all of the recent rampage of vampire entertainment. Smart, surprising and hilarious.",
    "rating": "35",
    "date": "May 11, 2015"
  }
,
  {
    "reviewer": "Casey B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/784518975/",
    "review": "  Loses steam as it goes along, but there are some very funny moments.",
    "rating": "35",
    "date": "May 11, 2015"
  },
  {
    "reviewer": "Shannon C",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/851603491/",
    "review": "  One of the best comedies I have seen in a long time!",
    "rating": "50",
    "date": "February 11, 2015"
  },
  {
    "reviewer": "DWR",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/969842769/",
    "review": "  Very good comedy Vampire flick ..werewolves thrown in too.",
    "rating": "50",
    "date": "May 8, 2015"
  },
  {
    "reviewer": "Cathy Morris A",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/906587859/",
    "review": "  Wacky, irreverent, and brilliant!",
    "rating": "40",
    "date": "May 7, 2015"
  },
  {
    "reviewer": "Ewan S",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/945224929/",
    "review": "  get through the first few minutes and you're in for an off-the-wall zany treat.laugh out loud - right through to the very end. just what we all needed a couple of nights ago.",
    "rating": "50",
    "date": "May 4, 2015"
  },
  {
    "reviewer": "Leong C",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/829695330/",
    "review": "  Hilarious, super funny vampire flick!!",
    "rating": "40",
    "date": "May 4, 2015"
  },
  {
    "reviewer": "Max M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/834554847/",
    "review": "  This mockumentary about old-school vampires (we're talking dracula style here) seemingly came out of nowhere, and is more fun than it has any right to be. In a post-Twilight world where 'vampire' now conjures images of melodramatic teens with skin conditons, this offering from the Flight of the Conchords braintrust hilariously resurrects the traditional form of the horror icon, and does it in style.",
    "rating": "45",
    "date": "May 3, 2015"
  },
  {
    "reviewer": "Este&#xFFFD; H",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/839290552/",
    "review": "  Funniest film I've seen in a long time!",
    "rating": "50",
    "date": "May 3, 2015"
  },
  {
    "reviewer": "Alex H",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/906321920/",
    "review": "  Only because I can't put 6/5 on this thing. This comedy is pure genius and works on every single creative level! Expect to need to have to watch it several times just to get all of the jokes!",
    "rating": "50",
    "date": "May 2, 2015"
  },
  {
    "reviewer": "Jake R",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/799521708/",
    "review": "  An underground comedic treasure that builds with unexpected appeal; Jermaine Clement, Taika Waitiki, and Jonathan Brugh accomplish the difficult objective of making the now exhausting \"mockumentary\" seem fresh and worthwhile again.",
    "rating": "35",
    "date": "March 16, 2015"
  },
  {
    "reviewer": "Chris I",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/816355476/",
    "review": "  really set the bar for vampire comedies",
    "rating": "35",
    "date": "May 1, 2015"
  },
  {
    "reviewer": "Robert B.",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/965766352/",
    "review": "  Hilarious in definition - it shows a documentary filming around 3 vampires in New Zeland. The effects are comic and B-side on purpouse, and it satirize many features of the vampires...one of the best and fresh comedies that I watched this years. 8,0 / 10,0",
    "rating": "35",
    "date": "April 30, 2015"
  },
  {
    "reviewer": "Ann F",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/920736214/",
    "review": "  Don't miss this deadpan comedy from NZ, an hilarious send-up of the daily life of vampires in the 21st century, from the Flight of the Conchords guys.",
    "rating": "45",
    "date": "April 29, 2015"
  },
  {
    "reviewer": "Laurent P",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/801036205/",
    "review": "  Un mockumentary pluto fute et inventif sur le theme vampirique pourtant pas mal use. C'est un peu le miracle du cinema neo zelandais qui sait toujours depoussierer les genres sans s'embarrasser des conventions. Jemaine Clement toujours imperial...",
    "rating": "35",
    "date": "April 28, 2015"
  },
  {
    "reviewer": "Matias C.",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/969934524/",
    "review": "  A great comedy and a wonderful deconstruction of the vampire myths.",
    "rating": "50",
    "date": "April 27, 2015"
  },
  {
    "reviewer": "Anton V",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/935373162/",
    "review": "  Great movie! Very clever and entertaining. Interview With The Vampire meets Big Brother. Written, directed and acted by Jamaine Clement from Flight of the Concords.",
    "rating": "50",
    "date": "April 27, 2015"
  },
  {
    "reviewer": "Beth S",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/936128331/",
    "review": "  LMAO funny. So funny. Still playing at Bijou downtown Eugene.",
    "rating": "45",
    "date": "April 26, 2015"
  },
  {
    "reviewer": "Mariko M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/925867034/",
    "review": "  The movie is kind of a \"reality show\" about the life of four vampires who live as roommates for centuries. It's original, a different comedy, just watch and relax...Laughs guarantee!!!",
    "rating": "50",
    "date": "April 25, 2015"
  },
  {
    "reviewer": "Eric D",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/910582117/",
    "review": "  Clever, funny, and a movie you should make time to watch.",
    "rating": "50",
    "date": "April 25, 2015"
  },
  {
    "reviewer": "Misha M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/913801323/",
    "review": "  Funniest movie I've seen in years! I can't wait to see it again!",
    "rating": "50",
    "date": "April 25, 2015"
  }
,
  {
    "reviewer": "Steve P",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/838291354/",
    "review": "  Superb -Dark, funny and visually brilliant!",
    "rating": "45",
    "date": "April 23, 2015"
  },
  {
    "reviewer": "Graham B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/784063724/",
    "review": "  From the makers of Flight of the Conchords comes this Christopher Guest like mockumentary about a group of vampires flat-sharing in Wellington, who decide to reveal their night to night activities to a documentary film crew.The comedy is rife throughout. From 3 vampires arguing over the washing up; choosing each others outfits as they can't see themselves in a mirror; baiting the local werewolves or trying to get invited into nightclubs. It is very well observed and extremely silly. The film suffers in its limited budget and lack of overall plot and thought they are fun characters to spend time with, it might have made for a better TV series.Hilarious script and a great cast do make this a worthy, silly watch.",
    "rating": "35",
    "date": "April 21, 2015"
  },
  {
    "reviewer": "Preston L",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/870598536/",
    "review": "  What We Do in the Shadows. This movie was hilarious! The premise is that a New Zealand documentary film crew is granted access to a flat owned by a small sect of Vampires. These vampires show the crew some of their day to day lives and events leading up to the biggest event of the year, the Unholy Masquerade. This seems mundane but the plot is riddled with moments that lead to humorous conflicts and situations. And the cast plays these moments with a great sincerity and genuine casualness that makes the film great.Things I LikedJemaine Clement and Taika Waititi. Both of these comedians are responsible for the hilarious Flight of the Conchords series. And the casual matter of fact humor translates into Shadows as well. They play two of the leads Vladislav, 800+ years old, and Viago 400 years old, respectively. They both have hilarious interactions and asides to the camera, Clement's Vlad is a hilarious as he emits failed sexual energy and moments of, as I call it, \"vampyric impotence\" where he struggles with his abilities following a humiliating defeat from \"The Beast\". Waititi plays Viago, who came to New Zealand after and old love but got rerouted in customs and took too long to get there. He is the \"mother hen\" of the group making sure chores are done and that the house is in order. He is very sweet natured and has a sense of regrettable disgust in killing humans. The pair make the movie as they interact with the other characters.The Tone. The movie has a sense of dark mystery usually associated with Vampires. Which when contrasted with the action makes things that much funnier. The tone of the film is an interesting combination of dark, mysterious, mundane, routine, and funny. There are many humorous twists on the traditional mythical vampirisms and imagery and they are just so out there that you can't help but laugh as they appear.Twist to the Genre. There are many moments that play at the traditional vampire films AND the traditional mocumentary moments. From the cranky old man of the group looking like Count Orlok, to the fact that the crew filming is suddenly in danger when someone realizes they aren't vampires. There are jokes about werewolf pack etiquette and trouble with hunting and eating humans. It all works very well and keeps the film interesting and entertaining, especially when you know the cliches and can laugh at them.Things I Didn't LikePace. Ok, I didn't really dislike the pace, but there were a few moments that dragged. This is a normal problem with comedies. They either work or they don't and in this case a lot of the film works. But there are a few moments where things don't move along and feel like they were just inserted for not reason other then the writers and directors thought it would be a funny moment. But this is a minor complaint.Lack of Time with Minor Characters. There are a number of minor characters that get introduced, then we get a tease as to some of their background, and then they are gone and we don't hear much more from them. And while it doesn't really ruin the movie, it is something just made me want more. I was bummed when the movie ended and I could have watched another hour of just these side characters interacting with the leads. If this is the biggest problem I had with a movie, then you know that I must have enjoyed the hell out of it.What We Do in the Shadows is hilarious, fun and thoroughly entertaining. I enjoyed the hell out of it. This is currently the best movie I have seen this year and I would watch it again in a heartbeat. If you enjoy some satire and are sick and tired of all these effin' vampire movies that do the same old thing, then I highly recommend this one. It is fun, original, and unlike anything I've seen in a long time.",
    "rating": "50",
    "date": "February 9, 2015"
  },
  {
    "reviewer": "Julia G",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/914287942/",
    "review": "  Is this out of the theaters already? NOooooo!",
    "rating": "wts",
    "date": "April 20, 2015"
  },
  {
    "reviewer": "Rea R",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/907329309/",
    "review": "  Finally! I think I'm about to have a favorite vampire movie. ^_^",
    "rating": "wts",
    "date": "April 20, 2015"
  },
  {
    "reviewer": "James O",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/877117727/",
    "review": "  What We Do in the Shadows is brought to us by some boys WAY down under, New Zealand. Described as a mocumentary, it shares with us the story of vampires who are sharing a flat in modern times. Their history along with the day to day problems they struggle with.If Monty Python was asked to film a \"Spinal Tap-ish\" like movie, on a budget, about vampires, I suspect you would get something like this. I really enjoyed this movie. The humor was biting and Shadows is a breath of fresh air when most of the current movie releases are being dumped on us by the movie studios. The three main characters, Viago, Deacon, and Vladislav do a great job at bringing to life a world full of dead-ish characters and giving us a peek at what life may be like for the un-dead.This film has a limited release, so you may have to search it out, but what a fun evening.",
    "rating": "45",
    "date": "April 18, 2015"
  },
  {
    "reviewer": "Nancy R",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/938135902/",
    "review": "  Hilarious & fun! So glad its finally coming to the USA!",
    "rating": "50",
    "date": "January 22, 2015"
  },
  {
    "reviewer": "Kurtiss K",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/906498583/",
    "review": "  Hilarious, and that's all you really need to know.",
    "rating": "40",
    "date": "March 13, 2015"
  },
  {
    "reviewer": "Vojta P",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/817889823/",
    "review": "  The single best vampire movie I've seen.",
    "rating": "50",
    "date": "April 16, 2015"
  },
  {
    "reviewer": "Ronald B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/905646053/",
    "review": "  Hysterical! If your tired of semi-funny Seth Rogen films and other lack luster comedies. WATCH THIS you'll laugh so much you'll cry!",
    "rating": "50",
    "date": "April 15, 2015"
  },
  {
    "reviewer": "David K",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/947371178/",
    "review": "  Amusing, good chemistry among the characters, decent jokes. But little narrative arc or suspense. Makes me think even a well-done vampire movie is severely limited.",
    "rating": "25",
    "date": "April 14, 2015"
  },
  {
    "reviewer": "Lee W",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/264064247/",
    "review": "  Stop me if you've heard this one before. Four disparate ne'er do wells share a squalid flat, arguing over who should do the washing up, failing to get into pubs and having the occasional physical altercation. But rather than Young Ones Rick, Vyvyan, Mike and Neil, What We Do In The Shadows has four centuries-old vampires sharing digs in modern-day Wellington.There's effete, lovelorn Viago (Taika Waititi), semi-reformed pervert/torturer Vladislav the Poker (Jemaine Clement), former Nazi vampire Deacon (Jonathan Brugh) and 8000 year old Nosferatu-alike Petyr (Ben Fransham). Ahead of the vampire social event of the year, The Unholy Masquerade, Petyr decides to make young Wellington native Nick into a new vampire, who introduces the guys to modern culture. They take martial arts lessons, they bid on eBay, they finally get a TV. And there's still time for them to have a series of altercations with a pack of werewolves led by Clement's old Flight of the Conchords manager, Rhys Darby (\"we're werewolves, not swear wolves.\")It's a one-gag concept, but one executed brilliantly. Like This Is Spinal Tap, Shadows hangs its central idea over a mock-documentary framework, with a narrative so slight it's barely there. And like Tap, it succeeds through likable characters (murderous creatures of the night though they are), a gag-ratio with many more hits than misses and buckets of charm - not to mention blood, guts and viscera.",
    "rating": "40",
    "date": "April 14, 2015"
  },
  {
    "reviewer": "Julie C",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/812643547/",
    "review": "  quirky, funny, smart, all the makings of an amazing cult movie. Still smiling thinking about it. ?",
    "rating": "45",
    "date": "April 12, 2015"
  },
  {
    "reviewer": "Maksim",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/900983430/",
    "review": "  Funnier, smarter and sharper than most of the Hollywood comedies, What We Do In The Shadows is an incredibly hilarious and pure bloody entertainment. Its striking originality, inventive humor and hilarious performances make this movie an awesome satire which is easily establishes it as the most horrifying vampire movie among the comedies and the most hilarious comedy among the vampire horrors. Based on the already clich�d mockamentary genre What We Do In The Shadows is a \"journalistic investigation\" covering the uneasy life of four vampires living in New Zealand. A social and very personal study on four generations of vampires, the plot is as energetic and inventive as a real comedy should be. By humanizing his characters, directing duo Taika Waititi and Jemeine Clement extract enough amount of funny moments coming from issues such as who is going to clean the dishes in the next century. The charm of What We Do In The Shadows is hidden not only in its nicely paced story, but also in the ability of its characters to deliver horrifying performances with a mix of spiced-up weirdo humor. As telling more about the story would reveal some funny spoilers related to the character, I would limit myself to saying the accents of these guys combined with their vampire age are a huge part of the fun in the story.As a conclusion, it may be a surprise to many who are normally focused on Hollywood comedies that What We Do In The Shadows could be labeled not only as the best comedy of the last 12 month, but as the most original fun since The Hangover or Ted. It is just that type of comedy that demands your attention and delivers a smart, sharp dialogue-driven entertainment which could definitely be used as a fine example that comedies are not necessarily filled with idiot clich�d gags. Definitely a must see !",
    "rating": "45",
    "date": "February 6, 2015"
  },
  {
    "reviewer": "Victor K",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/922402643/",
    "review": "  Off the wall, hilarious, off beat, fresh!!!! Great concept!! Well written, acted, and directed...interesting and well developed characters..NOT a dull moment!!!! Go see it NOW!!!!",
    "rating": "50",
    "date": "April 13, 2015"
  },
  {
    "reviewer": "Nico B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/905445336/",
    "review": "  Wild, wacky, and above all very funny, What We Do in the Shadows is a well executed, amusing, and refreshingly new take on vampires, it's not the traditional vampire movie or those vampire romances, it's like The Office with vampires and you know what, I'll take that over other forms of modern vampires any day!",
    "rating": "40",
    "date": "April 11, 2015"
  },
  {
    "reviewer": "Peter B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/784972131/",
    "review": "  \"What we do in the Shadows\" is a hilarious mocumentary about vampires living in wellington, New Zealand. It's very funny with a unique take on the daily (or should I say nightly) lives of these dark creatures. The movie also explains the interactions the vampires have between humans and other monsters such as zombies and werewolves. The movie also brings in some aspects of the vampire mythology that other movies leave out. (A vampire must be invited into a night club) A mix of physical comedy and dark humor, this film is a fun treat.",
    "rating": "35",
    "date": "April 10, 2015"
  },
  {
    "reviewer": "Maxx D",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/786873281/",
    "review": "  Great fun! Silly vampiric nonsense 'documentary' that had some excellently subtle effects and a few belly laughs. Will definitely watch again.",
    "rating": "40",
    "date": "April 10, 2015"
  },
  {
    "reviewer": "Ruth G",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/940119069/",
    "review": "  The funniest movie I've seen in a long, long, long time! Antidote to the whole Twilight thing but I think people who actually like vampire stories will still find it very funny. Taika Waititi (Cohen) is amazing and we already love Jermaine Clement from \"Flight of the Conchords\"",
    "rating": "50",
    "date": "April 10, 2015"
  },
  {
    "reviewer": "Ryan V",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/894467206/",
    "review": "  A worthy successor to Best In Show and This Is Spinal Tap, What We Do In The Shadows is a mockumentary that follows four vampiric flatmates in Wellington, New Zealand. Fans of Flight of the Conchords will recognize more than a few of the names in the credits, but everyone in the cast and crew does amusing work in their various roles. This is a wry, dry, clever, and funny movie that I recommend very highly.",
    "rating": "40",
    "date": "April 8, 2015"
  }
,
  {
    "reviewer": "Christopher H",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/906435411/",
    "review": "  Great little comedy mockumentary about vampires and warewolves in New Zealand. Fantastic characters and combined all the cliche. Fun.",
    "rating": "40",
    "date": "November 21, 2014"
  },
  {
    "reviewer": "Lovro H",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/911222432/",
    "review": "  A suprisingly hilarious movie! I didn't expect to be so amused with this movie, but it really did have me laughing for almost the entire runtime. The jokes were very well executed and while there were a few which didn't really work on me, almost each one did. The story itself is quite interesting, and it's not something I've ever seen done before, but at the same time it doesn't fascinate me and makes me want to watch the movie again. The characters are very weird and unusual. Many of them are likeable. The soundtrack is very 'happy' and dance-ish, and it really adds to the humour in the movie. All in all, a very funny and well acted comedy will have you laughing for lots of time, but isn't something you'd want to watch more than once.",
    "rating": "35",
    "date": "February 11, 2015"
  },
  {
    "reviewer": "Barbara G",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/842997104/",
    "review": "  I enjoy my sandwich the same way.",
    "rating": "40",
    "date": "February 15, 2015"
  },
  {
    "reviewer": "Mark H",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/851835142/",
    "review": "  Funny and goofy spoof of vampire/werewolf genre films, with memorable characters & jokes that mostly land. The troupe works well together and may become a modern day Monty Python if they continue making films this good.",
    "rating": "35",
    "date": "April 6, 2015"
  },
  {
    "reviewer": "Angela F",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/793822095/",
    "review": "  Too funny for words.",
    "rating": "50",
    "date": "April 6, 2015"
  },
  {
    "reviewer": "Melissa S",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/801162028/",
    "review": "  \"We're werewolves, not swear-wolves!\"",
    "rating": "50",
    "date": "April 5, 2015"
  },
  {
    "reviewer": "georgeann D.",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/901387057/",
    "review": "  Hilarious! Quirky fun, great cast!",
    "rating": "50",
    "date": "April 5, 2015"
  },
  {
    "reviewer": "Georgie D.",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/936519607/",
    "review": "  Laugh riot! Hilarious spoof of every vampire movie made. Appealing cast!",
    "rating": "50",
    "date": "April 5, 2015"
  },
  {
    "reviewer": "Ivana K",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/815741629/",
    "review": "  Hilarious! A bit to flat since you are laughing all the time, and there is no story build-up, but I don't mind it. Jokes that will last for ages and basically a perfect inside movie about guys relationships",
    "rating": "40",
    "date": "March 19, 2015"
  },
  {
    "reviewer": "Ricky W",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/846862113/",
    "review": "  What \"This Is Spinal Tap\" did for musicians \"What We Do In The Shadows\" does for vampires.",
    "rating": "45",
    "date": "April 5, 2015"
  },
  {
    "reviewer": "Ben S",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/945489194/",
    "review": "  One of the funniest starts to a movie I've ever seen.",
    "rating": "35",
    "date": "April 4, 2015"
  },
  {
    "reviewer": "Jessi H",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/891192835/",
    "review": "  Beyond brilliant. A true comedy without all the usual sophomoric humor hubbub.",
    "rating": "50",
    "date": "April 4, 2015"
  },
  {
    "reviewer": "Danny A",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/840116757/",
    "review": "  really clever and funny",
    "rating": "40",
    "date": "April 4, 2015"
  },
  {
    "reviewer": "Gimly M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/861960467/",
    "review": "  Not the first horror-comedy mockumentary I've ever seen, but hey, if they keep makin' them at least this good, they can bring out as many as they want.",
    "rating": "30",
    "date": "January 21, 2015"
  },
  {
    "reviewer": "Jen H",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/841861035/",
    "review": "  Some more of that uncomfortable humour, in case you needed any more of it in your life. It's wonderfully unique and a breath of fresh air in a crowded and stale vampire movie tradition.",
    "rating": "40",
    "date": "April 4, 2015"
  },
  {
    "reviewer": "Keith R.",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/969300993/",
    "review": "  KR's Haiku Review:MockumentaryAs good as Spinal Tap? YESGo see this right now",
    "rating": "50",
    "date": "March 7, 2015"
  },
  {
    "reviewer": "Daniel V",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/915960557/",
    "review": "  This is a funny fucking movie, a very very funny movie. If you are a fan of Flight Of The Conchords you will love the hell out of this. If your not, you'll still laugh your balls off. This parody hits 3 different genres that are very in at the moment, the Vampire, The Hand held photography technique, and The Office style mockumentary. It sends these up with giddy aplomb and you may need to watch it at least 3 times because your laughter will drown out too many jokes. Problem is, each time you will laugh just as hard as the previous. Did I mention this movie is Funny? I am wrong, it's gosh darn Hilarious!!!",
    "rating": "45",
    "date": "April 1, 2015"
  },
  {
    "reviewer": "Jean-Michel D",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/858494226/",
    "review": "  This movie was, for me, a huge surprise ! It's really bold, fresh, funny and crazy. It's a really original addition to a overused genre.",
    "rating": "45",
    "date": "April 1, 2015"
  },
  {
    "reviewer": "Hashim I",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/944708541/",
    "review": "  Brings warmth to its silliness, underscoring its sense of humor with the loneliness of characters doomed to watch their loved ones die.",
    "rating": "40",
    "date": "March 30, 2015"
  }
,
  {
    "reviewer": "Mia C.",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/969586753/",
    "review": "  Yuck. People around us were laughing, but there wasn't anything funny. There was nothing new or interesting in this movie. It was a typical mock-u-mentary. What a bore.",
    "rating": "20",
    "date": "March 30, 2015"
  },
  {
    "reviewer": "Doug Z",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/783543082/",
    "review": "  A great comedy from New Zealand on the more mundane aspects of being a vampire... :)",
    "rating": "30",
    "date": "March 29, 2015"
  },
  {
    "reviewer": "Stephen L",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/898763981/",
    "review": "  Was pretty damn funny and well worth the watch, especially if you are in the [MES] set.",
    "rating": "50",
    "date": "March 29, 2015"
  },
  {
    "reviewer": "Ramona T",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/936681756/",
    "review": "  BRILLIANT!Best comedy in ages!",
    "rating": "50",
    "date": "March 29, 2015"
  },
  {
    "reviewer": "Ethan H",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/906481605/",
    "review": "  A hidden gem. What an amusing, brilliantly original film that entertains to the very end.",
    "rating": "40",
    "date": "March 29, 2015"
  },
  {
    "reviewer": "Veronica R",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/907913344/",
    "review": "  Absolutely hilarious! If you ever enjoyed Benny Hill or similar British genius, then turn this on and escape for an evening. Loved it!",
    "rating": "50",
    "date": "March 28, 2015"
  },
  {
    "reviewer": "Begum S",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/938229092/",
    "review": "  so far the most hilarious vampire movie i have ever seen!!",
    "rating": "50",
    "date": "March 28, 2015"
  },
  {
    "reviewer": "Diane F",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/919397996/",
    "review": "  i love these guys. -- this century's monty python!",
    "rating": "wts",
    "date": "March 28, 2015"
  },
  {
    "reviewer": "David P",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/782562467/",
    "review": "  Early in the movie, the film has stretches where the laughs are non-stop. As it progresses to the midpoint-end, the novelty kind of wears off but it is still entertaining. Overall, very entertaining for fans of the vampire genre and horror-comedy. Borat with Vampires. Loved it!",
    "rating": "40",
    "date": "February 19, 2015"
  },
  {
    "reviewer": "&apos;Lauren D",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/798262859/",
    "review": "  If you like Flight of Conchords, then you will enjoy this.",
    "rating": "45",
    "date": "March 26, 2015"
  },
  {
    "reviewer": "Brent G",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/958339090/",
    "review": "  A great mix of dry, slapstick and bloody humour. The main vampire cast chemistry is perfect, reminding me of Spinal Tap and the Office combined. There's also some great quotable lines and a stellar cameo by Rhys Darby as the \"alpha-male\" Werewolf.",
    "rating": "40",
    "date": "March 25, 2015"
  },
  {
    "reviewer": "Lenard W",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/838139252/",
    "review": "  A funny look at the afterlife. Combining the mockumentary style of This Is Spinal Tap and reality tv tropes, What We Do in The Shadows is a look at four vampires in modern day Wellington sharing a house. If you think it's hard to live with a roommate for 10 years, try living with someone for 200. But soon their tranquil existence is threatened when they turn a meal into a vampire. Who knew vampires could turn out so neurotic. They really are just like us.",
    "rating": "40",
    "date": "January 31, 2015"
  },
  {
    "reviewer": "Derek O",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/785999988/",
    "review": "  If you're near the Guild in Menlo Park go see this! Funniest movie I've seen so far this year",
    "rating": "50",
    "date": "March 22, 2015"
  },
  {
    "reviewer": "Ryan O",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/905549893/",
    "review": "  By far the most original comedy I have seen in years! It's also incredibly hilarious!",
    "rating": "50",
    "date": "March 22, 2015"
  },
  {
    "reviewer": "Patrick F",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/920638812/",
    "review": "  Very original and funny funny movie.",
    "rating": "50",
    "date": "March 22, 2015"
  },
  {
    "reviewer": "Neil R",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/932280341/",
    "review": "  A brilliant farce wonderfully thought-out. Hilarious all the way through and very clever.",
    "rating": "50",
    "date": "March 22, 2015"
  },
  {
    "reviewer": "Philippe R",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/879352487/",
    "review": "  Light and funny movie!",
    "rating": "35",
    "date": "March 22, 2015"
  },
  {
    "reviewer": "Eric G",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/909818711/",
    "review": "  Together with 'Only Lovers Left Alive', this movie forces me to acknowledge that the vampire concept can still be ripe for great movie entertainment.",
    "rating": "40",
    "date": "March 22, 2015"
  },
  {
    "reviewer": "Casen H",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/943831253/",
    "review": "  A must see. A Must Own. There was not a single person, in the fairly crowded theater, who wasn't laughing at regular intervals. Smart, charming, and surprising. I am super in love with this movie.",
    "rating": "50",
    "date": "March 22, 2015"
  }
,
  {
    "reviewer": "Gary G.",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/969483325/",
    "review": "  Original, inspired high camp. Freakin' hilarious, highly recommended.",
    "rating": "45",
    "date": "March 22, 2015"
  },
  {
    "reviewer": "Swayamdeep S",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/913312240/",
    "review": "  Good concept . Jokes are very original , enjoyable .",
    "rating": "30",
    "date": "February 10, 2015"
  },
  {
    "reviewer": "Kevin A",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/931377575/",
    "review": "  Thoroughly clever, tongue in cheek and cheeky as well, this is a fun ride for all. It is smart, snarky, coy, sarcastic fun. That a house of vampires aged 1113, 987 and only 186 (considered to be a vampire teenager) can't get along over house chores and whether to \"eat\" humans unless it would mess the furniture, presents night time dilemmas for these noctural dandies. The film clearly had a modest budget (blood squirting effects not so good, but maybe on purpose), but oh so fun. There are more than a few laugh out loud moments and vampires dancing at a disco with the hope of biting the neck of a a dance partner is so fun. Do see this, but during darkness as sunlight sizzles one of the vampires who forgot to close the curtains against the morning sun. This is super great good silly fun not to be missed.",
    "rating": "45",
    "date": "March 21, 2015"
  },
  {
    "reviewer": "Darlene M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/784673874/",
    "review": "  The New Zealand faux-documentary style of Flight of the Conchords goes supernatural and is absolutely hilarious!",
    "rating": "45",
    "date": "May 21, 2014"
  },
  {
    "reviewer": "Joshua D",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/787299987/",
    "review": "  Brilliant mockumentary filled to the brim with hilarious lore and wonderful performances. This is Spinal Tap for the horror community.",
    "rating": "50",
    "date": "March 20, 2015"
  },
  {
    "reviewer": "Harry W",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/891495465/",
    "review": "  Serving as a critically acclaimed horror comedy mockumentary, What We Do in the Shadows sounded like a very original concept.Unlike most horror comedies of today, What We Do in the Shadows does not take itself seriously nor does it become a juvenile spoof film. It tries for nothing but humour, and most of the time it succeeds. This is partially because of just how much fun the makers of the film are willing to have with the material. Instead of getting caught up in the story, What We Do in the Shadows unfolds like a series of sketches cleverly crafted into a single narrative through the most simple means. The lack of narrative may frustrate some viewers and the thin characters may do the same, but those are two things you cannot expect from a horror comedy mockumentary. There are strong characters not on the level of depth but purely in terms of being effective comic creations, and it's all about the laughter. It is hard for comedy films to just sit back and have fun these days, and although What We Do in the Shadows is also a stylish piece of filmmaking, it certainly remains focused on playing at its comic gimmicks for all it can. The one problem I found with this was that there is only so long that the gimmick can stretch on for in What We Do in the Shadows before it finds itself repetitive. The story is clever enough, but I could not help but feel that it was like a sketch comedy stretched to feature length. It sustained itself well enough to pass off as sufficient comedic entertainment, but the value of the film comes from the way that its narrative essentially sorts itself into segments. There are many sketches that unfold over the course of the mockumentary, and viewers who do not get lost in the comic nature of the film should hopefully still find it to be a sporadically funny film as that is how it succeeded for me. The gimmicks of the film do not milk themselves for too long as the running time of What We Do in the Shadows is a mere 85 minutes, but there certainly was potential to do more with the film. There could have been countless clever cultural references to enhance the humour of the film, but it ends up limiting itself simply to concept gags without really going into examining just what it takes to turn horror into comedy. The simplicity of the film is admirable and the fact that it manages to achieve everything on a cast of mostly unknown actors is very respectable, but the script in the film is just very loose which is a problem.What We Do in the Shadows succeeds not so much on the written material but the way that directors Taika Waititi and Jeremaine Clement do with it, as well as where the cast manage to take things. Things move along very quickly and the atmosphere is consistently humourous due to the way that it really makes things feel lighthearted. In that sense, What We Do in the Shadows is a really easy film to watch as it does not demand viewers sit back and analse why it is supposed to be funny but rather throws them into remorselessly quick witted situations which are shamelessly dumb in a smart fashion, though some of the jokes circulate the film so consistently often that it can be repetitive. Much of the humour in What We Do in the Shadows is so upfront with its simplistic ridiculousness that it can be hilarious at times while ridiculous at others. But all in all, it remains an entertaining feature full of the best kind of silliness offered by modern day sketch comedy. What We Do in the Shadows knows how to have fun without complicating itself. It may not push as many limits as it could for a film which is so clearly in debt to countless vampire films, but it is certainly good old fashioned fun.No stranger to being stylish, What We Do in the Shadows manages to hold some effective visual humour. Effectively using clever special effects to play with the abilities of the supernatural beings of the story as well as strong makeup and costumes, What We Do in the Shadows is a film which is fun knows how to make use of a small budget through minor technical means while establishing that the important focus of the feature lies with its script. The general mockumentary style of the film is a really clever way to approach things because it allows viewers to get a more open view of the characters who themselves have to put on comedic personas to keep viewers entertainined at the antics of vampires connecting to the real world through the means of camera. The film certainly portrays an all new way to look at the lives of vampires in a clever way, and frankly it is certainly one of the most original vampire concepts in a long time as the genre has become one which all too often succumbs to tropes and lacklustre horror reliant on blood and gore while What We Do in the Shadows actually diverts those concepts in a clever parody manner which does not go to the ridiculous extent of being a spoof but rather manages to maintain narrative integrity all while really going into hilarious territory. Frankly, there are some really funny moments in What We Do in the Shadows, and even if they are not as consistent as you might hope, they make the feature entertaining as a whole.So What We Do in the Shadows is essentially an extended sketch comedy built on a series of gimmicks tied together by a loose plot without much in the way of consistent innovation, but the utmost simplistic joy of the stupidity in the feature and its genuine sense of comic energy makes it worth plenty of laughs",
    "rating": "30",
    "date": "September 1, 2014"
  },
  {
    "reviewer": "Ryan L",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/867444688/",
    "review": "  A hilarious and thoroughly enjoyable take on the vampire flicks of yesteryear.",
    "rating": "45",
    "date": "March 18, 2015"
  },
  {
    "reviewer": "Ryan H",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/831359944/",
    "review": "  I don't normally post about movies I have seen but this movie was the best comedy I have seen in years! Find it in your city and support great indie comedy! Like Nike says \"Just Go And Do It\".",
    "rating": "50",
    "date": "March 18, 2015"
  },
  {
    "reviewer": "Joy E",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/831613187/",
    "review": "  I can't say the film is bad, but it's definitely not my style, maybe because I take vampires somewhat seriously, I couldn't watch more than half of the film, couldn't stand it...",
    "rating": "30",
    "date": "February 14, 2015"
  },
  {
    "reviewer": "Sean N",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/917617472/",
    "review": "  One of the best movies I have seen this year. A great cast of characters make for a wonderful and funny mockumentary of four vampire room mates preparing for the yearly gathering of ghouls at the unholy masquerade. I laughed out loud thru so much of this film. I can't wait for it to be released.",
    "rating": "50",
    "date": "March 17, 2015"
  },
  {
    "reviewer": "Gil M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/906212302/",
    "review": "  Yea, the quotes on the poster are totally accurate.",
    "rating": "40",
    "date": "March 17, 2015"
  },
  {
    "reviewer": "Manny C",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/783684766/",
    "review": "  What We Do In The Shadows is a vampire movie for people who likely loathe vampire movies which is the greatest thing about it. It's packed with laughs, nearly all of them intentional. In this mockumentary from New Zealand, we follow the lives of aging vampires in need of a little humanity to give the fresh blood and a new reason for living. Jermaine Clement, of the immortal Flight of The Conchords, is orgy-loving bloodsucker Vladislav, who's been living for 862 years and hasn't learned much of anything. His longtime buddy Viago (Taika Waititi), a child of 379, tries hard to some of his past, particularly the Nazi parts. And then things leak out.As co-directors and writers, Clement and Waititi save real zingers for the rest of the vamps they share a pad with. There's Deaconn (Jonathan Brugh), the young, 183-year-old rebel, and Petyr (Ben Fransham), a literal old bat at 8,000. No need to worry about keeping track of everyone, just feast your eyes on the bloody dishes in the sink and that poker that Vladislav carries. Often What We Do In The Shadows is like a sketch stretched to movie length but who cares when you have a comedy this sensationally funny.",
    "rating": "30",
    "date": "March 16, 2015"
  },
  {
    "reviewer": "Aditya D. Mallya",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/915780922/",
    "review": "  I was already voting for New Zealand to win the 2015 Cricket World Cup, but after watching this superb Kiwi mockumentary I just might apply for citizenship! This black comedy about a group of vampire flatmates in Wellington is a non-stop delight.",
    "rating": "45",
    "date": "March 15, 2015"
  },
  {
    "reviewer": "Dayna S",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/905638684/",
    "review": "  if you can't have fun with this movie you should stop going to movies..",
    "rating": "50",
    "date": "March 15, 2015"
  },
  {
    "reviewer": "Elizabeth W",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/820946154/",
    "review": "  what a fantastic movie! Hilarious take on all the vampire tropes. A must see!",
    "rating": "50",
    "date": "February 6, 2015"
  },
  {
    "reviewer": "Laura N",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/785282821/",
    "review": "  Funniest movie I have seen in a long time. It takes everything I LOATHE about reality TV and melds it with vampire lore. Simply wonderful.",
    "rating": "50",
    "date": "March 15, 2015"
  },
  {
    "reviewer": "Ian B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/781960658/",
    "review": "  In a genre that doesn't see much success, the creators of Flight of the Conchords have given us the funniest mocumentary since This Is Spinal Tap. The story revolves around four vampire roommates trying to deal with modern day New Zealand, and each other. What could've easily been a one-note joke instead works brilliantly thanks to the improvisation skills of the actors and the way they poke fun at the different types of vampires the genre has given us over the years. It starts to overstay its welcome slightly in the end, but by then your face should already hurt from laughing so much. Original, hilarious, surprising and always entertaining. Highly recommended for those looking for a different type of comedy.",
    "rating": "45",
    "date": "March 15, 2015"
  },
  {
    "reviewer": "Dave M.",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/969038433/",
    "review": "  Great comedy can come from the most unlikely of places, both in terms of location and subject matter. How about vampires? Are they funny? They can be. They've been fodder for many big-screen comedies over the years. How about a vampire comedy from, oh... say, New Zealand? Believe it or not, that's the combination you get in \"What We Do in the Shadows\" (NR, 1:26) - and, as the movie's poster makes clear, it is hilarious! This is a mockumentary about four vampires living together in the suburbs of Wellington, New Zealand. They've invited a film crew (promising not to eat them) into their house to document the vampires' daily lives (actually, nightly lives) and their preparations for the annual Unholy Masquerade ball. The vampires have a variety of backgrounds and personalities. The one who addresses the camera most is Viago (Taika Waititi, who also co-wrote and co-directed the film). He was \"a bit of a dandy\" before he became a vampire three centuries ago and now basically acts as the group's housemother, calling a meeting to discuss chores, for example. Vladislav (Jemaine Clement, the other half of the film's writing-directing team) is the ladies vamp of the group and, back in the day, was much feared for his habit of \"poking people\" (a winking homage to the real-life Vlad the Impaler, who was the inspiration for the legendary Dracula character). The group's youngest member is Deacon (Jonathan Brugh). He's less than two centuries old and he's the most impetuous of the four. Oh, and he used to be a Nazi. The fourth blood sucker is 8,000 year-old Petyr (Ben Fransham). He's the oldest of the group (looking like the vampire in the classic silent film \"Nosferatu\") - and he's also the crankiest. He usually just stays in his closet. Most nights, the three youngsters of the group go out to clubs looking for victims (and sometimes harassing the local werewolves), but sometimes they have a dinner party - a phrase that takes on a whole new meaning in this case. Deacon has a human servant named Jackie (Jackie Van Beek) who helps out the housemates by doing everything from cleaning up blood that has been spilled in their house, to helping them get new victims. Deacon has promised Jackie that, after a certain period of service, he'll make her a vampire. One day Jackie brings a couple old acquaintances, named Nick (Cori Gonzalez-Macuer) and Katherine (Ethel Robinson) to the house for one of those dinner parties. After playing it cool for a while, and then briefly toying with their guests, they attack. They suck Katherine's blood, but Petyr gets a hold of Nick and turns him into a vampire.Nick ends up moving in to the house. The guys teach him about being a vampire (important things like - don't tell everyone that you're a vampire!) and he helps them get up to date on modern technology (including cell phones, the internet and Skype). Nick starts bringing his best friend, Stu (Stuart Rutherford) around to the house. That's usually a big no-no amongst the children of the night, but Stu takes it all in stride, and they all really like him, so they decide that it's cool. But that's not the end of the story. This situation comes to a head (along with a long-standing feud between Vlad and a rival vampire whom he calls \"The Beast\") at The Unholy Masquerade. All that, along with a few zombies and other \"predeceased\" creatures thrown into the mix (not to mention a pivotal encounter with that pack of werewolves) and the movie has an ending that is to die for. A lot of the comedy in \"What We Do in the Shadows\" comes from the juxtaposition of the vampires' politeness and their brutality, as well as the matter-of-fact way that they talk about their lifestyle and nefarious nocturnal activities. A good example would be Jackie driving in her car, casually discussing the merits of eternal life as a vampire, or Nick talking about the ups and downs of being a vampire and ending with \"It sucks.\" Whether the comedy makes you laugh out loud or you simply find it quietly amusing is a matter of individual personality, but most people seem to agree that, no matter how you define it, this movie is very funny - and very clever. It goes to show that filmmakers don't need millions of dollars, big-name stars and an elaborate story to make a quality film. A great concept, properly fleshed out (no pun intended) and a few creative and talented actors will do. This movie is like a great amusement park ride. It's scary, fun and unique - and as soon as the ride is over, you want to get right back in line and enjoy it all over again. \"A-\"",
    "rating": "40",
    "date": "March 14, 2015"
  }
,
  {
    "reviewer": "Amelia C.",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/969399548/",
    "review": "  Thoroughly entertaining and downright silly from start to finish!",
    "rating": "45",
    "date": "March 14, 2015"
  },
  {
    "reviewer": "John P",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/863141410/",
    "review": "  Meh. Conceptually, it should work. In practice, it falls a little flat.",
    "rating": "30",
    "date": "March 14, 2015"
  },
  {
    "reviewer": "James R",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/868770479/",
    "review": "  HIlarious! If you're a \"Flight of the Conchords\" fan then I would definitely recommend giving this one a look. The film is a mockumentary about the lives of three Vampires living in New Zealand. There's Viago (Taika Waititi) who is kinda a goodie goodie looking for a long lost love, Vladislav (Jemaine Clement) one of the older Vampires who's dominated many places in the past and is just a badass. Then there's Deacon (Jonathan Brugh) who's the youngest and more rash of the group. The movie follows them for a few days throughout their lives and how they deal with anything from house chores, going out, eating, etc. It's really well done and has that New Zealand dry sense of humor that was very present in \"Flight of the Conchords.\" I would take a look at the trailer and if that interests you then definitely give this one a look! I found it made me laugh and entertained for its short hour and 25 minute run time!",
    "rating": "40",
    "date": "March 14, 2015"
  },
  {
    "reviewer": "Gary G",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/906924279/",
    "review": "  SO easy to enjoy, especially since we are Flight of the Concord fans. A vampire movie you haven't seen before and won't see again, unless they do a sequel.",
    "rating": "40",
    "date": "March 14, 2015"
  },
  {
    "reviewer": "Kelly K",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/819178013/",
    "review": "  Ohhhh I can't wait to see this tonight with Mark!!!! It looks Hysterical!!!!",
    "rating": "wts",
    "date": "March 13, 2015"
  },
  {
    "reviewer": "David M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/916308698/",
    "review": "  This really is as good as it sounds. I highly recommend it.",
    "rating": "50",
    "date": "February 12, 2015"
  },
  {
    "reviewer": "David K",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/900451477/",
    "review": "  Hilarious and true to its Mockumentary format, this movie is a hoot. Excellent characters that flows well with the movies lack of plot and some good stabs at todays popular culture.",
    "rating": "30",
    "date": "February 22, 2015"
  },
  {
    "reviewer": "Brandon V",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/965000610/",
    "review": "  This is a fake documentary about the quirky daily lives of vampires, werewolves, and ghouls galore; it delivers 100% on that concept with constant laughs, charismatic performances and some pretty sweet horror imagery. It's light, but full of so much heart and creativity.",
    "rating": "40",
    "date": "March 12, 2015"
  },
  {
    "reviewer": "Chok S",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/785295343/",
    "review": "  Hilarious! Hilarious! Hilarious! New Zealand has made it again with my last year's favourite Housebound and now What We Do In The Shadows is my new favourite and best horror/comedy film of 2015!! Not only all the characters here are absolutely hilarious but the mockumentary concept of this film is just brilliant. Think the mixed of Behind The Mask: The Rise of Leslie Vernon and a bit of Cabin In The Woods and you will get this vampire twisted-genre film that pokes fun at several vampire references and will make you laugh like crazy from start till finish. There are some SCARY make-up and jump scares here but overall the film is more of a comedy so don't go in expecting any of that kind like Housebound as well as the GORES. While the plot may not seem to be fully developed enough but as long as it can crack you up all the way through with several laugh-out-loud moments, plus making fun of the genre you love, that's just all it takes for me for a successful horror/comedy film [A]",
    "rating": "50",
    "date": "March 11, 2015"
  },
  {
    "reviewer": "Alejandro B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/908201690/",
    "review": "  Although more like a collection of skits than a feature film, What We Do In The Shadows is fun due to the chemistry of its hilarious leads.",
    "rating": "25",
    "date": "March 9, 2015"
  },
  {
    "reviewer": "Richard D",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/849167683/",
    "review": "  Good Lord this is a funny film. Four vampires share a house in Wellington , NZ while a documentary crew films them. It's kind of like an undead version of The Real World. The timing and tone of the dry humour is absolutely perfect. It also really commits to the horror of the premise, staging a fair amount of bloody gore to complement the laughs. It's a slight film, but it's consistently and uproariously funny.",
    "rating": "45",
    "date": "March 9, 2015"
  },
  {
    "reviewer": "vh",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/900683813/",
    "review": "  Just when you thought vampires and their ilk had been done to death (har) out comes this mockumentary about a trio of vampires sharing a house in a Wellington, NZ suburb. Outside their basic vampire characteristics - their ability to fly, lust for human blood, and aversion to sunlight - they're just regular guys trying to live amicably as housemates. They have \"flat meetings\" at which they discuss mundane topics like the shirking of chores (one guy almost never washes the blood-soaked dishes when it's his turn). They obsess over what to wear when they go out clubbing. One of them even knits. They have occasional run-ins with their arch-rivals, a pack of werewolves, but these are rarely more than taunting and name-calling. Mostly, they're a nice, polite, group of guys who just happen to be vampires.Things get shaken up a bit when they invite a young, newly-minted vampire to share the house, and he and his best human buddy, a taciturn systems analyst named Stu become one of the gang. \"What We Do in the Shadows\" is the funniest film I've seen in ages. I rarely laugh out loud at movies, but this was a rare exception. From goofy sight gags to clever dialogue, the humor just keeps on coming. Not everything works - buckets of blood get old after a while and I'm not a big fan of fight or chase scenes - but things move along so quickly that even if one scene misses, another laugh is always just around the corner. The big surprise here is that for a comedy about vampires, this movie is actually quite sweet. I left the theater feeling way happier than I ever do after seeing REAL \"feel-good\" movies. Two bloody fangs way up!",
    "rating": "40",
    "date": "March 8, 2015"
  },
  {
    "reviewer": "Mitchel C",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/969329737/",
    "review": "  Funniest movie I've seen in a while",
    "rating": "45",
    "date": "March 8, 2015"
  },
  {
    "reviewer": "Madmartigan",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/901333002/",
    "review": "  Different style of humor, pretty funny.",
    "rating": "35",
    "date": "March 8, 2015"
  },
  {
    "reviewer": "Nick S",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/921238016/",
    "review": "  The most consistently funny film I have seen in a long while. Set design and atmosphere is also top notch.",
    "rating": "45",
    "date": "March 7, 2015"
  },
  {
    "reviewer": "Bennett W",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/814872068/",
    "review": "  Destined to be the funniest movie of the year, and the greatest vampire movie of all time...Yes, I'm serious...",
    "rating": "45",
    "date": "March 8, 2015"
  },
  {
    "reviewer": "Michael T",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/869813097/",
    "review": "  Funny spoof of vampires is just long enough that it doesn't wear out its welcome.",
    "rating": "40",
    "date": "March 8, 2015"
  },
  {
    "reviewer": "Angela S",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/793656295/",
    "review": "  If this movie is in a city near you, GO SEE IT! It's fun and hilarious and completely worth while!",
    "rating": "50",
    "date": "March 8, 2015"
  },
  {
    "reviewer": "Mads L",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/913375522/",
    "review": "  Didn't expect much at first. The trailer promised some light laughs, focusing on a small group of vampires living together and trying to function in a modern world. What I got was so much more. Quirky without being dull, smart without being slow and thoroughly entertaining. All in all, time well spent.",
    "rating": "50",
    "date": "March 8, 2015"
  },
  {
    "reviewer": "Dona S",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/865656886/",
    "review": "  Great time - we laughed the whole way through.",
    "rating": "50",
    "date": "March 8, 2015"
  }
,
  {
    "reviewer": "Jonas P",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/847367549/",
    "review": "  Humour of the darker and more subtle variant typically works best for me. What We Do in the Shadows is not only clever in its writing, but also highly effective in its comedic timing.The mockumentary approach isn't exactly a new thing, but it's very well executed here in terms of camera work, flow in dialogue and set design. The premise of four vampires living together in a flat and dealing with undeath rather than life is a delight to watch and follow even though it's mainly played for laughs. The main characters Vladislav, Viago, Deacon and Petyr (even though not getting to do as much) are portrayed superbly by Jemaine Clement, Taika Waititi, Jonathan Brugh and Ben Fransham, and each have their brilliant moments. Viago for instance is the archetypical gentleman who makes sure his victims have a good time before placing his fangs into their necks. I figured that Vladislav would be my favourite character, but I grew to love all of them as a whole, convinced they've been friends literally forever.One thing that bothered me though was one of the side characters. Nick, played by Cori Gonzalez-Macuer, is visiting the four vampires unknowingly being prepared to become dinner for them. When he finds out, he is reacting kind of stiff to the situation. But then again how would one react if it actually happened. Without spoiling he becomes their friend in a somewhat complicated manner and he grows from there, pulling off a good performance for the rest of the flick.The film even briefly get into the main characters' background and introduces other creatures further ahead, such as werewolves and zombies, as I'm sure we're not used to see them in fiction. I wouldn't mind if the movie put some more time to them as well, such as a couple short interviews, as I don't think that would detract too much from the main storyline.Lastly I'd like to mention that the film makes clever use of visual and practical effects. They are quite well made, few in between and mainly shown in glimpses, which keeps in tone with the rest of the film. Related to that What We Do in the Shadows even contains effective horror scenes, blending seamlessly with the rest.In short it's a wonderful movie and you should watch it if you're the least bit interested in vampire lore.",
    "rating": "40",
    "date": "March 7, 2015"
  },
  {
    "reviewer": "Tyler G",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/922323223/",
    "review": "  Outstanding! A barrel of laughs from start to hilarious finish.",
    "rating": "50",
    "date": "March 6, 2015"
  },
  {
    "reviewer": "ManIsh A",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/903591870/",
    "review": "  A very smart satire to the vampire lore and also the the recent vampire movies. It turns into a pretty funny ride.",
    "rating": "30",
    "date": "March 6, 2015"
  },
  {
    "reviewer": "Peter L",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/934134242/",
    "review": "  Virgin sandwiches. Ghost cups. Shame, shame, shame. And a bloody good time for everyone. What We Do In The Shadows both shines a light (not a sun-light, thankfully) on the secret world of vampires in New Zealand, and is easily one of the funniest movies you may ever see in your life - do yourself a favor and catch it in a theater.",
    "rating": "50",
    "date": "February 2, 2015"
  },
  {
    "reviewer": "Andrei D",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/905905573/",
    "review": "  E scris, jucat si filmat perfect, astept sequel-ul cu werewolves",
    "rating": "45",
    "date": "March 6, 2015"
  },
  {
    "reviewer": "Kelly T",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/907316368/",
    "review": "  Finally opening today at Hollywood 20! Can't wait!!!!!!!Forget 50 shades of pervy this is the movie you want to see",
    "rating": "wts",
    "date": "March 6, 2015"
  },
  {
    "reviewer": "Scott M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/932598709/",
    "review": "  Seriously one of the funniest movies I have seen in a LONG time.",
    "rating": "50",
    "date": "March 5, 2015"
  },
  {
    "reviewer": "Jenna I",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/783718340/",
    "review": "  Cute, charming and fresh. Great timing, great satire on the boring vampire cliches, genuinely good film.",
    "rating": "35",
    "date": "March 4, 2015"
  },
  {
    "reviewer": "Francisco G.",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/913676958/",
    "review": "  The vampire comedy no one was expecting, What We Do In The Shadows is constantly hilarious and not only respects the vampire mythos but makes the greatest use of it to tell amazing jokes everyone can appreciate. The low-budget is worn with pride, like one of the vampire's beloved silk dresses, creating even more fun where it shouldn't be. Sure, half-way through it gets a lil' stale, some jokes repeat themselves a bit often but since it worked so well from the start, they have all the right to thread over these issues, because it's clear everyone involved is having a blast and that comes across to us, the viewer.",
    "rating": "40",
    "date": "March 4, 2015"
  },
  {
    "reviewer": "Eric B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/782112202/",
    "review": "  Great bits and dry (well, except when one of them mistakenly hits an artery) humor that doesn't outstay its welcome.",
    "rating": "40",
    "date": "March 3, 2015"
  },
  {
    "reviewer": "Andrew B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/915872985/",
    "review": "  From the guys who gave us Flight of the Conchords, What We Do in the Shadows is a very funny and persistently enjoyable mockumentary/comedy that mostly overcomes any potential staleness of its vampire subject matter.",
    "rating": "40",
    "date": "March 3, 2015"
  },
  {
    "reviewer": "Ksi S",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/948627155/",
    "review": "  damn it. its hard to see this much original and awesome films these days!",
    "rating": "50",
    "date": "March 2, 2015"
  },
  {
    "reviewer": "Marlin R",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/805612731/",
    "review": "  On par with movies like Spinal Tap, and Best in Show. I really enjoyed this flick and highly recommend it to anyone who is a fan of Vampire Genre.",
    "rating": "40",
    "date": "March 3, 2015"
  },
  {
    "reviewer": "Sky H",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/784621307/",
    "review": "  Funniest movie I have seen in a long time and the best vampire movie I have seen in a long time.",
    "rating": "40",
    "date": "March 2, 2015"
  },
  {
    "reviewer": "Sean L",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/793676809/",
    "review": "  A Flight of the Conchords mockumentary inspecting the logistics of the vampire social scene in modern-day New Zealand. I was hoping for better. It seems like it's constantly right on the verge of doing something really hilarious, but can't quite flip the switch. The landscape is ripe for this kind of a satire, too, with so much empty romanticism hovering around the fantasy genre. Most of the fun comes from picking apart the hallmarks of the bloodsucker game, exposing them for the lame parlor tricks and absurd handicaps they really are. Mystically swapping a plate of noodles for worms, for example, to the mild annoyance of the victim. Failing to enter a nightclub because the bouncer doesn't explicitly invite them in. In most films, these would be appetizers for the main entree, but in this case there's no second course. This would've made for a brilliant skit on a sketch comedy show, but it just doesn't have the depth for its own feature-length. Even a very short one.",
    "rating": "30",
    "date": "March 2, 2015"
  },
  {
    "reviewer": "Amilcar A",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/798975154/",
    "review": "  I never saw Flight of the Concords so to me this movie was new in almost every way. I had no frame of reference or bias, good or bad so I was very open to any scenario. I must say this was one funny and creative movie. The idea of making a mockumentary about vampires living in Wellington NZ is pretty absurd to begin with. After you see them in action it's truly insane. What I loved about this movie is that it obviously doesn't take itself very seriously but it's also not stupid and extra cliched. There are limited gags and the running jokes are not overbearing. What's missing in this film are moments of extreme brilliance. It's pretty funny all around but there are no scenes where you really feel like you're going to piss your pants. For something of this nature, What we do in the shadows is a good movie that could have been a little better or a lot worse. It works all around.",
    "rating": "35",
    "date": "March 1, 2015"
  },
  {
    "reviewer": "Kelvin W",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/796833663/",
    "review": "  Very clever. It is refreshing to see low-budgeted well-written comedies hit the mark.",
    "rating": "40",
    "date": "March 1, 2015"
  },
  {
    "reviewer": "Warren C",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/893204579/",
    "review": "  Very funny movie - I really enjoyed it! If you love vampires this film is a must!",
    "rating": "45",
    "date": "March 1, 2015"
  }
,
  {
    "reviewer": "Sean T",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/787741594/",
    "review": "  8/10 Extremely clever and unabashedly silly with a deadpan delivery, What We Do In The Shadows is the funniest movie i've seen since The World's End.",
    "rating": "40",
    "date": "March 1, 2015"
  },
  {
    "reviewer": "Rudy F",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/908505426/",
    "review": "  Funniest movie I've seen in years.",
    "rating": "50",
    "date": "February 28, 2015"
  },
  {
    "reviewer": "Josh M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/903802809/",
    "review": "  Had no idea this movie existed until some friends invited to a screening at the Music Box Theatre in Chicago. Boy did I thank them for that!WWDinS was amazing! I really think this is going to be a cult classic in few years in the same way Shaun of the Dead did.Review Points:",
    "rating": "50",
    "date": "February 28, 2015"
  },
  {
    "reviewer": "Michelle A",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/874157651/",
    "review": "  Deacon: I think we drink virgin blood because it sounds cool.Vladislav: I think of it like this. If you are going to eat a sandwich, you would just enjoy it more if you knew no one had fucked it.",
    "rating": "45",
    "date": "May 13, 2014"
  },
  {
    "reviewer": "Jennifer M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/785490077/",
    "review": "  Absolutely fantastic mockumentary! Laughs throughout, a rather copious amount of blood too, but unexpectedly charming from start to finish. Loved it!",
    "rating": "50",
    "date": "February 27, 2015"
  },
  {
    "reviewer": "Bert T",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/906229932/",
    "review": "  Led to believe that this would be funny. Silly, it not witty or truly comic. Instead it's just -- SAD. I felt sorry for the poor guys and everyone they knew. Trapped in tedium, no hope, no goals, no pride or enjoyment in who they are and what they can do, living in a dismal house (when they could easily do better), sniping and bitching amongst themselves about the same trivia we capitalist wage slaves do. I think that was supposed to be the \"joke.\" Well, it's not even a one-joke film. I'm sorry I saw it.",
    "rating": "05",
    "date": "February 27, 2015"
  },
  {
    "reviewer": "Joe R.",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/968760606/",
    "review": "  Such a hilarious premise that is executed to near perfection. It's spooky, funny, heartfelt, and so absurd you can't help but laugh at these uniquely developed characters. I never thought I'd enjoy a movie about vampire roommates so much.",
    "rating": "40",
    "date": "February 27, 2015"
  },
  {
    "reviewer": "Evan L",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/947164548/",
    "review": "  I've heard nothing but praise for What We Do in the Shadows. The trailers looks hilarious and I really like the talent involved. Flight of the Conchords is a pretty great show, so I was pretty excited to see this. Though it wasn't as consistently funny as I would have hoped. What We Do in the Shadows is a bloody-good time at the movies!THE GOOD:+ Some of the jokes had me dying of laughter. They were clever sand unique. The humour in the film is really smart, with chuckles all over the place.+ The mockumentary style worked perfectly, and was well executed! Probably one of the best of its genre. + The characters were loveable! They were all well developed and were different than what I've seen in vampire films before.+ The atmosphere was creepy but fun at the same time. + There were tons of references to older vampire movies. It payed homage to classic and recent horror films too.+ The pace was extremely fast and the whole film was entertaining. I never felt bored once.THE BAD:- Here's where I took off most of the points. The jokes weren't consistent at all. There were periods up to fifteen minutes where I didn't laugh at all. This is unfortunate, because the parts that were funny were hysterical!- The ending felt completely abrupt and came out of nowhere. By the end, I said \"that's it?\".- There were a couple of jokes that fell flat for me.Overall, What We Do in the Shadows is a hilarious, creative and utterly entertaining comedy with incredible jokes and a cool atmosphere. See it!RATING: 7.5/10",
    "rating": "35",
    "date": "January 12, 2015"
  },
  {
    "reviewer": "Andy R",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/783989275/",
    "review": "  Very funny movie. Slowed down a bit in the third act, but that wasn't enough to ruin the movie. In these days when spoofs are done terrably, it's nice to see a clever Mochumentary.",
    "rating": "40",
    "date": "February 27, 2015"
  },
  {
    "reviewer": "Mark M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/963822019/",
    "review": "  A common predisposition when it comes to genre pieces - particularly horror and its subgenres - is the \"Oh, great. Another ****ing [insert a movie's particular genre/subgenre here] movie. I wonder what 'new' things this'll introduce to the genre...\" which is said - more often than not - in a delicious cocktail of contempt, weariness and cynicism. And its a rarely proven wrong predisposition, especially when it comes to modern horror. But this predisposition has never cropped up when it comes to horror comedies that come out of New Zealand. Why?It's because the Kiwis know how to make horror comedies, and prove to be about as close to an art form to them as to how the shaky cam effect is an art form to someone attempting to emulate Parkinson's disease. From Peter Jackson's hilariously exploitative and baffling Braindead (1991) to Jonathan King's 'splatstick' Black Sheep (2006), and most recently, Gerard Johnstone's haunted house caper in last year's Housebound, filmmakers that dabble with horror comedies in New Zealand have been consistently hitting it out of the park. And What We Do in the Shadows doesn't fall short.The problem with the horror genre is exactly the aforementioned predisposition; introducing something new. Movies that break the norm - The House of the Devil (2009), The Sacrament (2013), Starry Eyes (2014), The Babadook (2014) etc - are quickly picked up, dissected, and then praised for their particular unique qualities. By taking ancient vampires and placing them in a modern setting, directors and writers (and actors) Taika Waititi and Jemaine Clement craft a seemingly brilliant tale with enough potential in What We Do in the Shadows to give its vampyre competitors a run for their warm supply of blood.What We Do in the Shadows sets itself apart from other horror comedies due to the heart that is injected into the film. By stacking an absurd amount of varying years into the 'ancient' bit of the age of each of the vampires, then placing them into a flat, Waititi and Clement are effectively grounding the vampires in 'realism' for the intended mockumentary angle; they share - more or less - the same problems that their less sexy human counterparts have, and with the distinction being that they're, well, \"shit-sucking vampires\", the filmmakers effectively provide several funny spins on the already macabre vampire premise.Further aided by the colorful characters, their nuanced characterizations, eccentricities and personalities being projected amazingly through the performances of Waititi, Clement, Jonathan Brugh, Cori Gonzalez-Macuer and their chemistry with each other and the other actors, What We Do In the Shadows is a much better investment than the usual watered down vampire schlock.",
    "rating": "40",
    "date": "February 26, 2015"
  },
  {
    "reviewer": "Steve W",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/785245485/",
    "review": "  What We Do in the Shadows is a silly and zany vampire mockumentary from the people who brought you Flight of the Conchords. There's not much of a plot to speak of, but watching them bicker over flat chores or trying to show on camera is funny enough, and there are some great visual effects with the flying aspect. The only aspect I didn't like was the zombies, as they would not fit in with society so that makes no sense.",
    "rating": "30",
    "date": "February 25, 2015"
  },
  {
    "reviewer": "Netanya S",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/817485658/",
    "review": "  Original, hilarious and inventive.",
    "rating": "50",
    "date": "September 18, 2014"
  },
  {
    "reviewer": "Nick P",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/782971099/",
    "review": "  What they do in the shadows, is clearly make fantastic comedies that most of the world will unfortunately not watch. It's a sad fact, because this movie feels like it's been something the world has needed for quite sometime now...a vampire-comedy that RESPECTS vampires, but also turns the idea into some hysterical satire.",
    "rating": "40",
    "date": "February 12, 2015"
  },
  {
    "reviewer": "Pantha R",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/950729735/",
    "review": "  Just Brilliant!! Hats off to Taika Waititi & Jemaine Clement!",
    "rating": "40",
    "date": "February 24, 2015"
  },
  {
    "reviewer": "Michael H",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/847188110/",
    "review": "  In both showing a love and affection of vampire lore while at the same time mercifully lampooning all of it's legends, this bloodsucking documentary is extremely funny and knowing",
    "rating": "40",
    "date": "February 24, 2015"
  },
  {
    "reviewer": "Jacob Z.",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/968923847/",
    "review": "  Wildly funny and goofy. What we do in the shadows also earns strong points for it's likable vamps and faithfulness to the old vampire mythos. Creating something that will please fans of new and old vampires.",
    "rating": "45",
    "date": "February 23, 2015"
  },
  {
    "reviewer": "Tiraap M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/938024280/",
    "review": "  A fresh take on the mokumentary genre of films ! This did what Borat did to a political satire, made it damn fun. A film that doesn't take it too seriously and is far more better than most vampire movies out there, it's a great addition to your movie collection. Don't miss it and even if you did don;t hesitate to own it on dvd. Two thumbs way up!!",
    "rating": "45",
    "date": "February 23, 2015"
  },
  {
    "reviewer": "Kevin L",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/784342193/",
    "review": "  \"Spinal Tap\" meets \"Lost Boys\" in this New Zealand vampire comedy. A couple of brilliant and very quotable moments, which I will be quoting repeatedly, and I think that's all you can ask for from a little movie like this. Tons of fun.",
    "rating": "40",
    "date": "February 22, 2015"
  },
  {
    "reviewer": "Alexei S",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/908514570/",
    "review": "  While definitely not a big budget blockbuster, this film is both witty and hilarious. It's a unique take on the clich� house-mate storyline, while finally making vampires a bearable concept following the Twilight debacle.",
    "rating": "40",
    "date": "February 22, 2015"
  },
  {
    "reviewer": "Chris M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/841799685/",
    "review": "  The premise and performances are great. It's hard to sustain an audience's attention with such absurdity, but they do pretty darned well. Definitely worth checking out!",
    "rating": "40",
    "date": "February 21, 2015"
  }
,
  {
    "reviewer": "Matt A",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/813688728/",
    "review": "  This was hilarious. Exactly what you'd expect from something Jemaine Clement writes and directs. Really really funny and worth the hour and a half or so that you'd give it.",
    "rating": "50",
    "date": "August 2, 2014"
  },
  {
    "reviewer": "Graham D",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/904553449/",
    "review": "  Smart, funny, cost fuck all and still managed to have more romance than Twilight..",
    "rating": "40",
    "date": "February 7, 2015"
  },
  {
    "reviewer": "max h",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/77212495/",
    "review": "  Finally bringing vampires back into the realm of respectability by exposing new abilities and hilariously re-enforcing old ones. Oddly enough, the Kiwi-produced respects the genre so much that this is probably the only bunch of vampires you'd want to hang around with after the movie.",
    "rating": "40",
    "date": "February 19, 2015"
  },
  {
    "reviewer": "Troy K",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/898358222/",
    "review": "  I have tried to watch it twice now. Maybe you need to be on drugs to enjoy it? Some of it is mildly funny and even clever, but mainly it just sucks.",
    "rating": "15",
    "date": "February 17, 2015"
  },
  {
    "reviewer": "Sean L.",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/969060769/",
    "review": "  A few of the jokes fell flat, but most of them were really funny, especially towards the end. That's okay though, because the jokes are wall to wall. It's a refreshing movie, but there's nothing really entirely new here. It's all Christopher Guest style comedy, but that's not a bad thing really. If anything, more people should try and emulate those Christopher Guest movies... instead of being inspired by nothing but the internet, like so many modern day comedies. Which in turn become internet fodder themselves.\"My name is Jeff\". Give me a break Channing Tatum. You're not a comedian.Eh...",
    "rating": "40",
    "date": "February 17, 2015"
  },
  {
    "reviewer": "Andrija M.",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/969060592/",
    "review": "  It is funny and original",
    "rating": "45",
    "date": "February 17, 2015"
  },
  {
    "reviewer": "Ryan B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/889395996/",
    "review": "  Best comedy of the year.",
    "rating": "45",
    "date": "February 16, 2015"
  },
  {
    "reviewer": "Adit Y",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/875723759/",
    "review": "  The best horror comedy since Shaun of the Dead...Hilarious stuff..",
    "rating": "35",
    "date": "February 16, 2015"
  },
  {
    "reviewer": "Craig F",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/907233324/",
    "review": "  Hysterically funny, clever, and original; I found myself laughing throughout.",
    "rating": "40",
    "date": "December 29, 2014"
  },
  {
    "reviewer": "Steve H.",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/969042133/",
    "review": "  Incredibly hilarious, the best 'mockumentary' I've ever seen - and the best comedy I've seen in years.",
    "rating": "50",
    "date": "February 16, 2015"
  },
  {
    "reviewer": "Garrett J",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/939960460/",
    "review": "  The best genre mockumentary since This is Spinal Tap.",
    "rating": "45",
    "date": "February 15, 2015"
  },
  {
    "reviewer": "Tihana D",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/898626836/",
    "review": "  Adorable, fresh...with bunch of lovable, kooky vampires lurking around! :)",
    "rating": "50",
    "date": "February 15, 2015"
  },
  {
    "reviewer": "Chris P",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/785124393/",
    "review": "  Sort of a combination of This is Spinal Tap and Cabin in the Woods. Rhys Darby plays a great werewolf.",
    "rating": "40",
    "date": "February 15, 2015"
  },
  {
    "reviewer": "Bradley S",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/782794006/",
    "review": "  As a fan of Flight of the Concords, I knew this would a great movie but I didn't expect it to be the funniest movie I've ever seen. I can't remember a movie that made me laugh this much. In fact, I've never heard a theatre laugh so much before. The jokes are clever and they don't get old. Kept me laughing from the beginning to end. My abs are still sore from laughing so much. I hope it's released in more theatres so everyone get's a chance to watch this brilliant film.",
    "rating": "50",
    "date": "February 13, 2015"
  },
  {
    "reviewer": "Peter F",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/782851126/",
    "review": "  Only the Flight of the Conchords creators could deliver a vampire-comedy that's as fresh and funny as this one. What We Do in the Shadows uses the tried-and-true mockumentary style to great effect, making the most of the film's small budget. Of even more merit is the film's acknowledgment of vampire lore and history, which is the humor a more subversive edge. Perhaps not as re-watchable as their beloved HBO series, but Clement and Waititi show that they still have plenty of absurdly great ideas in their head here.",
    "rating": "40",
    "date": "February 15, 2015"
  },
  {
    "reviewer": "ZACHO D",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/29267126/",
    "review": "  Hilarious and insane! It's a film that's a lot of fun with a lot a laughs throughout. It doesn't suck...and it does ;D",
    "rating": "40",
    "date": "February 15, 2015"
  },
  {
    "reviewer": "Taryn D.",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/952816019/",
    "review": "  One of my favorite comedies of recent years.",
    "rating": "50",
    "date": "December 30, 2014"
  },
  {
    "reviewer": "Kelly C",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/963162091/",
    "review": "  This looks hilarious. I hope it comes near me. :)",
    "rating": "wts",
    "date": "February 14, 2015"
  },
  {
    "reviewer": "Jack M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/969012856/",
    "review": "  This movie is terrible. Don't waste your time watching it.",
    "rating": "05",
    "date": "February 14, 2015"
  }
,
  {
    "reviewer": " .",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/968022104/",
    "review": "  What we do in the Shadows is a hilarious comedy that has lasting potential. Is so eloquently made, yet so pompous and ridiculous that it simply eases you into a nice film going experience. And then it kills you. Honestly, I could barely contain myself. Even the first scene of Viago coming out of his coffin was practically genius. I like how they incorporated and ridiculed so many vampire cliches. Petyr was also very hilarious and this is one of Jemaine Clements' best roles. From start to finish it is a belly full-a laughs. Rhys Darby is also extremely funny as the lead of the werewolf pack. Some may criticise the hand-held camerawork and the bleak aesthetic, but I think you're missing the point. In fact that is the whole point of them. The film actually opens it's mouth to vampire teeth and sucks Hollywood dry",
    "rating": "40",
    "date": "February 14, 2015"
  },
  {
    "reviewer": "Mark V",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/800147794/",
    "review": "  Smart, Silly, Funny, Twisted. I loved it",
    "rating": "40",
    "date": "February 14, 2015"
  },
  {
    "reviewer": "incz",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/898064669/",
    "review": "  boring and not interesting",
    "rating": "10",
    "date": "February 14, 2015"
  },
  {
    "reviewer": "Nelson A",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/799895033/",
    "review": "  This movie is pure gold. An instant classic!",
    "rating": "50",
    "date": "February 13, 2015"
  },
  {
    "reviewer": "Kong M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/907295692/",
    "review": "  Sheer Genius. Brilliant. For an overdone vampire genre, WWDITS brings us the most original and honest vampire experience. Every scene felt like it was so well thought out in the most creative way to keep the audience guessing and laughing at the same time. I can tell this was a script that was fun to write. This goes down as one of my favorite vampire movies of all time. A cult classic and a must see.",
    "rating": "50",
    "date": "February 13, 2015"
  },
  {
    "reviewer": "Jackie S",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/949195627/",
    "review": "  Exceptionally funny and original. Loved it. I'm a huge fan of FOTC.",
    "rating": "45",
    "date": "February 13, 2015"
  },
  {
    "reviewer": "Yifan C",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/904025001/",
    "review": "  Flight of the Conchords nostalgia.",
    "rating": "40",
    "date": "February 12, 2015"
  },
  {
    "reviewer": "Magnus S",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/885747644/",
    "review": "  Consistently amusing if not laugh out loud funny.",
    "rating": "35",
    "date": "February 12, 2015"
  },
  {
    "reviewer": "Ioana T",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/937193921/",
    "review": "  Ain't easy being a vampire, but it's funny as hell to watch.",
    "rating": "45",
    "date": "February 12, 2015"
  },
  {
    "reviewer": "David M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/928980984/",
    "review": "  Hilarious! U dlho som nevidel tak skvel� kom�diu...Yeah some of our clothes are from victims. You might bite someone and then, you think, 'Oooh, those are some nice pants!' :D",
    "rating": "50",
    "date": "February 12, 2015"
  },
  {
    "reviewer": "Aaron M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/942286919/",
    "review": "  100% Hysterical from start to finish. It will make you laugh so hard you'll fall to the floor crying. What We Do In The Shadows is a smart and hilarious parody of the supernatural mythos and found footage horror films. Possibly the funniest film all year.",
    "rating": "50",
    "date": "February 12, 2015"
  },
  {
    "reviewer": "Alex S",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/904329121/",
    "review": "  I might not be with the majority, but if you call a silly, poorly produced flick with often overacting actors making a high-school-level jokes a comedy you did not see a real comedy.",
    "rating": "30",
    "date": "February 11, 2015"
  },
  {
    "reviewer": "Edward B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/782887915/",
    "review": "  Great Great Great!! Very funny!! I found myself laughing more often than not!!",
    "rating": "45",
    "date": "February 11, 2015"
  },
  {
    "reviewer": "Fabiano C",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/893597509/",
    "review": "  This movie is not only hilarious, but it can also be very touching at times. By far the best vampire movie of the decade. By far. Screw you, Twilight.",
    "rating": "50",
    "date": "February 11, 2015"
  },
  {
    "reviewer": "Adrie L",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/913935149/",
    "review": "  Absolutely hilarious! Love the dry NZ humor. Docu-comedy greatness.",
    "rating": "50",
    "date": "February 11, 2015"
  },
  {
    "reviewer": "Kristian H",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/821785299/",
    "review": "  Funniest movie in ages !",
    "rating": "50",
    "date": "February 11, 2015"
  },
  {
    "reviewer": "Pete R",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/838491838/",
    "review": "  ahh Petyr got him, poor guy....",
    "rating": "50",
    "date": "February 10, 2015"
  },
  {
    "reviewer": "Liza B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/968948648/",
    "review": "  I'm a Kiwi, and have already seen this, and can definitely say it deserves to be certified fresh! Fantastic movie from a flippin' brilliant cast.",
    "rating": "45",
    "date": "February 10, 2015"
  },
  {
    "reviewer": "Koash J",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/968946236/",
    "review": "  Absolute Genius! A MUST See! 5/5",
    "rating": "50",
    "date": "February 10, 2015"
  },
  {
    "reviewer": "Private U",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/792092866/",
    "review": "  best 2014/2015 comedy / mocumentary ! must watch",
    "rating": "50",
    "date": "February 10, 2015"
  }
,
  {
    "reviewer": "Talie T",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/788156103/",
    "review": "  Funniest movie I've seen in a long long time.",
    "rating": "50",
    "date": "February 10, 2015"
  },
  {
    "reviewer": "Nigel M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/905654693/",
    "review": "  Mildly amusing, but nowhere near as funny as it thinks it is.",
    "rating": "25",
    "date": "January 20, 2015"
  },
  {
    "reviewer": "Jeremy B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/911416179/",
    "review": "  Yes, it's that good! The vampire genre sure has lost it's bite over the years, but this comedy is out for blood, fang you very much. It plays like a mashup of all vampire sub-genres and the office, where we get to wax nostalgic with some of pop-cultures most enduring icons; leading to a fun if familiar trip down memory lane.. New Zealand has become one of the worlds leading exporters of quality films.",
    "rating": "45",
    "date": "February 9, 2015"
  },
  {
    "reviewer": "Jeremy H",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/851180721/",
    "review": "  Brilliant and fun. warm and not overly cheeky",
    "rating": "50",
    "date": "February 9, 2015"
  },
  {
    "reviewer": "Brian F",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/846654181/",
    "review": "  What the hell happened to Bret?",
    "date": "February 5, 2015"
  },
  {
    "reviewer": "Kevin R",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/944281216/",
    "review": "  This is definitely on my calendar for 2/13.",
    "rating": "wts",
    "date": "February 8, 2015"
  },
  {
    "reviewer": "filmlover1994",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/932029584/",
    "review": "  My Favorite Comedy Film Is 1933's Duck Soup.",
    "rating": "20",
    "date": "February 8, 2015"
  },
  {
    "reviewer": "Hayden G",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/878116499/",
    "review": "  Way better than it has to be! This is another one of those silly ideas taken to it's logical extremes, and it's hilarious.",
    "rating": "35",
    "date": "February 8, 2015"
  },
  {
    "reviewer": "Dillon S",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/787567054/",
    "review": "  A breath of fresh air for both the vampire and satire genres",
    "rating": "50",
    "date": "February 4, 2015"
  },
  {
    "reviewer": "Nihal G",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/792102179/",
    "review": "  \"We're werewolves, not swearwolves!\"What We Do In The Shadows channels all the parody and sucking jokes, while still keeping the glorious vampire tradition intact. From the dialogue, you must've also realised that there are other monsters in the film (zombies and werewolves). There are numerous references to the classics, from Nosferatu to Dracula and even Interview with a Vampire!This is a mockumentary you cannot miss. I watched it twice, back-to-back, and I still laughed my guts out (pun intended) both times.",
    "rating": "45",
    "date": "February 4, 2015"
  },
  {
    "reviewer": "Xavier O",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/903570068/",
    "review": "  I go for a look I call \"Dead but Delicious.\"",
    "rating": "wts",
    "date": "February 3, 2015"
  },
  {
    "reviewer": "Samuel H",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/877771731/",
    "review": "  All you have to know is that Jermaine Clement is in the movie and you should be sold. What We Do In the Shadows, is stupid comedy, but it has it's moments. It's also pretty violent for the type of movie it is.",
    "rating": "35",
    "date": "January 31, 2015"
  },
  {
    "reviewer": "bill b",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/725749922/",
    "review": "  It is indeed very clever!! and enjoyable",
    "rating": "35",
    "date": "February 3, 2015"
  },
  {
    "reviewer": "Skyler G",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/28139572/",
    "review": "  What We Do in the Shadows (2015) - I've spoken time and time again about my growing distaste in the modern comedy genre. It's gross, un-creative and mostly recycles the same bland jokes, leaving me with the same bad after-taste one would get from eating at a junky fast food chain. So low and behold, what I would consider one of the funniest movies in recent memory somehow gets released in February of 2015... Who knew? Mostly known for their work on \"Flight of the Concords\", Jermaine Clement and Taika Waititi direct and stars (along with other Concords regulars) in this horror comedy. Shot in a \"mockumentary\" style ala \"This is Spinaltap\", the film centers around the hijinx of four room-mates who deal with everyday problems like: who's on dish duty, paying the rent, going out clubbing... Oh, and did I mention they're vampires?... From it's opening moments, the movie introduces its characters and world and wastes no time at all making you laugh. Each character in the film represents a personification of the classic monster from different eras of writing, lending to a culturally diverse set of immortally aged characters which plays into the fun. The movie basically runs on one joke, it just so happens that the one joke is so damn funny it'll have you in stitches until your nose bleeds. My immediate take away from the movie overall was in how likeable this cast is. Make no mistake, these are vicious killers and monsters... But my god are they charming. This is thanks in large part to the devoted cast, who are equally having fun with their respective roles while also bleeding some of their own likeable personalities into the characters. Fake bad accents and all, you completely buy this New Zealand based lot as creatures of the night.With that said, the movie isn't without its detriments. The \"mockumentary\" shooting style both helps and holds back the film from potentially utilizing some of its gags more effectively. Though I did have fun with the characters interacting with the camera-man, thus breaking the fourth wall... It does suffer a little from the \"found footage\" symptom of \"why are they shooting this now? Why isn't this shot normally?\". The visual effects are very simple but get the job done well enough and in most cases actually make the situations more funny. The real issue here lies in the almost transparent plot. As I said, the movie runs on essentially one really well told joke which results in the film losing steam in its third act. The pay-off doesn't feel quite a strong as the set-up which dilutes the experience slightly as a whole.With that said, I do strongly urge everyone to check this movie out whenever it becomes available to you because it's rare that you get a comedy this well executed and dare I say \"smart\". It re-introduces vampire lore in hilariously situational ways that will have both the horror and comedy fans grinning ear to ear. It's charming, cute while also not pulling any punches with grit and gore. Not since \"Shaun of the Dead\" has horror and comedy come together this well, it'll have you laughing all the way to your coffin.GRADE: B+",
    "rating": "40",
    "date": "February 3, 2015"
  },
  {
    "reviewer": "Scott R",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/791390197/",
    "review": "  This is all I needed to know: \"...creators of the HBO hit series \"Flight of the Conchords,\" co-wrote, co-directed, and co-star in this hilarious send-up in which an endearingly unhip quartet of friends reveal to us or, rather, to the documentary crew that's filming them, the details of their daily-make that nightly-routine.\"",
    "rating": "wts",
    "date": "February 2, 2015"
  },
  {
    "reviewer": "Paul S.",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/966893720/",
    "review": "  It's been a long time since I laughed so hard during a movie. Great fun by all the cast.",
    "rating": "50",
    "date": "December 30, 2014"
  },
  {
    "reviewer": "Leigh H",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/793124762/",
    "review": "  Some people love documentaries, some people despise them, myself I'm somewhat in the middle, of course the subject has to interest me somewhat for me to even take a look at. Mockumentaries on the other hand I love (when done well) When it comes to mockumentaries, anything and everything goes, there are no real rules, as long as it's somewhat believable, interesting and makes us laugh usually a mockumentary is well received. Give anything some interesting characters and a reality storyline and it's usually enough to make us want to watch. I personally had never heard of \"What we do in the shadows\" until a friend asked me my thoughts, after watching the trailer I had the film in no time ready to watch.Viago, Deacon, Petyr and Vladislav are four housemates who rent a property in New Zealand, they have lived together for a very long time and know all there is to know about each other, the guys have one thing in common; they are all vampires and each of them is between 100 and 300 years old, never aging from the time they were originally turned. The film follows three of the group as they go about their daily business from their eating habits to their cleaning habits even introducing us at one point to their enemies. Along the way they meet Nick who is turned and decide they need to show him their world and how to survive it on a day to day basis.What we do in the shadows is a laugh a minute, literally. Line after line of jokes, wit and humour never end. Being a mockumentary film the character development is quite strong, you do actually end up feeling sorry and getting involved in each of their lives and the journey they undertake. I personally thought the characters were fantastic, each had their quirks and quips which made them stand out for their own reasons. Starring Jemaine Clement (Eagle Vs Shark, Flight of the Conchords) as Vladislav. Taika Waititi (Eagle vs Shark, Boy) as Viago. Jonathan Brugh (How to meet girls from a distance) as Deacon. Ben Fransham (30 Days of Night, The Ferryman) as Petyr and Cori Gonzalez-Macuer (Eagle vs Shark) as Nick. The guys were brilliant, funny and captivating, never taking themselves too seriously but seriously enough to engage you in their mishaps and adventures.The film is based around a short film made by the same people in 2006, being a mockumentary the camera work is pretty much hand held camera work, but it works well in its style and you never feel you're missing anything. The directors, writers and actors who all worked together have done an outstanding job in making some good fun lighthearted entertainment. Not really one for the younger kids and the teens won't really get all the hidden jokes throughout but I think mums and dads who have a slightly warped sense of humour will love it.",
    "rating": "35",
    "date": "January 31, 2015"
  },
  {
    "reviewer": "Venetia D",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/790345089/",
    "review": "  It was simple. And hilarious. And mockingly so.",
    "rating": "30",
    "date": "January 30, 2015"
  },
  {
    "reviewer": "Muntakim H",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/815354100/",
    "review": "  AWESOME!!!!!!!!!!!!!!!!!!!",
    "rating": "50",
    "date": "January 30, 2015"
  },
  {
    "reviewer": "David C",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/306248179/",
    "review": "  estos wampiros si me gustan matarile rile ron",
    "rating": "40",
    "date": "January 26, 2015"
  }
,
  {
    "reviewer": "Rini H",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/818450990/",
    "review": "  Why isn't his showing EVERYWHERE? in the U.S.? :-(Finally found it and saw it! Even better than I expected. The visual detail and ancient feel that the vampires had only made the comedy more hilarious. It was done so well. Let's just say that Stu .. and Nick had quite an experience. :-)",
    "rating": "45",
    "date": "April 30, 2014"
  },
  {
    "reviewer": "Andy T",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/892624429/",
    "review": "  \"What We Do In The Shadows\" is a hilarious documentary that follows the lives of five vampires living in a New Zealand home. Full of laughs and quotable lines this film has no dull moments and is a unique take on the vampire/supernatural genre, making it a must watch.",
    "rating": "40",
    "date": "January 25, 2015"
  },
  {
    "reviewer": "Luciano G",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/894774639/",
    "review": "  Some force acting,a great idea, well executed for the most part, but a film that could possibly have benefited from being far more concise so as to not dilute the impact of the general concept....",
    "rating": "10",
    "date": "January 25, 2015"
  },
  {
    "reviewer": "JJ M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/905754701/",
    "review": "  Glorious comedy. Highly recommended if you liked Flight of the Conchords",
    "rating": "40",
    "date": "January 23, 2015"
  },
  {
    "reviewer": "Damien C",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/789190439/",
    "review": "  The sandwich line was a standout, brilliant delivery. Average film though.",
    "rating": "20",
    "date": "January 23, 2015"
  },
  {
    "reviewer": "Alfin N",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/881538577/",
    "review": "  Vampires with sense of humor.",
    "rating": "30",
    "date": "January 22, 2015"
  },
  {
    "reviewer": "Andres V",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/792120379/",
    "review": "  Divertido documental falso sobre la vida de unos vampiros que comparten un apto en Nueva Zelanda. Personajes muy bien elaborados hacen que resulte muy graciosa la narraci�n. Lleva todo el sabor de \"Flight of the Conchords\".",
    "rating": "40",
    "date": "January 19, 2015"
  },
  {
    "reviewer": "Ana B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/859040565/",
    "review": "  A weird mix of documentary film and the Twilight saga, this is the story of a household of vampires told by the vampires themselves in a series of interviews interleaved with \"real action\" scenes. In a humorous manner we get to see their day to day problems, their personalities, their friends and their enemies (the werewolves) just like they were real characters.An off the wall comedy that has true originality the movie is charming and \"believable\" despite the preposterous subject matter, maybe is the good doing of the actors or the well weaved storyline. In any case it is an entertaining film that takes the mickey out of the Twilight saga in a very funny way, ideal for lovers of sophisticated and irreverent humour.",
    "rating": "35",
    "date": "January 19, 2015"
  },
  {
    "reviewer": "Sarah H",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/830779426/",
    "review": "  Surprisingly funny. There are some epic scenes in this that are somewhat unexpected from a mocumentary.",
    "rating": "30",
    "date": "January 19, 2015"
  },
  {
    "reviewer": "Lian C",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/920752602/",
    "review": "  Ridiculous mockumentary about a group of vampires who share a flat in Wellington, New Zealand. Lots of hilarious moments. A real treat, especially for Flight of the Conchords fans.",
    "rating": "40",
    "date": "January 18, 2015"
  },
  {
    "reviewer": "Bruno S",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/932402716/",
    "review": "  Very entertaining quasivampire movie. Excellent effects for budget. Great acting, great music.",
    "rating": "45",
    "date": "January 18, 2015"
  },
  {
    "reviewer": "Gavin P",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/797827800/",
    "review": "  A pretty good Kiwi comedy, with a splash of horror thrown in for good measure. Waititi, Clement, Brugh & Gonzalez-Macuer are good as the vampires trying to 'live' inconspicuously in Wellington. Interesting choice to film it as a 'documentary', but it works, especially with the run-ins with the werewolves (needed more Rhys Darby!). Quick, original & lots of sight gags, but it's not quite up there with Shaun of the Dead as a horror-comedy.",
    "rating": "35",
    "date": "January 17, 2015"
  },
  {
    "reviewer": "Luis V.",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/967211111/",
    "review": "  That house makes 50% of the film, recommended.",
    "rating": "40",
    "date": "January 17, 2015"
  },
  {
    "reviewer": "Orlok W",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/920766351/",
    "review": "  If you thought vampire movies had reached saturation point, think again, because What We Do In The Shadows manages to lend it a thankfully comical bent. Taika Waititi and Jermaine Clement lead a solid cast of Kiwi actors playing a small group of inept but lovable bloodsuckers living in a flat together in Wellington--The comedy horror is so hard to get right. Then using the Vampire genre and the equally overused mockumentary style you are pushing a boulder up hill. So the mere fact that this film feels fresh and leaves me wanting more is more than a poke, yes there is more than a poke, in the right direction... Sometimes the scariest thing about being a vampire is doing the dishes!!",
    "rating": "25",
    "date": "January 17, 2015"
  },
  {
    "reviewer": "Syed S",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/936461807/",
    "review": "  Flat out Hilarious!!",
    "rating": "45",
    "date": "January 17, 2015"
  },
  {
    "reviewer": "Em F",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/965467528/",
    "review": "  Very good. Great idea.",
    "rating": "40",
    "date": "January 17, 2015"
  },
  {
    "reviewer": "Amie M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/968577841/",
    "review": "  MTV's Real World: Night Walkers Edition",
    "rating": "wts",
    "date": "January 16, 2015"
  },
  {
    "reviewer": "Rafael S",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/803450028/",
    "review": "  best mockumentary ever.",
    "rating": "50",
    "date": "January 15, 2015"
  },
  {
    "reviewer": "Weiting T",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/880200308/",
    "review": "  hilarious! The best comedy in 2014.",
    "rating": "50",
    "date": "January 15, 2015"
  },
  {
    "reviewer": "Paul B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/793575898/",
    "review": "  One of the funniest movies I've seen in years. In the line of \"Shaun of the Dead\" vampire comedy with a hysterical cast, great effects and one liner after one liner of moments to be remembered. The main character Viago has such a presence and the rest of the cast highlights every moment (and Peter the room mate). From the writers of \"Flight of the Concords\", I never would have expected something I enjoyed this much. Highly recommend! And I wish so much that one day this becomes a TV Series!",
    "rating": "50",
    "date": "January 15, 2015"
  }
,
  {
    "reviewer": "Philippe L.",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/968544149/",
    "review": "  Creative and well judged. Entertaining and fun.",
    "rating": "40",
    "date": "January 14, 2015"
  },
  {
    "reviewer": "Cameron H",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/864205516/",
    "review": "  The most fun you will have watching a movie this year!!!!",
    "rating": "45",
    "date": "January 13, 2015"
  },
  {
    "reviewer": "Nick S",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/794231057/",
    "review": "  This film was better than expected, and Taika Waititi was great fun to watch playing the slightly camp vampire head of the house. About time there was a proper sendup of vampires and here it is.",
    "rating": "45",
    "date": "January 12, 2015"
  },
  {
    "reviewer": "Stanley F",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/938301695/",
    "review": "  I'm hard to please with funnies.A film usually has to make me laugh out-loud 6+ times and stay in my mind to even qualify AS funny.\"What we do..\" has well-drawn characters, snappy script and follows the modern \"mock-umentary\" line. It adds a worthy post-script to the gush of un-worthy Vampires flicks of recent years by taking the piss but also making some good cinematic moments in a film that holds together,and is more than just a gag-fest.Think what \"Shaun of the dead\" did for the Zombie genre and you won't go far wrong. It's also set in Wellington, NZ. Genius.",
    "rating": "40",
    "date": "January 12, 2015"
  },
  {
    "reviewer": "Cesia Z.",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/968404759/",
    "review": "  Hilariously absurd - everything I like.",
    "rating": "45",
    "date": "January 11, 2015"
  },
  {
    "reviewer": "David B.",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/958510992/",
    "review": "  A mockumentary about vampires. Funny in parts, though far too long. Christopher Guest has nothing to worry about.",
    "rating": "30",
    "date": "January 11, 2015"
  },
  {
    "reviewer": "Drago? C",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/832651162/",
    "review": "  A hilarious vampire mockumentary in the vein of Chrstopher Guest classics. Set in New Zealand. Featuring Jermaine Clement. What more can you ask for? Highly recommended to fans of mockumentaries.",
    "rating": "40",
    "date": "January 11, 2015"
  },
  {
    "reviewer": "J X",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/791182379/",
    "review": "  tal vez de las mejores pel�culas de vampiros que haya visto jaja est� genial...",
    "rating": "50",
    "date": "January 10, 2015"
  },
  {
    "reviewer": "Jules H",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/787539162/",
    "review": "  Brilliant! The Kiwi's have nailed it in this laugh out loud black comedy. Can't wait to watch it again.",
    "rating": "50",
    "date": "January 10, 2015"
  },
  {
    "reviewer": "D&#xFFFD;vid U",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/839245160/",
    "review": "  Rozpacity uvod vynahradzuje vyborny zaver",
    "rating": "35",
    "date": "January 10, 2015"
  },
  {
    "reviewer": "Callum H",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/933002954/",
    "review": "  Not as funny as I'd desire, but nevertheless insanely enjoyable and witty; a delightfully inventive comedy.",
    "rating": "35",
    "date": "January 10, 2015"
  },
  {
    "reviewer": "Zachary Y",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/838934810/",
    "review": "  Absolutely hilarious. From Jemaine Clement \"flight of the Conchords\", its a reality show vampire farce which adresses the ridiculousness of the vampire craze. Easily one of the best comedies of 2014.",
    "rating": "45",
    "date": "January 9, 2015"
  },
  {
    "reviewer": "ihatethefactiamnewhere",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/906632768/",
    "review": "  A genuinely funny movie.",
    "rating": "40",
    "date": "January 6, 2015"
  },
  {
    "reviewer": "Katya E",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/808631619/",
    "review": "  so awesome, and i usually hate this sort of films. really funny and clever",
    "rating": "50",
    "date": "January 9, 2015"
  },
  {
    "reviewer": "Steve T",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/795212995/",
    "review": "  Werewolves, not swearwolves!",
    "rating": "35",
    "date": "January 8, 2015"
  },
  {
    "reviewer": "David C",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/793501112/",
    "review": "  One of the best horror spoofs to come out in awhile and a delightfully self-aware mockumentary that will no doubt see a sequel.",
    "rating": "40",
    "date": "January 7, 2015"
  },
  {
    "reviewer": "Angust M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/794572438/",
    "review": "  Curioso producto, extra�o donde los haya. Me reconozco fan de Jemaine, y por lo tanto me hizo bastante gracia.",
    "rating": "30",
    "date": "January 7, 2015"
  },
  {
    "reviewer": "Kurt B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/787790350/",
    "review": "  Strangely absurd, ridiculously funny.",
    "rating": "30",
    "date": "January 7, 2015"
  },
  {
    "reviewer": "Ryan J",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/797139540/",
    "review": "  A documentary crew follow around a group of vampires living together in a share house in Wellington, New Zealand. We see how they live, eking out a life in the dark, trying to find people to feed on, party in trendy nightclubs and argue over who does the housework. When the Nosferatu-like Petyr turns Nick, a potential meal, into one of the undead, they find it a challenge to teach him the ways of eternal life. This film has its moments, it has quite a few belly laughs but even at 70 minutes, the one note premise feels quite stretched. It's a good film but it could have been better. Still worth a watch though.",
    "rating": "30",
    "date": "January 7, 2015"
  },
  {
    "reviewer": "Brad L",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/820817491/",
    "review": "  The joke is hilarious and even though it can wear thin, they manage to keep it fresh and funny! If you like documentaries or vampire lore, don't miss this one.",
    "rating": "35",
    "date": "January 6, 2015"
  }
,
  {
    "reviewer": "Tash Petry K",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/906108473/",
    "review": "  There hasn't been a film in a long while that has made me laugh from start to finish, What We Do In The Shadows is a film with more charm than a lot of modern comedies.What We Do In The Shadows is a 'mockumentary' set in New Zealand focusing on four different archetypal Vampires living in a Wellington sharehouse.With very office inspired scenes it's hard to look away from the roar of flamboyancy. Charismatic Viago (Taika Watiti) leads us through the nest of the quartet and their daily problems weather it be chores, fashion choices or looking after new recruits.This film bring a new flare to the 'mockumentary' genre and is definitely flowing with original charm, I recommend \"What We Do In The Shadows' to anyone who loves comedy, horror and of course vampires.",
    "rating": "50",
    "date": "January 6, 2015"
  },
  {
    "reviewer": "Jeff G",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/905447756/",
    "review": "  This is a must see great movie. Some people seem to think this won't be a cult classic but I disagree! For anyone who can truly appreciate a hilarious movie which is made specifically to humor and entertain people, and has no other hidden agenda whatsoever, this is definitely a must watch.This movie will have you falling out of your chair laughing.",
    "rating": "50",
    "date": "January 6, 2015"
  },
  {
    "reviewer": "Stephen D",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/812356858/",
    "review": "  Narratively it's a scattershot affair of loosely stitched together sketches, which is a bit of a shame. But if you're willing to forgive that you'll find an inventive mockumentary filled to the brim with clever visual ideas and instantly classic one-liners.",
    "rating": "35",
    "date": "January 6, 2015"
  },
  {
    "reviewer": "Cesare M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/910940926/",
    "review": "  It has moments of wit and genuine fun but the fake documentary style is worn-out",
    "rating": "30",
    "date": "January 5, 2015"
  },
  {
    "reviewer": "Michele T",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/937310759/",
    "review": "  Best laugh out loud film I have seen in ages...and I am really hard to please!",
    "date": "January 5, 2015"
  },
  {
    "reviewer": "Rainer D",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/805287665/",
    "review": "  Eine herrlich-skurrile WG-Story im Doku-Soap-Stil.",
    "rating": "40",
    "date": "January 4, 2015"
  },
  {
    "reviewer": "Leo D.",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/905281407/",
    "review": "  Astute , insightful , funny and smart , the magic of this film lies in the documented reality of a fantasy world.",
    "rating": "45",
    "date": "January 1, 2015"
  },
  {
    "reviewer": "Scott W",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/908366200/",
    "review": "  By far the funniest film I've seen in a long time. Was laughing the entire length of the film. Hopefully these guys continue to get decent budgets",
    "rating": "45",
    "date": "January 1, 2015"
  },
  {
    "reviewer": "Ian C",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/947609447/",
    "review": "  This is one of the funniest comedies that I have seen in years. So fucking funny. The gags are great, as are the characters. The whole mockumentary style makes you think of what Nigel Tufnel, Derek Smalls and David St. Hubbins would be like if they were vampires.",
    "rating": "50",
    "date": "January 1, 2015"
  },
  {
    "reviewer": "Garry A",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/948344304/",
    "review": "  Some cracking films coming out of NZ at the moment and this is another as well as one of my faves of the year.",
    "rating": "45",
    "date": "December 31, 2014"
  },
  {
    "reviewer": "Federico E",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/820299273/",
    "review": "  :D fun mixture of mockumentory and the series Being Human. :D and it works hahaha",
    "rating": "40",
    "date": "December 29, 2014"
  },
  {
    "reviewer": "Harlee M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/911356044/",
    "review": "  I was expecting little and got an amusing tale. Many little jokes from beginning to end. Great show.",
    "rating": "45",
    "date": "December 28, 2014"
  },
  {
    "reviewer": "Martin I",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/260491472/",
    "review": "  A great little mockumentary on everything vampires and Twilight that, although thin in overall premise, is full of subtle gags and a few very funny howlers.*Full Review Pending*",
    "rating": "40",
    "date": "December 27, 2014"
  },
  {
    "reviewer": "Chantal v",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/890329300/",
    "review": "  Well this is the surprise of the year, in my opinion. There's a funny line just about every two minutes and it's somehow very original, which is quite a feat in the drained (heheh) vampire genre. Very enjoyable.",
    "rating": "40",
    "date": "December 27, 2014"
  },
  {
    "reviewer": "Jasmin P",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/803921582/",
    "review": "  Forget all other vampire movies!",
    "rating": "50",
    "date": "December 27, 2014"
  },
  {
    "reviewer": "Pablo G",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/962828500/",
    "review": "  Plain hilarious and creative, this film proves to be one of the best combinations of horror themes and imagery with great mockumentary based comedy, providing some truly awesome characters and situations that are well written and told, making the whole movie feel very organic and still varied enough in the process of telling the story of some vampires in the modern age.",
    "rating": "40",
    "date": "December 24, 2014"
  },
  {
    "reviewer": "Nick C",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/960828942/",
    "review": "  Very funny indeed - well worth a watch.",
    "rating": "40",
    "date": "December 20, 2014"
  },
  {
    "reviewer": "Phil H",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/789814099/",
    "review": "  When you think of New Zealand there are certain things that spring to mind, unfortunately most of those things now tend revolve around Hobbits. Despite New Zealand being used as the backdrop for Tolkien's fantasy world its still not really the first place you'd associate with vampires, especially vampires living in the suburbs of Wellington. So it was admittedly kinda surprising to see a vampire movie emerge from the island of Kiwis, but not just a vampire movie...a vampire comedy mockumentary.Put basically this film takes the popular reality TV concept and blends it with the popular slightly romantic vision of vampires (Anne Rice type vampires) whilst also adding other ghouls and mythical creatures in a bare bones hyperbole of blood. A camera crew stays in a decrepit house with four vampires and follows their daily routines trying to exist in the present day. The film crew have been given special permission to film these ancient creatures of the night as they prepare for a special event, a special ball...the crew were also given assurance they wouldn't be eaten.The four vampires are a mixed bunch from the distant pages of time. Viago (379 years old) is the main vampire who talks to us most of the time, he was an 18th century dandy, a wealthy man who is prim proper and pedantic and likes the house clean and tidy (the Lestat de Lioncourt of the bunch). Deacon is the bad boy of the group...or so he likes to think (183 years old). He's the young rebellious rock n roll leather pant wearing vampire who thinks he's hot stuff, the irony being he clearly isn't. 'If you were a Nazi after the war...uh-uh''If you were a vampire'...*shakes head*'If you were a Nazi vampire! no way!! I was outta there!'Vladislav is the second eldest vampire (862 years old) who grew up during the medieval ages and was a tyrant. He's the most dated and out of touch vampire, HE is the sexual deviant of the bunch, the ladies man. His appearance is more in line with the traditional romantic vampiric appearance (the Gary Oldman/Coppola vampire of the bunch). Then lastly there is Petyr who is the eldest vampire at 8000 years of age. This guy is obviously a homage to the Count Orlok character in the F.W. Murnau film 'Nosferatu'. He doesn't say anything but merely nods or hisses and is virtually more animalistic or creature-like than the others.So apart from the usual vampire-esque things you'd expect to see what is different about this movie? Well for one its all filmed with hand held cameras because its a reality show, not exactly a new idea but it makes the whole film look very realistic in terms of a reality show that is. They have clearly gone out and about in Wellington and filmed on the fly with real unknowing people which makes things more intriguing and fun. In fact its hard to tell at times if the people we see are in the movie or simply real folk unaware they are being filmed.Some of the main things that really stand out are the extremely humorous little chats the vamps have with the cam crew (ala Big Brother) as they bicker about each other and whine about life in general. It is absolutely hilarious to watch these guys moan and take the piss out of traditional vampire lore turning it into annoying everyday situations. A really clever aspect is the fact vampires don't cast a reflection...so how do they know what they look like? This is clever simply because you've probably never even thought about that. Vampires tend to look very glamorous in certain movies yet how do they know they look glamorous, they might look like shit. So we are presented with a brilliantly funny sequence where these vamps must draw each other in certain attire and make dummies to put the clothes on, so they have an idea of how they will look when they cruise the town at night.'I think we drink virgin blood because...it sounds cool''I think of it like this...if you're going to eat a sandwich...you would just enjoy it more if you knew no one had fucked it'Then there is the issue of how to kill and drain a victim without making a mess on the carpet and furniture. How do they get all their clothes cleaned, washing up all the blood stained cutlery and dishes, how to find victims/virgins, keeping their vampire skills honed, general entertainment, coping with modern technology, flying through windows, trying to hypnotise victims when they're glued to the TV or a laptop and getting to grips with a new vampire and his human friend. The answer to many of these things being a female human slave who acts like a personal secretary with a shopping list of victims which is a fantastic twist. You wouldn't think a film like this would have many special effects and if they did they'd be crappy, but you'd be wrong. OK there aren't lots of effects everywhere, they are sparse, but what we do see is cleverly done and highly effective in a tacky kind of way. We see the vamps flying around and hovering, Viago rises from his bed in that classic vertical manner, the guys change into bats, there are of course classic practical blood effects and most impressively we see the guys able to walk (and fight) up the walls and across the ceiling. One scene in particular shows two of the guys fighting up the walls and across the ceiling in one shot and it really does look fab (a rotating set I'm guessing). I must also add that the sets are really atmospheric too, again clearly basic but they work so well.The only thing I didn't quite like about this movie was the adding of other creatures of the night such as werewolves and zombies especially. I guess the werewolves I can accept but the way they are presented and acted out by the cast just doesn't quite work as well I think. The vampires have a clear distinction between themselves, you can send up different variations of vampires and there is so much you can do. With the werewolves its not really the same, one werewolf doesn't really differ from another, the jokes tend to be childish toilet/animal gags and they don't have any kind of distinctive look, they just look like regular boring humans. Of course once they turn things get a bit more exciting but then you lose the comedy aspect and it obviously becomes more of a genuine horror which you don't really want here. As for other monsters such as zombies that was a step too far for me, that felt like they were pushing it too much. I loved the cast in this film I really did, each of the three main vampires are really well portrayed and highly amusing throughout. In fact I can't even say which vampire was my favourite because they were all tops. Each actor had some very funny dialog and they are all gifted with amusing rubbery faces which helps. I won't lie and say its a perfect film that is full of laugh out loud moments from start to finish...but its damn close. Considering this came out of nowhere, the cast is unknown (to me), its a New Zealand made film (no disrespect) and the budget appears to be small...its a fine comedy that deserves much kudos. Its like...'Spinal Tap' but with vampires.'When you get four vampires in a flat obviously there's going to be a lot of tension, there's tension in any flatting situation'",
    "rating": "40",
    "date": "December 19, 2014"
  },
  {
    "reviewer": "Johnny M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/870021120/",
    "review": "  One of the best comedies I've seen this year. If you get a chance to see this then do! =)",
    "rating": "50",
    "date": "December 17, 2014"
  },
  {
    "reviewer": "Ben T",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/880279210/",
    "review": "  Mockumentary of a group of vampires flatmating in downtown Wellington. 2000 year old is pretty creepy. 2 month old doesnt get the rules of being a vampire. Occasional run in with werewolves . Funny and quirky.",
    "rating": "45",
    "date": "December 16, 2014"
  }
,
  {
    "reviewer": "Paul B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/587531845/",
    "review": "  If Australia gave us the scariest movie of the year with the Babadook then New Zeeland have provided us with the funniest move of the year.Drawing together the creators of the brilliant Flight of the Conchords and starring two of the original cast this mok-doc is hilarious and definitely stands up to repeat viewing. The nods to previous vampire films will please fans of the genre as well as fans of horror comedies such as The Evil Dead and Cabin in the Woods.This didn't get much advertisement upon release so I suggest you find a screening or buy it on DVD as I guarantee it will become a cult classic.",
    "rating": "45",
    "date": "December 15, 2014"
  },
  {
    "reviewer": "Si A",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/794408463/",
    "review": "  Was so good, but it got a bit boring at the very end.",
    "rating": "35",
    "date": "December 10, 2014"
  },
  {
    "reviewer": "Meredith W",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/800871269/",
    "review": "  \"What we do in the Shadows\" has little in way of plot but a whole lot of humour thanks to its mockumentary style. Deadpan comedy and hilarity make for a great movie.",
    "rating": "40",
    "date": "December 6, 2014"
  },
  {
    "reviewer": "Duncan C",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/877944711/",
    "review": "  Funny and charming, in its own quirky way, but even at 80 or so minutes it's a little stretched.",
    "rating": "35",
    "date": "December 3, 2014"
  },
  {
    "reviewer": "Nick H",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/785557753/",
    "review": "  Pretty hilarious all-around... recommend it!",
    "rating": "50",
    "date": "November 30, 2014"
  },
  {
    "reviewer": "Bo J",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/967725988/",
    "review": "  Possibly the funniest film I have seen all year possibly the best film i have seen this film over all perhaps even the best of the year overall.",
    "rating": "50",
    "date": "November 29, 2014"
  },
  {
    "reviewer": "Punyaruk B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/861916411/",
    "review": "  My favourite comedy of the year.",
    "rating": "50",
    "date": "November 28, 2014"
  },
  {
    "reviewer": "Alan W",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/795081994/",
    "review": "  This absurdly funny and very self-conscious/postmodern vampire mockumentary cross-breeds Dracula movies with MTV's The Real World. Set in New Zealand so they have Kiwi-filtered mock Eastern European accents, the result is exactly as you imagined and funnier than it ought to have any right to be. The reason it works is largely due to a witty script with a decent gag quota which takes rules and conventions in the vampire movie genre like they cannot see their reflections in the mirror, or that they can not come in unless they are asked and push them to their logical and surreal conclusions. The writers, well aware that the film can easily drift into a one-joke film stretched out too thin, have kept it sweet and under 90mins. The vampire comedy is hardly a tough category to compete in (as anyone who's even heard of Lesbian Vampire Killers or Dead And Loving It will attest) but we have finally found one where they managed to successfully fused horror with comedy on screen in an unforced and more than dignified manner.",
    "rating": "35",
    "date": "November 28, 2014"
  },
  {
    "reviewer": "Paul H",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/783881112/",
    "review": "  Mildly amusing mockumentary about vampires set in New Zealand. Worth a few titters here and there so worth a watch.",
    "rating": "30",
    "date": "November 26, 2014"
  },
  {
    "reviewer": "Stuart D",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/890817320/",
    "review": "  Had no idea what this was. It's a brilliant comedy.",
    "rating": "45",
    "date": "November 26, 2014"
  },
  {
    "reviewer": "Tim W",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/912496896/",
    "review": "  Short but sweet mockumentary about vampires just doing their thing, trying to live a modern life. It was a silly funny easy watch, but also self aware and nods to other vampire shows. Truly is \"the Spinal Tap of vampire films\".",
    "rating": "35",
    "date": "November 24, 2014"
  },
  {
    "reviewer": "Curtis D",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/937820519/",
    "review": "  One of the funniest and best comedy's i have ever seen, instantly in my top movies and looking to become a cult classic!",
    "rating": "50",
    "date": "November 24, 2014"
  },
  {
    "reviewer": "John W.",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/967633889/",
    "review": "  So unbelievably funny and deadpan and authentically mockumentary where it needs to be - \"Hi, I'm Stuart and I'm a software analyst\". It only gets stronger the longer it goes on and even take the funny away and you have a very dynamic and fully featured pic. Absolutely go and see this.",
    "rating": "45",
    "date": "November 23, 2014"
  },
  {
    "reviewer": "Ross H.",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/967298642/",
    "review": "  Laugh out loud funny and the characters are all amazing.",
    "rating": "50",
    "date": "November 23, 2014"
  },
  {
    "reviewer": "Barry T",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/795283715/",
    "review": "  This was an hilarious mockumentary spoof about a groups of vampires living together in Wellington New Zealand. Its a great deal of fun and very gory in parts. My favourite character was Stu.",
    "rating": "50",
    "date": "November 23, 2014"
  },
  {
    "reviewer": "liz b",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/488871464/",
    "review": "  Charmingly fresh take on both the mockumentary and vampire genres. Good script, priceless expressions. A fun little film!",
    "rating": "30",
    "date": "November 22, 2014"
  },
  {
    "reviewer": "Rebekah F",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/908422292/",
    "review": "  Loved it! Really cheesy, NZ fun. It's always an adventure to see Jemaine Clement. Many great lines, including something like watch your language, we're werewolves, not swear wolves.",
    "rating": "40",
    "date": "November 22, 2014"
  },
  {
    "reviewer": "Carlos M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/891372896/",
    "review": "  This original one-joke comedy is more impressive for its fantastic special effects than for its plot, which begins belly-achingly hilarious but then starts to slowly wear off as the novelty gives place to familiarity, proving that some ideas work better when made into short movies.",
    "rating": "35",
    "date": "November 10, 2014"
  },
  {
    "reviewer": "St. A",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/795276892/",
    "review": "  A cross between Spinal Tap and horrible reality TV shows, this is a very entertaining comedy where at times just when you think the joke may start to wear thin, it'll make you laugh thanks to a witty one liner or a funny situation. Definitely one that will get better with repeated viewings, especially with an audience or a group of friends.",
    "rating": "40",
    "date": "November 10, 2014"
  }
,
  {
    "reviewer": "Shane D",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/788603463/",
    "review": "  Hilarious and beautifully New Zealanderian (is that a word?). Probably wears a little long in the tooth for what is essentially a brilliant sketch idea, otherwise, perfectly played and delivered by all involved. Pokes at the vampiric tropes of yesteryear and finishes on a sweet note. Fun stuff.",
    "rating": "35",
    "date": "September 9, 2014"
  },
  {
    "reviewer": "Rebecca O",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/799308190/",
    "review": "  A genuinely funny mockumentary.",
    "rating": "40",
    "date": "September 30, 2014"
  },
  {
    "reviewer": "TheFeldster",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/913510543/",
    "review": "  It may not have the most clever inspiration behind it, but in the very basic terms of \"laughs per minute\", \"What We Do in the Shadows\" is a brilliant example of comedy that is up there with the best.Four vampires - Viago, Vladislav, Deacon and Petyr - have forgone the creepy castle setting that the vampires normally go for, in exchange for sharing a small flat in Wellington, New Zealand. A documentary crew come in to examine the life of these creatures as they try to find virgin blood, antagonize a group of werewolves and train up newly created vampire Nick. A series of mishaps occur, leading to a series of hilarious situations.Writer/director team Taika Waititi and Jemaine Clement also star in this mockumentary comedy, alongside a local cast including Jonathan Brugh, Ben Fransham, Cori Gonzalez-Macuer, Stu Rutherford, Jackie Van Beek and Clement's \"Flight of the Concords\" co-star Rhys Darby. All were accomplished enough to bring forward brilliant comic timing.This timing, alongside the quality of writing, is the main reason this movie is so hilarious. Yes, some of the jokes do edge towards sillyness, but this sillyness is a step above the cliched Hollywood style of humour that gets churned out every few weeks.I don't want to elevate this film too highly too early, as I haven't done any rewatching yet, but I must say that very few films have made me laugh this consistently throughout the film. This alone puts this film up there with \"Airplane!\" and \"Monty Python's Life of Brian\" (though maybe a tiny rung below the latter).A very funny film that nearly everyone needs to see. Immediately. Lest you be subjected to the procession of shame.",
    "rating": "50",
    "date": "September 30, 2014"
  },
  {
    "reviewer": "Timothy A",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/845150042/",
    "review": "  Not as consistently funny as you want it to be (is anything these days?) but at it's best, it's very, very good, and despite the sheer implausibility of the world it presents, has you accepting it without question.",
    "rating": "40",
    "date": "September 28, 2014"
  },
  {
    "reviewer": "KimF",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/965571513/",
    "review": "  Looked fwd to this, but it was amusing rather than hilarious. Great concept - vampire group house in the suburbs, actors were good - but these things were not exploited to their potential. Middle of the road cinematography and production values. Too slow editing, when it needed to be snappy. The film is a bit lazy.",
    "rating": "25",
    "date": "September 23, 2014"
  },
  {
    "reviewer": "Dave C",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/877669295/",
    "review": "  Four vampires share a flat and... oh, sorry, I've told you the only joke in the entire dreary film.This is a mocumentary which instantly lets itself down as the camera crew seem totally disinterested in the murders which occur regularly or the appallingly boring nature of the vampires.Genuinely one the least interesting films I can remember seeing.",
    "rating": "20",
    "date": "September 16, 2014"
  },
  {
    "reviewer": "Charmaine W",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/937919792/",
    "review": "  A snorting lough out loud comedy that warrants a second visit just to make sure any bits weren't missed whilst my body was having convulsions of hysteria.",
    "rating": "50",
    "date": "September 14, 2014"
  },
  {
    "reviewer": "Steve P",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/794046475/",
    "review": "  This looked like it had so much promise but turned out to fall way below the mark. There are occasional inspired moments but overall nothing really to sink one's teeth into. Felt like a high school amateur night. Actors did their best with what was a superficial script. The first act is the best but it quickly becomes lifeless and directionless. I suppose if you've been living for thousands of years life would become pretty boring. If your taste is not for over the top mockumentary then give this a miss. If you like silly then suck it and see.",
    "rating": "30",
    "date": "September 12, 2014"
  },
  {
    "reviewer": "Chloe C",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/786501467/",
    "review": "  i felt sorry for the undead and didn't find the story witty nor funny!",
    "rating": "10",
    "date": "September 11, 2014"
  },
  {
    "reviewer": "Private U",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/796223125/",
    "review": "  Been waiting to see this one. Margaret and David hated this; but it's hard to hate a movie about a group of vampires sharing a house in Wellington. That alone is worth more than they gave it. Funny, silly, and some great one-liners. Seriously, how could you not like that?",
    "rating": "35",
    "date": "September 10, 2014"
  },
  {
    "reviewer": "Ary L",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/928730859/",
    "review": "  Sore jaw as have not laughed so hard at the movies for a long time. Classic humour, timeless story line, and a number of great quotable lines. Great film, seriously funny and superb satire!",
    "rating": "40",
    "date": "September 10, 2014"
  },
  {
    "reviewer": "Dane T",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/790063908/",
    "review": "  Not as hilarious as I hoped, but still enjoyable.",
    "rating": "20",
    "date": "September 9, 2014"
  },
  {
    "reviewer": "Vera D",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/966647368/",
    "review": "  I haven't laughed so load in a cinema since I was a kid! LOVED IT!",
    "rating": "50",
    "date": "September 8, 2014"
  },
  {
    "reviewer": "Ma&apos;ark T",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/804343233/",
    "review": "  Extremely funny New Zealand humour. Vampire genre done right.",
    "rating": "35",
    "date": "September 8, 2014"
  },
  {
    "reviewer": "Private U",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/797977544/",
    "review": "  I felt really nostalgic when I saw Wellington, remembered what a cool City it is. It's a really silly film, from the beginning to the end. Couldn't stop laughing at the silliness of it but it's not Hollywood clich� American humour at all. You can't predict what is about to happen and the jokes don't feel like 'one liners', they feel like they are connected perfectly the joke before that and the joke before that one.",
    "rating": "50",
    "date": "September 7, 2014"
  },
  {
    "reviewer": "Dan B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/786234324/",
    "review": "  Mags and David hated it, but I don't suppose they are great fans of Clement's other stuff. The style of humour is very much in the same vein as Flight of The Conchords, shit Rhys Darby basically plays a hairier version of Murray. It's not as complete a film as Waititi's last flick 'Boy', but it's funny so it gets a pass.",
    "rating": "35",
    "date": "September 6, 2014"
  },
  {
    "reviewer": "Josh O",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/866609502/",
    "review": "  What you get is one of the better comedies or the year and a damn good horror comedy that manages to set itself apart from movies like Shaun of the Dead, Slither and Zombieland. With its mockumentary execution What We Do in the Shadows is able to make fun of the genre but embrace the characters, throwing plot to the side but exhibiting great satire and also a lot of heart. This is guided but good direction and also by the fact that the film is played straight and not like the characters are in on the joke (though the actors are of course).",
    "rating": "35",
    "date": "September 6, 2014"
  },
  {
    "reviewer": "Toby S",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/865385461/",
    "review": "  Just saw this tonight. Everything everyone's been saying is true. Think Underworld meets Spinal Tap meets Napoleon Dymanite. It's awkward, it's inventive, it's HILARIOUS. Simple infectious humour has created a timeless quotable classic creating a fresh new look on a tired genre you probably never thought possible. Pure genius. Do yourself a favour and go see this film IMMEDIATELY. Movies that nail their goals this perfectly don't come along too often and you'll want to be there just to be able to say \"I saw this in cinemas\" when this movie becomes the stuff of legend. Look out for the little girls on the hunt for a pedophile, and find out why vampires prefer the blood of virgins. Well would you rather eat a sandwich that's been fucked?",
    "rating": "50",
    "date": "September 5, 2014"
  },
  {
    "reviewer": "Kattis K",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/907117175/",
    "review": "  Very funny movie that I is very well done.",
    "rating": "50",
    "date": "July 12, 2014"
  },
  {
    "reviewer": "Felix H",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/916960075/",
    "review": "  Very original and funny. There are plenty of laugh out loud moments to be had. My highlight being the werewolves lead by Rhys Darby.",
    "rating": "45",
    "date": "August 9, 2014"
  }
,
  {
    "reviewer": "Sophie .",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/101988314/",
    "review": "  The whole concept just works.Its basic the trailer extended to an hour and 20 minutes.",
    "rating": "45",
    "date": "August 9, 2014"
  },
  {
    "reviewer": "Oliver B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/911412077/",
    "review": "  This has got to be my second favorite film of all time, great laughs and just a all around good time.",
    "rating": "wts",
    "date": "July 28, 2014"
  },
  {
    "reviewer": "Edward D",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/940810883/",
    "review": "  It's another great, offbeat New Zealand comedy, with constant and clever laughs delivered by a consistently hilarious cast - one that makes it feel like New Zealand comedy really does stand out from everyone else's.(Excellent)",
    "rating": "40",
    "date": "July 23, 2014"
  },
  {
    "reviewer": "J.d. D",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/784463240/",
    "review": "  One of the best movies I have seen as of late. The humour kept rolling throughout the film. Each character was well developed and an absolute laugh riot.",
    "rating": "50",
    "date": "July 19, 2014"
  },
  {
    "reviewer": "Martine K",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/816906843/",
    "review": "  I haven't laughed that much in a movie in ages, this is an instant classic comedy, a MUST see!",
    "rating": "40",
    "date": "July 12, 2014"
  },
  {
    "reviewer": "Adrian M",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/788780708/",
    "review": "  Brilliant understated comedy.",
    "rating": "45",
    "date": "July 10, 2014"
  },
  {
    "reviewer": "John O",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/928643182/",
    "review": "  low-key, witty fun on horrors of flatting and trying to fit into a square world when you are a round peg (so to speak). Full of in-jokes only Wellingtonians will get (e.g. the zombies live in Karori...) but they don't spoil the fun.",
    "rating": "40",
    "date": "July 9, 2014"
  },
  {
    "reviewer": "Mark R",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/965693376/",
    "review": "  This was a total surprise, and a wonderful one at that. Every gag appears and then has its twist and clever visual or off focus support. Very clever film making as well as comedy. For those of us who love Wellington, i can tell all others that there are a host of 'in jokes' in the locations chosen, the placement of events and the people who just appear in windows and cut away shots. A very clever and funny link to a wonderful city. Just go and laugh your heart out, but be careful who you are sitting next to!!!",
    "rating": "45",
    "date": "July 8, 2014"
  },
  {
    "reviewer": "Kate H",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/959346492/",
    "review": "  Fantastic! The \"Mockumentary\" format was unobtrusive and fit the story line well. It was hilarious, a lot of puns and if you like awkward humour this is one for you. It had a strange way of making fun of itself the whole time. It is a bit short and it's not epic or revolutionary, you won't walk out shocked or awed, however you will leave smiling, laughing and chatting about \"that bit where...\" This is a must see.",
    "rating": "50",
    "date": "July 7, 2014"
  },
  {
    "reviewer": "Karen H",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/931063139/",
    "review": "  How can we watch it in the US? Netfix, Hulu, or Amazon? Who will be the smart one to pick it up?",
    "rating": "wts",
    "date": "July 4, 2014"
  },
  {
    "reviewer": "Victoria B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/788754699/",
    "review": "  Hate to brag, but I've seen it! Not only is it funny, clever, insightful, and got some pretty impressive special effects, but it's actually deserving of the hype. I could be called biased as a New Zealand native, but I've never been a huge fan of Flight of the Conchords, and didn't like Eagle Vs Shark, so we can put patriotism aside. I liked this film as a film buff, and the marketing campaign was genius - miss at your peril, because this one's going to get a lot of mileage!",
    "rating": "45",
    "date": "July 1, 2014"
  },
  {
    "reviewer": "Kristen C",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/912100688/",
    "review": "  Quintessential New Zealand humor with enough bite and endurance to appeal to the international crowd. As funny as it is silly. And as silly as it is cleverly crafted.",
    "rating": "50",
    "date": "July 1, 2014"
  },
  {
    "reviewer": "Abe F",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/856055681/",
    "review": "  This is probably the most genuinely funny and competently-made Kiwi film I've seen in a very long time. The dynamic coupling of Taika and Jemaine is the NZ deadpan equivalent of someone like Lord and Miller, only with a hell of a lot more absurdity. As with L&M, it's more than just sight gags. There's actual wit permeating the dialogue and everything that happens is in benefit to the genre or characters, respectively.I'll wait for How to Train your Dragon 2 and Interstellar before making any ludicrous claims, but from how great WWDITS is, it has severe clout in the 'best of year' category for me.",
    "rating": "50",
    "date": "June 28, 2014"
  },
  {
    "reviewer": "Cam B",
    "reviewer_url": "http://www.rottentomatoes.com/user/id/878124078/",
    "review": "  Smart and breathing fresh life into such an overdone genre, What We Do In The Shadows is quite possibly the best comedy to come out of New Zealand so far!",
    "rating": "50",
    "date": "June 19, 2014"
  }
,]